[
  {
    "id": 1,
    "title": "VIZLA",
    "description": "La presentación fue sobre del proyecto integrador 'THE NEXUS BATTLES IV: VIZLA' de la UPB.\nEl equipo abordó la pregunta problema de cómo diseñar e implementar un sistema modular y escalable en la nube para los módulos de correo y usuarios del videojuego.\n\nEl enfoque metodológico se basó en el marco de trabajo Scrum, con diapositivas que detallan el ciclo del Sprint, las ceremonias y su aplicación en el Ciclo de Vida del Desarrollo de Software (SDLC). También se expusieron los Principios SOLID para asegurar un buen diseño de código.\n\nA nivel de tecnología, se presentó un Diagrama de arquitectura en la nube que muestra la interacción entre componentes como Cloud Run, Compute Engine y un Balanceador de Carga (LBaaS), ilustrando una arquitectura de microservicios.\n\nLos Resultados del Proyecto se midieron con métricas, como el informe de velocidad por Sprint. El equipo mostró una evolución: en el Sprint I comprometieron 48 puntos y completaron 0, mientras que en el Sprint III comprometieron 137 puntos y completaron 111, logrando una velocidad de 0.8102. También se mostró un gráfico de Burndown para el Sprint II.\n\nFinalmente, las Conclusiones destacaron que, a pesar de las dificultades, el equipo demostró madurez en la aplicación de los principios ágiles y utilizó los incidentes como experiencia de aprendizaje, lo que resultó en una mejora en la eficiencia y la productividad.",
    "members": [
      "AGUILAR LATORRE DANIEL FELIPE",
      "BRAVO VERGARA PABLO ANTONIO",
      "GOMEZ CADENA SANTIAGO",
      "HERNANDEZ CARRANZA DAVID RICARDO",
      "ORTIZ VARGAS CARLOS FERNANDO",
      "PICO GARCIA ANDRES FELIPE"
    ],
    "date": "2025-10-28",
    "teacher": "LENIN JAVIER SERRANO GIL",
    "course": "PROYECTO INTEGRADOR II",
    "project": "THE NEXUS BATTLES IV: “A NEW HOPE”",
    "images": ["/vizla/1.jpg","/vizla/2.jpg","/vizla/3.jpg","/vizla/4.jpg","/vizla/5.jpg","/vizla/6.jpg","/vizla/7.jpg","/vizla/8.jpg","/vizla/9.jpg","/vizla/10.jpg","/vizla/11.jpg","/vizla/12.jpg","/vizla/13.jpg","/vizla/14.jpg","/vizla/15.jpg"],
    "comments": [
      {
        "text": "Uno no puede evaluar como profesor los intentos sino el producto sí después de que este producto evaluamos el procedimiento pero yo no veo un producto en lo que se dedicaron en la presentación fue a dar excusas todo el tiempo. Uno no hace eso en una presentación. Jamás se pone uno a hacer diez minutos de excusas. Yo les recomiendo, no para ahorita, sino para su vida personal, para su vida profesional. Es mejor decir, no presento, póngame cero, que pararse a ponerse ahí, a exponer 10 minutos de excusas. Que ni siquiera la dicen, sino la leen. ¿Sí? Me parece muy mal presentado, me parece... Y ustedes dirán, es que nos dan duro. Pero es que el darle duro no es decirles la verdad. Es algo que ustedes deben tomar para su vida profesional. Me parece que si no aprenden ahorita, después les va a ir duro. Ahí sí les va a ir duro. Entonces, considero que no pueden volver a hacer este tipo de cosas, que la comunicación, pero ¿qué pasa? Ustedes van a ser ingenieros de sistemas, ¿sí? Van a estar graduados representando no solo a ustedes, sino a la universidad y además a sus compañeros, porque entonces dicen, ah, es que eso es de allá, ¿sí?",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Jóvenes, pues yo pienso que de todo se aprende y pues la importancia de estar ahí al frente contándonos su historia no de éxito sino de fracaso también nos puede servir de ejemplo para el resto de equipos para saber qué no se debe hacer. Pero más allá de eso, yo me sorprendí cuando mostraron el producto porque sí, con todo lo que habían dicho, había esperado muy bajo producto, pero es que no presentaron sino solo el inicio de sesión, que me parece que para estar ya en séptimo, sexto, semestre, factorial, es muy básico. Entonces, en un acto reflexivo y corto, me gustaría que cada uno me dijera qué fue lo que cada uno hizo terrible que no volvería a hacer para el próximo proyecto, para que nos quede como experiencia.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      }
    ]
  },
  {
    "id": 2,
    "title": "ELDAR",
    "description": "El grupo ELDAR, que desarrolló el módulo de inventario para el videojuego \"THE NEXUS BATTLES IV\", se enfocó en crear un entorno tecnológico para un juego de rol por turnos en modalidad héroe.\n\nLa Situación Problema que abordaron fue cómo implementar una plataforma que gestione misiones, torneos y enfrentamientos, garantizando funcionalidades de juego y conectividad.\n\nEl Objetivo General fue implementar un servicio web con una infraestructura en la nube para el despliegue del juego, integrando un modelo de Inteligencia Artificial para soportar misiones y enfrentamientos (tanto JcJ como JcE).\n\nLos Objetivos Específicos se centraron en la lógica del juego y el inventario: desarrollar la lógica de funcionamiento de ítems, héroes y armaduras para que modifiquen las estadísticas del jugador, y crear un sistema de gestión de inventario que permita al jugador visualizar, equipar y desequipar productos, asegurando la persistencia de la información en tiempo real.\n\nEn la sección de Resultados, el grupo ELDAR mostró varios diagramas técnicos:\n\nModelo de Negocio y Arquitectura del Sistema (diagramas de clases/componentes) detallados.\n\nModelo Entidad-Relación para garantizar la persistencia de datos en el dominio.\n\nDiagrama de Despliegue en la nube, mostrando el uso de contenedores, un balanceador de carga y una base de datos.\n\nDiagramas de Casos de Uso para las funcionalidades principales: Gestión de Inventario (acceder, listar, equipar ítems), Gestión de Tienda (ver, crear y eliminar compras), y el Sistema de Búsqueda (buscar ítems y visualizar resultados).\n\nUna métrica ágil denominada Burndown Chart Timer Sprint para monitorizar el progreso.\n\nEl Marco Conceptual incluyó referencias específicas para tecnologías de red y comunicación (Dirección IP, HTTP, SSH, DNS), fundamentales para la conectividad y el despliegue del servicio web.",
    "members": [
      "ESPINEL DOMINGUEZ PEDRO MATEO",
      "GUTIERREZ MEJIA DANIEL FELIPE",
      "MORENO VELANDIA DIEGO ALEJANDRO",
      "RINCON RAMIREZ LENNY ALEJANDRO",
      "SALCEDO HERNANDEZ BRENDA LUZ",
      "SUAREZ MENDOZA DIEGO ALEJANDRO"
    ],
    "date": "2025-10-28",
    "teacher": "LENIN JAVIER SERRANO GIL",
    "course": "PROYECTO INTEGRADOR II",
    "project": "THE NEXUS BATTLES IV: “A NEW HOPE”",
    "images": ["/eldar/1.jpg","/eldar/2.jpg","/eldar/3.jpg","/eldar/4.jpg","/eldar/5.jpg","/eldar/6.jpg","/eldar/7.jpg","/eldar/8.jpg","/eldar/9.jpg","/eldar/10.jpg","/eldar/11.jpg","/eldar/12.jpg","/eldar/13.jpg","/eldar/14.jpg","/eldar/15.jpg","/eldar/16.jpg","/eldar/17.jpg","/eldar/18.jpg","/eldar/19.jpg","/eldar/20.jpg","/eldar/21.jpg","/eldar/22.jpg","/eldar/23.jpg","/eldar/24.jpg","/eldar/25.jpg","/eldar/26.jpg","/eldar/27.jpg","/eldar/28.jpg","/eldar/29.jpg"],
    "comments": [
      {
        "text": "No existe un proceso automatizado de commits mediante CI/CD.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "Deberían usar un nivel de abstracción más alto, ya que el exceso de detalle no es necesario para expresar la arquitectura.\n\nFaltan detalles de sintaxis porque no se utilizó un software especializado para realizar los diagramas, y además los extends están mal direccionados, como ya se los había mencionado.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 3,
    "title": "KRYZE",
    "description": "El proyecto realizado por KRYZE mostró que su trabajo se enmarcó en el objetivo de la UPB-COMPANY de desplegar un juego web por turnos denominado \"THE NEXUS BATTLES IV: A NEW HOPE\".\n\nPregunta Problematizadora: \"¿Cómo desarrollar una solución tecnológica que permita al grupo empresarial desplegar un juego web por turnos llamado THE NEXUS BATTLES IV: A NEW HOPE?\"\n\nEnfoque Funcional\nEl equipo KRYZE se concentró en los módulos centrales de interacción del juego:\n\nMódulo de Batalla: Se caracteriza como un proceso cuantificado e interactivo.\n\nMódulo de Comentarios: Se define como interactivo.\n\nMetodología y Gestión de Proyecto\nKRYZE implementó rigurosamente el marco de trabajo Scrum.\n\nSe presentó el diagrama del proceso, que incluye la planificación del Sprint, el Sprint Backlog, la reunión diaria, la revisión y la retrospectiva.\n\nHerramientas: El trabajo se documentó usando herramientas como Jira, de donde se extrajeron el Product Backlog (lista detallada de funcionalidades) y el Story Mapping (diagrama jerárquico de historias de usuario).\n\nMétricas de Rendimiento: La eficiencia fue medida con:\n\nBurndown Chart: Muestra la evolución del trabajo pendiente a lo largo del tiempo.\n\nInforme de Velocidad: Indica que el equipo completó 197 puntos de trabajo de los 200 comprometidos, reflejando una alta velocidad de equipo.\n\nDiseño de la Infraestructura y Costos\nEl módulo KRYZE detalló la infraestructura en la nube y su presupuesto, que es fundamental para el despliegue del juego.\n\nInfraestructura en la Nube: El diseño incluyó el uso de Google Kubernetes Engine (para nexus-battle-iv-battle, nexus-battle-iv-inventory y nexus-battle-iv-comentaries) y Cloud Run (para nexus-battle-iv-users).\n\nAlmacenamiento de Datos: Utilización de Cloud Memorystore (para nexus-battle-iv-reddis) y MySQL Cloud SQL (para nexus-battle-iv-db).\n\nPresupuesto: El costo estimado total para la infraestructura fue de $1,404.27/mes, dividido en $1,054.23 para cómputo y $350.04 para almacenamiento de datos.\n\nFuncionamiento de la Jugabilidad (Fase 3)\nSe presentó el flujo de la jugabilidad en la fase de preparación de la batalla, que incluye:\n\nCreación de la batalla.\n\nEl sistema verifica ítems equipados por los jugadores y crea y registra el estado inicial.\n\nGeneración del token de turnos.\n\nInicio de la cola de turnos.\n\nEl flujo continúa con la solicitud del cliente de \"Mover ficha para votar\" y la respuesta al cliente sobre el \"Estado total del rival\".\n\nEn resumen, KRYZE fue el responsable del núcleo de la experiencia de juego (batalla y comentarios), la gestión de sus respectivos módulos, con la definición detallada de la infraestructura y el presupuesto para el despliegue de los microservicios en la nube.",
    "members": [
      "BLANDON ARDILA RUBEN SANTIAGO",
      "CARVAJAL GIRALDO JUAN PABLO",
      "FALON PALMEZANO JESUS DAVID",
      "FUENTES PATIÑO JUAN DAVID",
      "LEGUIZAMO VASQUEZ JOSE DANIEL",
      "RODRIGUEZ FORERO CAMILO ANDRES"
    ],
    "date": "2025-10-28",
    "teacher": "LENIN JAVIER SERRANO GIL",
    "course": "PROYECTO INTEGRADOR II",
    "project": "THE NEXUS BATTLES IV: “A NEW HOPE”",
    "images": ["/kryze/1.jpg","/kryze/2.jpg","/kryze/3.jpg","/kryze/4.jpg","/kryze/5.jpg","/kryze/6.jpg","/kryze/7.jpg","/kryze/8.jpg","/kryze/9.jpg","/kryze/10.jpg","/kryze/11.jpg","/kryze/12.jpg","/kryze/13.jpg","/kryze/14.jpg","/kryze/15.jpg","/kryze/16.jpg","/kryze/17.jpg","/kryze/18.jpg","/kryze/19.jpg","/kryze/20.jpg","/kryze/21.jpg","/kryze/22.jpg","/kryze/23.jpg","/kryze/24.jpg","/kryze/25.jpg","/kryze/26.jpg","/kryze/27.jpg","/kryze/28.jpg","/kryze/29.jpg","/kryze/30.jpg","/kryze/31.jpg","/kryze/32.jpg","/kryze/33.jpg","/kryze/34.jpg"],
    "comments": [
      {
        "text": "Buen planteamiento del problema y solución.",
        "teacher": "LENIN JAVIER SERRANO GIL",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 4,
    "title": "ROOK",
    "description": "El proyecto ROOK, parte del integrador 'THE NEXUS BATTLES IV: A NEW HOPE', abordó la necesidad de un aplicativo web para un videojuego de rol por turnos con combates JcJ y JcE, misiones, torneos, subastas e inteligencia artificial en la nube.\n\nPregunta Problematizadora: '¿Cómo implementar un sistema web que incorpore mecánicas de combate por turnos, gestión de inventarios y progresión de personajes, permitiendo partidas JcJ y JcE?'\n\nObjetivo General: Implementar un servicio web con inteligencia artificial e infraestructura en la nube para desplegar THE NEXUS BATTLES IV, habilitando misiones, torneos y enfrentamientos multijugador o contra la máquina.\n\nObjetivos Específicos (Módulos de ROOK):\n- Módulo de Subasta: intercambio de productos con créditos o dinero real, pujas y compras inmediatas.\n- Chatbot con IA para soporte al cliente y respuesta sobre productos y reglas.\n- Módulo de Notificaciones para alertas de subastas, torneos y misiones.\n\nEn resumen, ROOK se enfocó en los servicios auxiliares y comerciales del juego, desarrollando el sistema de subastas, el chatbot de soporte y las notificaciones en línea.",
    "members": [
      "BENITEZ PAJARO JUAN EDUARDO",
      "CASTELLANOS RINCON SANTIAGO",
      "FUENTES ROMERO LUIS ALFREDO",
      "LIZARAZO ORTIZ KAREN NICOL DAYANNA",
      "SANABRIA GUTIERREZ WILLIAM OSWALDO",
      "TOLEDO DE LA CRUZ GIAN KIEFFER"
    ],
    "date": "2025-10-28",
    "teacher": "LENIN JAVIER SERRANO GIL",
    "course": "PROYECTO INTEGRADOR II",
    "project": "THE NEXUS BATTLES IV: “A NEW HOPE”",
    "images": ["/rook/1.jpg","/rook/2.jpg","/rook/3.jpg","/rook/4.jpg"],
    "comments": [
      {
        "text": "Está bien por la explicación de los modelos de redes neuronales.",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Porque Utilizaron puertos y adaptadores, y cómo afecta la deuda al proyecto.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      }
    ]
  },
  {
    "id": 5,
    "title": "WREN",
    "description": "El grupo WREN TEAM presentó el módulo de Inteligencia Artificial (IA) dentro del proyecto 'THE NEXUS BATTLES IV: A NEW HOPE'.\n\n1. Descripción del Proyecto: Se trata de un videojuego por turnos centrado en héroes, con misiones y obtención de mejoras (equipo, ítems, habilidades). El desarrollo se realizó como un servicio web con un modelo de IA integrado y soportado en infraestructura en la nube.\n\n2. Marco Conceptual y Diseño:\n- Se presentó un Diagrama Conceptual que muestra el flujo de trabajo del sistema y la interacción con la IA.\n- Se mostró la interfaz de usuario correspondiente a la funcionalidad 'Combatir contra IA'.\n- Se detalló un Diagrama de Secuencia para el proceso de 'Llenar Sala con IA'.\n- Se incluyó una tabla de normalización de parámetros de héroes (HP, poder, defensa, daño, etc.) utilizada en el modelo de IA.\n\n3. Métricas y Gestión:\n- Planificación: Se elaboró un Diagrama de Gantt (julio–octubre 2025/2023) con tareas y plazos definidos.\n- Métricas de Jira: El proyecto cuenta con 5 épicas, 36 historias de usuario y un total de 624 puntos de historia.\n- Progreso: Se presentaron gráficos Burn-Up para los sprints 1 y 2, mostrando la evolución del trabajo, donde el primer sprint tuvo como meta el prototipo de combate con IA.\n- Revisión: Se realizaron sprints retrospectivos para evaluar el desempeño y planificar mejoras continuas.",
    "members": [
      "ESPITIA BUENO JULIAN ALBERTO",
      "FLOREZ JULIO JEISON STEVEN",
      "HALLADO ABAUNZA RAUL SANTIAGO",
      "NUÑEZ RINCON SERGIO ELIECER",
      "RODRIGUEZ CASTRO JOHAN DAVID",
      "URQUIJO BAUTISTA JOSEPH CAMILO"
    ],
    "date": "2025-10-28",
    "teacher": "LENIN JAVIER SERRANO GIL",
    "course": "PROYECTO INTEGRADOR II",
    "project": "THE NEXUS BATTLES IV: “A NEW HOPE”",
    "images": ["/wren/1.jpg","/wren/2.jpg","/wren/3.jpg","/wren/4.jpg","/wren/5.jpg","/wren/6.jpg","/wren/7.jpg","/wren/8.jpg","/wren/9.jpg","/wren/10.jpg","/wren/11.jpg"],
    "comments": [
      {
        "text": "No me queda claro con qué modelo de datos lo hicieron, qué modelo de red neuronal. Hablaron de que el juego juega contra la IA, pero en el video no presencié nada..Sinceramente me dejan sin sabor.",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Hola. Bueno, para todos, esto... La guía legendaria, ¿no? La guía mitológica. Siempre estuvo ahí, Yo sé que tienen trabajo, que hicieron bastante trabajo, porque lo descubrimos durante el curso. Pero había cosas que se estaban haciendo y las conversamos mucho. Entonces, el punto es, Tienen cosas hechas y hay cosas que quedaron detrás que en la presentación no se ve. Y entonces el profesor viene y le dice que quedó sin sabor y que no dio nada. ¿Sí? Existiendo trabajo, ¿no? Entonces, acuérdense, esto es para, yo te lo digo yo y lo repito una y otra vez, y la cosa no es tan sola. su momento de gloria si ustedes no saben vender su trabajo y su producto ¿quién lo va a hacer? entonces aquí el público se queda y otra cosa no hay que ser pasivos a las críticas o a lo que te dicen si tú tienes un fundamento y sabes de qué estás hablando tienes que contestar ¿vale? no lo digo solo por ustedes lo he visto en muchos equipos muchos equipos que alguien le dice su diapositiva está fea y bajan la cabeza y dicen sí, está fea mi culpa. No, ¿por qué? Defiendan su posición, defiendan lo que ustedes hicieron. Es su trabajo. Cuando usted vaya a hacer su tesis, tiene que defender su trabajo. Si el jurado le dice, tienes que tal cosa, tal cosa. Tienes que pararte con propiedades. No, señor, es así. Porque en el marco conceptual definimos esto, esto y esto y esto. porque la teoría dice esto y esto y esto, y según fue anotado, tal, tal, tal, ¿vale? Entonces, eso pasó, ese incidente pasa en este grupo, lo he visto muchas veces, y siempre que he querido decir eso, no tienen por qué decir sí a todo, o sea, si usted tiene una razón, porque hizo las cosas como las hizo, pues diga la razón, no tiene que decir sí, tengo la culpa, ¿vale? ¿Bien? Piénselo así de cariño, ¿vale? Bueno, muchas gracias por la presentación. Buen trabajo.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 6,
    "title": "EQUIPO ARRYN",
    "description": "El proyecto ARRYN se centró en ofrecer una solución tecnológica para mitigar la sobrecarga de información que enfrentan los consumidores al buscar productos electrónicos distribuidos en múltiples plataformas de comercio electrónico.\n\nSituación Problema: Los consumidores deben visitar múltiples sitios web, lo que fragmenta la información sobre precios, características y beneficios, llevando a decisiones de compra ineficientes.\n\nObjetivos Específicos:\n- Implementar un sistema de web scraping para extraer y normalizar datos de productos.\n- Aplicar Inteligencia Artificial (como BERT para embeddings) para generar insights y mejorar la experiencia de búsqueda y selección.\n- Diseñar una arquitectura hexagonal en el backend con APIs RESTful, enfocándose en la mantenibilidad y escalabilidad.\n\nMarco de Trabajo y Metodología:\nSe aplicó Scrum como marco de trabajo, incluyendo Story Mapping.\nSe definieron 117 historias de usuario y se mostraron métricas del Sprint 1 (tareas integradas, completadas, presentadas).\n\nTecnología y Desarrollo (DevOps):\n- Embeddings: flujo detallado para la construcción de texto de producto.\n- GitFlow y CI/CD: integración continua con GitHub Actions y despliegue en AWS Cloud.\n- Integración Jira ↔ GitHub: sincronización bidireccional de tareas y código.\n- Workflow Automático: PR abierto pasa a 'In Progress'; PR merged pasa a 'Done'.\n- Uso de plantillas estandarizadas para etiquetas (Prioridad, Tipo, Estado, Componente).\n\nConclusiones:\nEl uso de web scraping resaltó la importancia de respetar los términos de uso de los sitios web.\nEl frontend (desarrollado con React JS y Vite) se centró en la experiencia de usuario (UX), logrando una aplicación modular y con tiempos de carga reducidos.",
    "members": [
      "Juan Camilo Gómez Manotas",
      "Juan David Monsalve Niño",
      "Nicolas Rodríguez Acevedo",
      "Sofia Santis Silva",
      "Tomas Uribe Sanchez"
    ],
    "date": "2025-10-28",
    "teacher": "DANITH PATRICIA SOLORZANO ESCOBAR",
    "course": "PROYECTO INTEGRADOR II",
    "project": "EQUIPO ARRYN",
    "images": ["/arryn/1.jpg","/arryn/2.jpg","/arryn/3.jpg","/arryn/4.jpg","/arryn/5.jpg","/arryn/6.jpg","/arryn/7.jpg","/arryn/8.jpg","/arryn/9.jpg","/arryn/10.jpg","/arryn/11.jpg"],
    "comments": [
      {
        "text": "¿Ya qué dijo? ¿Qué es un scraper? ¿Qué es eso del contexto del scraper? ¿Qué es scraper de qué? ¿Y en términos técnicos? Eso de “escrappeo” no existe, ¿qué es crawling? ¿Qué es un bucket? ¿Un servicio? ¿Qué es exactamente? Ah, para almacenar en S3. ¿Y por qué se llama S3? ¿Y qué es S2? ¿Qué es una cache? ¿Qué significa acceso rápido? ¿Qué es ser eficiente? ¿Velocidad? ¿Qué es RDS? ¿Qué es una base de datos estructurada? ¿Tus amigos pueden hablar? ¿Tú me tienes que contestar todo? ¿Qué es Django? ¿De qué, perdón? ¿Por qué usan Mongo? Primero, ¿qué es Mongo? ¿Y por qué lo usan? ¿Cómo así que mejoró? ¿Por qué mejoró? Ahora, alguien dijo por aquí que Roberta mejoró. ¿Cómo así que mejoró? ¿Por qué mejoró? ¿Entendieron? Ah, no tiene marco conceptual. No entendimos. ¿Qué tiene de importante usar la fuente de Google? ¿Qué es accesibilidad? ¿Qué principio de accesibilidad cumple según la W3C? ¿Qué es facilidad de componentes y carga rápida? Yo hago componentes en JavaScript que corren más rápido que en React. ¿De dónde sacas esas métricas? ¿Son de publicidad o realmente te sirven? Es publicidad. Bueno, entendimos la lección: sin un marco conceptual no se pueden parar a presentar. Con lo demás, pues bueno, más o menos entendí qué era la aplicación; me costó mucho trabajo porque en la introducción teníamos la pregunta problema, pero necesitábamos introducir un poco mejor el contexto del problema. Estoy aquí debatiéndome si es scraping o crawling, pero ¿para qué es? Ya al final, cuando le contestaste a lo del rollo, pues ya me quedó claro. Bueno, muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 7,
    "title": "EQUIPO BARATHEON",
    "description": "El proyecto QueHayPaHacer busca centralizar, organizar y difundir automáticamente la información sobre eventos y actividades culturales en Colombia, la cual se encuentra dispersa en múltiples fuentes digitales, dificultando su acceso y reduciendo la participación ciudadana.\n\nProblema Identificado:\nLa información cultural está fragmentada en varios portales y redes sociales, lo que genera dificultades para que los ciudadanos encuentren eventos y actividades de manera eficiente.\n\nObjetivos Clave:\n- Construcción de Sistema de Recolección: Desarrollar un sistema automatizado de scraping y crawling para recopilar y actualizar eventos de diversos portales y redes sociales, almacenando los datos en bases híbridas (SQL/NoSQL).\n- Cumplimiento Legal y Seguridad: Aplicar mecanismos de seguridad y asegurar el tratamiento adecuado de datos personales conforme a la Ley 1581 de 2012 y el Decreto 1081 de 2015.\n- Desarrollo de Plataforma Web: Implementar una plataforma web responsive con filtros, categorías y búsqueda dinámica, que permita la visualización y navegación fluida en distintos dispositivos.\n\nMetodología de Desarrollo (Scrum):\n- Marco de Trabajo: Uso de Scrum para adaptarse y mantener la trazabilidad del proyecto.\n- Planificación: Story Mapping con 6 épicas y 43 historias de usuario, desglosadas en tareas organizadas en sprints.\n- Ejecución: Sprint 1 completado al 100%, con dailies dos veces por semana para seguimiento y optimización.\n\nMarco Tecnológico y Diseño:\n- Lenguajes y Frameworks: Python, JavaScript, HTML, CSS, React.\n- Base de Datos: PostgreSQL (para datos relacionales y no relacionales).\n- Patrones de Diseño:\n  - MVC (Modelo-Vista-Controlador): Organización en capas, mejora del mantenimiento y colaboración.\n  - Repository Pattern: Gestión de persistencia de datos aislando la lógica de acceso a la base de datos.\n\nFlujo de Recolección de Datos (Machine Learning/NLP):\n1. Recolección de datos (scrapers).\n2. Construcción del dataset de entrenamiento.\n3. Preprocesamiento del lenguaje.\n4. Entrenamiento del modelo.\n5. Validación y precisión.\n\nUso de GitHub:\nImplementación de Git Flow para cada servicio, utilizando ramas para features, hotfixes y releases, asegurando colaboración sin conflictos de merge.\n\nArquitectura e Infraestructura (AWS):\n- Hosting: Frontend estático en GitHub Pages.\n- Ruteo: AWS Route 53 gestiona la resolución DNS.\n- Balanceo de Carga: Application Load Balancer (ALB).\n- Base de Datos: PostgreSQL como servicio administrado.\n- Seguridad: Infraestructura en VPC de AWS, con gestión de grupos de seguridad y IPs elásticas.\n- Costos: Costo estimado total de AWS: USD 75.87.\n\nDiagrama de Caso de Uso (Funcionalidad):\nEl sistema permite a los usuarios o entidades Reservar sitios y Enviar eventos, actualizando automáticamente la base de datos con información externa, clasificando por categorías, generando ofertas recomendadas y gestionando posiciones premium.\n\nConclusiones y Lecciones Aprendidas:\n- Claridad de Requisitos: Definir requisitos funcionales, no funcionales y de seguridad fue clave.\n- Organización: Historias de usuario alinearon la visión del cliente con la ejecución.\n- Diseño de Código: Patrones de diseño permitieron mantener un código limpio y un flujo de trabajo constante.\n- Trabajo en Equipo (Scrum/Git): Scrum facilitó la colaboración y el Git Flow garantizó control de versiones sin problemas de merge.\n\nAspectos por Mejorar:\n- Inicio lento en sprints, requiriendo planificar historias pequeñas desde el Día 1.\n- Estancamiento en la última semana, con tareas mínimas sin cerrar, necesidad de reforzar seguimiento diario y priorizar cierres.\n- Dependencia del empuje final, concentrando gran parte del trabajo en los últimos días, requiriendo distribuir mejor las tareas y fomentar entregas continuas.",
    "members": [
      "Fernando Cancelado Figueroa",
      "Zarhet Valentina Fuentes Bottia",
      "Nicolas García Mejía",
      "Jan Dante Leal Arenas",
      "Bryan Gonzalo Lizcano Duran"
    ],
    "date": "2025-10-28",
    "teacher": "DANITH PATRICIA SOLORZANO ESCOBAR",
    "course": "PROYECTO INTEGRADOR II",
    "project": "EQUIPO BARATHEON",
    "images": ["/baratheon/1.jpg","/baratheon/2.jpg","/baratheon/3.jpg","/baratheon/4.jpg","/baratheon/5.jpg","/baratheon/6.jpg","/baratheon/7.jpg","/baratheon/8.jpg","/baratheon/9.jpg","/baratheon/10.jpg","/baratheon/11.jpg","/baratheon/12.jpg","/baratheon/13.jpg","/baratheon/14.jpg","/baratheon/15.jpg","/baratheon/16.jpg","/baratheon/17.jpg","/baratheon/18.jpg","/baratheon/19.jpg","/baratheon/20.jpg","/baratheon/21.jpg","/baratheon/22.jpg","/baratheon/23.jpg","/baratheon/24.jpg","/baratheon/25.jpg"],
    "comments": [
      {
        "text": "Buenas tardes. ¿Cómo están? No me quedó claro el CRM. ¿Qué es un ERP?",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      },
      {
        "text": "Buenas tardes, muchachos. ¿Cómo vamos? Por favor, el responsable de la IA, ¿quién es? Alguien que no seas tú, por favor. No hay nadie más encargado. Bueno, los que venían conmigo, por favor, que se anime uno. Por favor, la diapositiva donde explican todo el flujo de la IA. Perfecto. Por favor, ¿me vuelven a explicar cada uno de esos puntos? Tú no sabes, la persona que yo escoja o que se atreva a responder, que no seas tú, por favor. Si nadie se anima, entonces yo digo un nombre. Bueno, y como no tenemos mucho tiempo, voy a hacerlo rápido: señor Jan Dante, por favor, ¿qué hago yo con esos datos? Hasta ahora apenas me has explicado el punto uno y el punto dos. ¿Cómo entrena un chatbot? Señor Cancelado, por favor, colabore. ¿Utilizando librerías? ¿Qué necesito yo para entrenar un chatbot? Mi pregunta: ya lo dijeron en su momento, pero necesito oírlo de ustedes. Señor Nicolás, ¿cómo hago el preprocesamiento del lenguaje? Siempre lo explico en clase, ¿cómo lo hicieron ustedes? Bueno, por favor, Zarhet, dame la respuesta primero. ¿Cuántas capas de red neuronal? ¿De cuántas? ¿Cómo se le dice la pregunta? Me dices: “tengo tres capas intermedias”. Cada capa intermedia, ¿cuántos nodos tiene?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Hola, buenas tardes. Hay varias preguntas, pero tengo algo importante que quiero mirar y es para todos. Hay una diapositiva donde dice cuántos requerimientos tienen, ¿la pueden ubicar, por favor? Esto es algo que me parece importante para todos. ¿Cuántos? Dice 54 requerimientos, eso es, haciendo los requerimientos que fueron 54 funcionales y 15 no funcionales; creo que esos números tienen que evaluarlos porque es imposible que si tienes 54 requerimientos funcionales solo tengas 15 no funcionales, no tiene sentido, ¿por qué? Los colores y ser responsivo es funcional. Lo no funcional es lo que el cliente no te cuenta, ¿sí? Entonces, en la página tenían un registro, ¿era? Sí, señor. Ah, en la página tenían un registro, ¿el funcional es ese registro? ¿Qué no funcional? Las contraseñas, por ejemplo, que deben tener varios... Eso es funcional porque el cliente te lo dice. ¿Qué no es funcional? No, no, no, no tienes que contestar, hay 50 personas, déjalos a ellos, que tú ya hablaste bastante. Compañeros, ¿cuántos no funcionales hay en el registro? Ah, eso es funcional, eso te lo dice el cliente. Que todavía no entienden qué es funcional y no funcional: todo lo que tengas que hacer detrás para hacer un registro es no funcional. Tienen que conectarse a una base de datos, tienen que hacer un insert, revisar, analizar los datos, hacer unas, si es por API o no sé qué, tienen que hacer un montón de cosas. Todo eso es no funcional porque el cliente no te dice que tienes que hacer eso, el cliente te dice: necesito un registro con este tipo de datos y tienes que registrarlo. Entonces, es imposible que si tienes 54 elementos funcionales tengas solo 15 no funcionales. Esto lo digo porque lo tenía anotado también el grupo anterior y tenían el mismo detalle, entonces tenían 9 no funcionales. Imagínense, ¿cómo vas a hacer un sistema con 9 no funcionales? Fíjense, te echa uno en el registro, ¿sí? ¿Me entienden la apreciación? Bueno, eso es más para todo el mundo, para todos los que están aquí. Entonces, es un problema que tenemos aquí con la ingeniería de software que siempre nos están fallando en estos conceptos. Y la otra pregunta que tenía por acá, si era directamente: ¿por qué es importante usar Draw.io? Es algo que también me parece que en el grupo pasado salió por ahí, a usar el estilo todo y lo montaron dos veces. ¿Por qué hablamos de las herramientas, por qué están ahí, por qué nombran la herramienta con tanta relevancia? ¿Pero qué? Yo no puedo hacer el papel, ¿sí? Y si me vas a decir: no, este trabajo me ofrece, ¿qué te ofrece? No te revisa ni semántica ni sintaxis. ¿Cuántos requerimientos funcionales tiene la Ley 1581? No hay ninguno, pues según lo que vi en la presentación, no hay ninguno; o sea, ya su proyecto no cumple. Pero eso es muy importante: todo sistema que recoge datos personales tiene que cumplir con la Ley 1581, así que todo el mundo tiene que tenerlo; no voy a decir cuántos requerimientos funcionales tienen que tener. Y ahora, peor aún, ¿cómo saben ustedes que pueden hacer scraping en un sitio? Me refiero en términos legales, es lo primero que tienen que derivar si van a hacer scraping, es lo primero, antes de cualquier cosa tecnológica. Van a meter en un negocio de estos, puede ser scraping. O sea, nunca encontraron por ahí algo que se llama robots.txt dentro de los lugares que van a buscar. Hay que asesorarse: ¿cómo puedo hacer eso? Muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 8,
    "title": "EQUIPO LANNISTER",
    "description": "El proyecto 'Lannister News' es una plataforma tecnológica que aborda la necesidad de personalizar y gestionar eficientemente el consumo de noticias utilizando técnicas avanzadas de Inteligencia Artificial (IA) y una arquitectura de nube robusta.\n\nObjetivos Clave:\n\nRecolección Automatizada: Implementar un módulo de web scraping y web crawling que recolecte noticias en tiempo real de múltiples portales digitales.\n\nClasificación Inteligente: Utilizar el modelo bilingüe mBERT (Procesamiento de Lenguaje Natural - NLP) para clasificar automáticamente el contenido por secciones temáticas.\n\nChatbot Contextual: Desarrollar un chatbot inteligente basado en FAQs y mBERT para responder preguntas y ofrecer información contextual de las noticias.\n\nArquitectura Híbrida de Datos: Construir una arquitectura de base de datos híbrida (SQL y NoSQL) para gestionar datos de usuarios y contenidos dinámicos, ofreciendo un servicio personalizado.\n\nMetodología y Gestión: El proyecto siguió una metodología ágil (evidenciada por un Burndown Chart en la gestión de sprints y un alto porcentaje de cumplimiento en el Product Backlog—cercano al 100% en todas las categorías como Épicas e Historias de Usuario). El flujo de trabajo incluyó la definición del problema, el análisis de requerimientos, el diseño, el desarrollo, las pruebas unitarias y el despliegue.\n\nArquitectura Técnica y Despliegue (AWS): El despliegue del sistema sigue una arquitectura escalable y distribuida en AWS (Amazon Web Services), utilizando:\n\nFrontend: Una SPA Ligera (Single Page Application) alojada en AWS Amplify Hosting o Cloudflare Hosting, con despliegue de CI/CD automática con Git y certificados SSL gestionados por CloudFront. El desarrollo del frontend se realizó con HTML, CSS y JS sin uso de frameworks.\n\nBackend: La lógica de la aplicación se ejecuta en un servidor virtual (EC2) utilizando el framework Django (Python).\n\nBase de Datos y Cache: Se utiliza una arquitectura de datos híbrida:\n\nRDS (MySQL): Para datos estructurados (usuarios, metadatos).\n\nRedis Cache: Para acelerar las respuestas y gestionar sesiones.\n\nDiagrama de Despliegue: Muestra el flujo completo desde el cliente (navegador/dispositivo móvil) pasando por el balanceador de carga, el backend, hasta las bases de datos y el motor de IA/NLP.\n\nComponentes Clave y Tecnologías:\n\nScraping y Recolección: Se implementó un proceso de scraping diseñado para extraer datos clave (título, URL, fuente, fecha) de contenedores HTML de Google News, con mecanismos de tolerancia a fallos y manejo de proxies para el crawling.\n\nClasificación (mBERT): El proceso incluye la recolección de datos, Tokenización, Pre-Entrenamiento y Fine-Tuning del modelo mBERT para la clasificación de noticias.\n\nAnálisis de Sentimiento: Se menciona la referencia a la herramienta VADER y los conceptos de Polaridad e Intensidad para el análisis emocional del texto.\n\nMódulos del Backend: El backend se divide en módulos como el Web Scraper, el NLP Engine, el Authenticator/User Manager y el Chatbot Handler, interactuando con los distintos servicios y bases de datos.\n\nInterfaz de Usuario: El diseño de la aplicación web 'Lannister News' muestra una interfaz organizada con la posibilidad de filtrar noticias por:\n\nCategorías: (Todos, Judiciales, Deportes, Moda).\n\nSentimientos: (Todos, Positivo, Neutral, Negativo).\n\nPresupuesto: El costo total del proyecto fue de $1'868.300 COP (incluyendo IVA del 19% sobre un subtotal de $1'570.000 COP).",
    "members": [
      "Samuel Arango Diaz",
      "Juan Manuel Guerrero Rueda",
      "Wilson Andrés Moreno Velandia",
      "Néstor Stiven Pabón Flórez",
      "Sergio Alejandro Sanabria Moreno"
    ],
    "date": "2025-10-28",
    "teacher": "DANITH PATRICIA SOLORZANO ESCOBAR",
    "course": "PROYECTO INTEGRADOR II",
    "project": "EQUIPO LANNISTER",
    "images": ["/lannister/1.jpg","/lannister/2.jpg","/lannister/3.jpg","/lannister/4.jpg","/lannister/5.jpg","/lannister/6.jpg","/lannister/7.jpg","/lannister/8.jpg","/lannister/9.jpg","/lannister/10.jpg","/lannister/11.jpg","/lannister/12.jpg","/lannister/13.jpg","/lannister/14.jpg","/lannister/15.jpg","/lannister/16.jpg","/lannister/17.jpg","/lannister/18.jpg","/lannister/19.jpg","/lannister/20.jpg","/lannister/21.jpg","/lannister/22.jpg","/lannister/23.jpg","/lannister/24.jpg","/lannister/25.jpg"],
    "comments": [
      {
        "text": "Explíqueme por qué me están diciendo “plataforma web inteligente” centralizada. Defíname “backend unificado”, por favor. Ok, hablemos de IA: ¿qué los llevó a usar mBERT y no, quizás, BERT, RoBERTa o su propio algoritmo de vectorización? Precisión: ¿ese 89% en qué tamaño de conjunto de datos se obtuvo? O sea, ¿cuál es el número total de sus datos para obtener eso? ¿Qué tuvieron en cuenta para poder realizarlo?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "¿Cómo decides qué es una noticia? ¿Cómo sabe tu sistema que eso es una noticia y que tiene que extraerla de ahí? ¿Cómo lo decide y cuál es la semántica de lo que busca? Nosotros, como mencioné antes, buscamos entrar a las páginas que sabíamos que ya publicaban noticias; por ejemplo, si entrábamos a Vanguardia, ¿cuántas publicidades tiene Vanguardia? ¿Qué sucede? Me dijeron que necesitaban usar un delay. ¿Cómo sabes que tienes permiso para hacer scraping? Porque si ya existe un delay, es evidente que no te permiten hacer scraping. Sí, te entiendo, pero a veces alguien va a intentar saltarse el delay y montar toda una arquitectura para engañarlo; eso hoy en día se llama hack, y te estás saltando la ley — ese es el punto. Dime algunos de los dominios que estás usando. ¿Seguro que ESPN te permite hacer scraping? Hay que revisar eso, es un tema súper delicado. Lo pregunto porque ya trabajé en un proyecto así y tuvimos muchos problemas legales con eso. ¿Tienen registros de los tests unitarios? Y si no tienen tests unitarios, ¿cómo llegaron a SonarQube? Ya por el tiempo, muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 9,
    "title": "EQUIPO STARK",
    "description": "El proyecto StarkAdvisor, es una aplicación web de asesoría financiera.\n\nObjetivos y Metodología\nEl objetivo principal es implementar un apartado de 'Trade del día' que, mediante el análisis del mercado financiero, recomiende las mejores oportunidades de operación diarias para orientar la toma de decisiones de los usuarios. El segundo objetivo es desplegar la aplicación en la nube utilizando servicios de AWS para garantizar un acceso estable y continuo.\n\nLa metodología de desarrollo sigue un ciclo iterativo que incluye el análisis de requerimientos y planificación, el diseño y desarrollo del producto, el análisis de resultados, la verificación de funcionalidades y la modularidad de la arquitectura. En cuanto al progreso, el Sprint 1 mostró que el Trabajo Real estaba por debajo del Trabajo Planeado según el burndown chart, con una distribución de tareas del 30% Completadas y 70% Pendientes.\n\nArquitectura y Tecnologías\nLa plataforma utiliza una arquitectura basada en microservicios y despliegue en la nube, con AWS como proveedor principal:\n\nInfraestructura: El Backend se aloja en una instancia usando Elastic Beanstalk (Docker) y se sirve a través de CloudFront, que distribuye archivos estáticos (HTML, CSS, JS) almacenados en S3 Storage al usuario final.\n\nBases de Datos: Se emplean dos tipos de bases de datos:\n\nPostgreSQL RDS: Utilizado para datos relacionales críticos como perfiles de usuario, autenticación, historial de activos y series temporales de activos.\n\nMongoDB Atlas: Utilizado para datos no estructurados o de alto volumen, específicamente la colección de Noticias Scrapeadas y la Información del Trade del día.\n\nBackend: Desarrollado en Django, incluye módulos específicos como Módulo Mercado, Módulo Noticias, Módulo CryptoBot y Módulo Usuarios.\n\nAutenticación: El flujo de login utiliza Redis para gestionar sesiones y tokens, actualizando el last_login y creando una sesión que devuelve un Token + Session ID al Frontend.\n\nAdquisición y Análisis de Datos\nPara obtener la información financiera, el proyecto utiliza Web Scraping.\n\nWeb Scraping: La aplicación extrae el contenido HTML de URLs y aplica Selectores específicos (como clases CSS únicas) para capturar datos estructurados como el Título, URL, Descripción, Fecha y Fuente.\n\nMódulo de Activos: El objetivo de este módulo para Acciones, ETFs y Divisas es visualizar precios y gráficos a lo largo del tiempo, y obtener indicadores y métricas. El modelo de datos incluye tablas clave como diario_precios y diario_entidades para almacenar los precios y las métricas de rendimiento diario.\n\nInteligencia Artificial (IA) y Chatbot\nUna parte fundamental del proyecto es la implementación de modelos de lenguaje para el análisis y la interacción con el usuario:\n\nAnálisis de Sentimiento: Se utiliza el modelo DistilBERT, un clasificador pre-entrenado de la librería Transformers de Hugging Face. El modelo clasifica el sentimiento de noticias en inglés como POSITIVE o NEGATIVE con un nivel de confianza. La elección de DistilBERT se justifica porque 'conserva cerca del 97% de la precisión de BERT, pero utiliza 40% menos recursos y es más rápido en predicción'.\n\nChatbot (IA Conversacional): El sistema utiliza el modelo Multilingual Bert (mBert) para brindar soporte en varios idiomas, como español e inglés.\n\nFuncionamiento: La consulta del usuario pasa por un proceso de Langdetect (detección de idioma) y Normalización. Luego, el modelo Tokeniza y Clasifica la pregunta, buscando la respuesta predefinida en la base de conocimiento (donde un tipo de pregunta tiene múltiples formas de ser escrita en ambos idiomas). El flujo incluye un mecanismo de Fail Over (respuesta de respaldo) y registro de la interacción (Logging).\n\nInterfaz de Usuario\nLa interfaz de la aplicación StarkAdvisor presenta un menú lateral con acceso a Dashboard, Perfil, Mercado Financiero, Trade del día y Chat bot. La vista de Mercado Financiero muestra una tabla detallada de activos (ej. AAPL, ABBV) con información clave como Ticker, Precio, Cambio Diario (%), Volumen y el tipo de activo. El diseño general es moderno y busca invitar al usuario a 'transformar su estrategia financiera'.",
    "members": [
      "Juan Sebastián Granados Jaimes",
      "Juan Carlos Niño Osorio",
      "Leyder Steven Ortiz Jaimes",
      "Jorge Luis Osorio Silva",
      "Carlos Alberto Quintero Arias"
    ],
    "date": "2025-10-28",
    "teacher": "DANITH PATRICIA SOLORZANO ESCOBAR",
    "course": "PROYECTO INTEGRADOR II",
    "project": "EQUIPO STARK",
    "images": ["/stark/1.jpg","/stark/2.jpg","/stark/3.jpg","/stark/4.jpg","/stark/5.jpg","/stark/6.jpg","/stark/7.jpg","/stark/8.jpg","/stark/9.jpg","/stark/10.jpg","/stark/11.jpg","/stark/12.jpg","/stark/13.jpg","/stark/14.jpg","/stark/15.jpg","/stark/16.jpg","/stark/17.jpg","/stark/18.jpg","/stark/19.jpg","/stark/20.jpg"],
    "comments": [
      {
        "text": "Bueno, esto es más que todo para decirles una gran felicitación; veo un trabajo muy bien desarrollado y argumentado. Y una única pregunta: ¿por qué español-inglés? Eso fue avalado por su cliente, ¿cierto? Y, de todos modos, pregunto: si toman páginas extranjeras, ¿ustedes revisaron la legislación correspondiente con respecto a temas de web scraping?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Buenas tardes, ¿cómo están? El grupo anterior y su grupo, el grupo actual, las dos marcas conceptuales se complementan y ya entendemos cómo funciona todo. O sea, muy bien la explicación del marco conceptual, sobre todo porque lo bajó a algo que se puede entender, pero no lo llevó a cosas demasiado simples. Entonces, estuvo muy chévere, muy bien explicado, gracias. ¿Ustedes hicieron Scrum? ¿Se intentó o no? ¿O arrancaron y cambiaron? Es que, escuchando tu discurso, no me queda claro que hayan hecho Scrum, porque, por ejemplo, dices “asignación de tareas”, y eso no existe en Scrum. Sí, sí, es que no se evidencia muy bien, pero bueno. La pregunta es: ¿por qué tanto énfasis en SonarQube? ¿Quién es el QA? ¿Y dónde aparece el QA en un grupo de cuatro? O sea, que usted no desarrollaba. Ya, ya, ya, mucha gerencia; eso, mucho que… es muy rígido, no me queda así. Claro, pero por el tiempo no le vamos a ahondar en eso. Alguien dijo que tres personas no completaron su trabajo y se absorbieron las tareas. ¿Puede ampliar eso, por favor? ¿Pero cómo repartirlas otra vez? ¿No hicieron Scrum? Vamos a hacer algo para salir de la duda. Primera pregunta: ¿cuáles son los pilares de Scrum? O sea, porque recalcan tanto lo de autenticación, lo recalcan mucho también en el pasado. ¿Por qué? Ya, ya. Sí, pero no entiendo por qué el tema es tan relevante. El compañero que estaba en las conclusiones, ¿puedes dar una conclusión de la gerencia del proyecto sin leer? Bueno, esto lo venimos a sentir en el sentido de la campaña. Bueno, muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 10,
    "title": "EQUIPO TARGERYEN",
    "description": "Proyecto LearnIA:\n\nContexto y Objetivo Principal:\n\nSituación Problema: En la era digital, la información educativa está dispersa en múltiples plataformas (sobrecarga de información), lo que dificulta a los estudiantes crear rutas de aprendizaje coherentes, perdiendo tiempo y recursos.\n\nObjetivo General: Desarrollar y desplegar una plataforma web inteligente, LearnIA, basada en inteligencia artificial, que genere rutas de aprendizaje personalizadas mediante la extracción, procesamiento y análisis automatizado de recursos educativos de múltiples fuentes digitales.\n\nObjetivos Específicos:\n\nImplementar un sistema de web scraping automatizado para extraer metadatos de al menos 10,000 recursos educativos y consolidarlos.\n\nDesarrollar un Pipeline de IA para el procesamiento del contenido (clasificador NLT y embeddings semánticos) para personalizar la experiencia.\n\nDesplegar la arquitectura cloud native en AWS y MongoDB para garantizar escalabilidad y disponibilidad.\n\nDesarrollar una interfaz web responsive para visualizar rutas de aprendizaje y hacer tracking de progreso.\n\nValidar y optimizar el sistema con pruebas de carga y sistemas de monitoreo para asegurar la calidad y sostenibilidad.\n\nMetodología y Arquitectura:\n\nMetodología: Se utilizó una metodología basada en el Prototipado, que se enfoca en crear versiones iniciales del sistema para validar funcionalidades clave, optimizar la experiencia de usuario y detectar errores tempranamente.\n\nPatrón de Diseño (Backend): Se implementó el Patrón Hexagonal para separar la lógica de negocio de los elementos externos, logrando un sistema limpio, modular y mantenible.\n\nArquitectura Cloud (DevOps): Infraestructura Cloud Native desplegada en AWS Cloud (usando servicios como AWS Lambda, API Gateway y S3) y Atlas Cloud (MongoDB) para la base de datos.\n\nFlujo del Proceso: La aplicación recibe solicitudes del usuario, que pasan por el API Gateway y Lambdas. La lógica de negocio interactúa con el repositorio de datos, el módulo de Web Scraper y el Modelo de IA/ML para procesar la información y generar la ruta de aprendizaje o el contenido solicitado.\n\nInterfaz de Usuario y Resultados:\n\nInterfaz: La aplicación web muestra una interfaz de usuario limpia y responsive (se mostró la pantalla de registro que solicita datos personales, como nombre, documento, correo y contraseña).\n\nMétricas de Desarrollo: Se presentó un Diagrama de Flujo Acumulado y un Informe de Velocidad para medir el progreso y el rendimiento del equipo durante los Sprints.\n\nConclusiones:\n\nEfectividad: El desarrollo de la aplicación web LearnIA demostró ser efectivo al ofrecer resultados precisos y detallados sobre cualquier tipo de curso, gracias a la integración de web scraping y componentes de inteligencia artificial.\n\nValor: La plataforma organiza información confiable de manera estructurada y accesible al usuario.\n\nPotencial Futuro: LearnIA es una herramienta escalable, con planes de futuro para optimizar el rendimiento del scraping, mejorar la personalización mediante el análisis del comportamiento del usuario y añadir nuevas funcionalidades para ajustar los resultados a las necesidades individuales.",
    "members": [
      "Juan Andres Contreras Hernandez",
      "Karol Nicol Dayanna Lizarazo Ortiz",
      "Raul Ferney Lozano Navarro",
      "Maria Angelica Parra Grazt",
      "Jerson Arley Porras Lozano"
    ],
    "date": "2025-10-28",
    "teacher": "DANITH PATRICIA SOLORZANO ESCOBAR",
    "course": "PROYECTO INTEGRADOR II",
    "project": "EQUIPO TARGERYEN",
    "images": ["/targeryen/1.jpg","/targeryen/2.jpg","/targeryen/3.jpg","/targeryen/4.jpg","/targeryen/5.jpg","/targeryen/6.jpg","/targeryen/7.jpg","/targeryen/8.jpg","/targeryen/9.jpg","/targeryen/10.jpg","/targeryen/11.jpg","/targeryen/12.jpg","/targeryen/13.jpg","/targeryen/14.jpg","/targeryen/15.jpg","/targeryen/16.jpg","/targeryen/17.jpg"],
    "comments": [
      {
        "text": "¿Hablaron de una historia con 11 puntos y solo hicieron una historia? Sí, es algo así como una historia con un sepulcro, como si se hubiera hecho una historia. Sí, nos quedó una historia. ¿Cuántos puntos? ¿Todos, total? ¿Pero ustedes se acuerdan? ¿No se acuerdan? ¿Cuál era la velocidad de elegir? Si yo te doy 100 puntos para hacer en un sprint, ¿cuántos hacen? Si se comprometen 100 puntos en un sprint, ¿cuántos hacen? Vale, ya que estás ahí, dices que React es moderno, modular, fácil de mantener. ¿Qué es fácil de mantener? Cuando hablaron de React, dijeron React en la modernidad, fácil de mantener. Experiencia fluida. ¿Qué es fácil de mantener y qué es experiencia fluida? Vale, mira, tú no puedes hacer juicios si no tienes un soporte, ¿vale? Así que tú me dices: no, es que es fácil de mantener porque en la métrica tal, en el estudio tal, con diferentes tipos de bibliotecas para creación de proyectos, esto es fácil de mantener. Ah, bueno. Listo, ¿sí? Es que no lo digo solo por ustedes, porque otro grupo anterior pasó por lo mismo. Entonces cogen lo que dice ahí en la página: esto es lo mejor. Sí, la publicidad: fácil de hacer, fácil. No puedes decidir con eso si vas a usar la tecnología, ¿vale? O sea, eso en otro contexto; pero aquí, en ingeniería de sistemas o informática, no puedes decidir esa tecnología porque la publicidad te dice que es chévere. ¿Vale? Otra cosa, en la misma línea: dicen que se comprobó que los colores eran mejores para el aprendizaje. ¿De dónde sacaron eso? ¿Hay referencia? Ya, no te creo. Bueno, te lo dejo para la documentación. O sea, si no está la referencia, no hay nada. Y es lo que pasa: hay unos modelos, más gráficas, que no tienen referencias en varias diapositivas. Bueno, compañero Raúl, hablemos. Hablemos de qué hace cada lambda. ¿Cuánto cuesta el uso de la plataforma mensual para una carga mínima? ¿Cuál es la carga mínima? O sea, no te invita a quedarte, pero ya tienes que contestar. Bueno, eso nomás, no creen. Si tuvieran las cuentas, podríamos discutir, pero no te creen. La otra es: ¿cómo solucionas el problema del arranque de la lambda? ¿Cuál? El arranque, cuando las lambdas están en desuso, se apagan. Vale, o sea, el primer llamado es lento. Eso es muy bueno para los usuarios. Si tuvieras otro servidor de aplicaciones adelante para contestar esas cosas y las lanzas atrás, te funcionaría mejor. No, no le faltó, solo estamos discutiendo. Es que miren, cuando hay algo bueno, cuando hay algo remontado, pues podemos discutir en términos de ingeniería. Qué chévere, muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "Yo les voy a preguntar acerca del marco legal del scraping: si ustedes no consultaron que para el uso del dominio, si alguien tiene un dominio similar que pueda haber sido asociado al mismo tema y si no presentan problemas por el uso de ese nombre de dominio. Sino que, consultando a ver si me cargaba la URL de ustedes que alcanzaba a ver el video, me apareció otra página que va por la misma línea, usa la misma gama de colores. Sí. Es más, no es la misma. Y es de una empresa multinacional latinoamericana de formación. Entonces, es conveniente cuando nosotros vamos a bautizar nuestras aplicaciones. ¿Cómo es que se llama? Cognos Online. Es el apoderado de ese dominio. Learn.ai.io, factores que pueden, como decía ahorita, hace un momento, los otros grupos de profesores vienen a generarnos algún tipo de problemas. Entonces, para que no, más que pues como preguntas o martirizar a sus ideas, que tengamos muy en cuenta esos factores. Que en algún momento puede que, simplemente, en este momento somos un ejercicio académico, estuve cachateando la página de ustedes, chévere, y todo... Pero entonces sí, de pronto puede generar alguna molestia por allí, que empiece a llegar por ahí algún correo solicitando información o solicitando que bajen el dominio, porque es de la misma temática. Entonces ellos ya son un músculo grandote, ustedes apenas hicieron esta prueba para el proyecto integrador, pero entonces sí, cuando vayan a hacer sus proyectos personales, corporativos o similares, tienen que tener muy en cuenta eso, porque... Para ustedes, digamos, ya presentamos el proyecto integrado, pues lo bajamos. No tenemos miedo. Pero si es un proyecto que ustedes están vendiendo a un cliente, o un proyecto de ustedes, puede significarles algún problema fuerte. ¿Listo? Bueno, muchas gracias.",
        "teacher": "ING JAVIER LIZARAZO",
        "image": "javier.jpg"
      }
    ]
  },
  {
    "id": 11,
    "title": "EQUIPO TYRELL",
    "description": "El grupo llamado Tyrrel presentó el desarrollo de una plataforma web y un chatbot impulsado por Inteligencia Artificial para centralizar ofertas de productos tecnológicos.\n\nEl Problema y la Solución (Objetivos)\nPregunta Problema: ¿Cómo crear un chatbot con IA que busque y centralice ofertas de productos tecnológicos en tiempo real, asegurando que sea seguro, escalable y fácil de usar?\n\nObjetivo General: Crear una plataforma web donde los usuarios interactúen con un chatbot IA para obtener ofertas personalizadas, utilizando web scraping autónomo bajo una arquitectura escalable, segura y observable.\n\nTecnologías Clave:\nRecolección de datos: Módulos de Crawling y Scraping con Scrapy/Beautiful Soup.\nInteligencia Artificial: Entrenar un modelo BERT para la comprensión semántica y la búsqueda de productos similares.\nStack: Frontend (React/NextJS), Backend (Django Python), Bases de Datos (MongoDB Atlas para productos y embeddings, PostgreSQL para usuarios), Despliegue (Azure Cloud).\n\nGestión y Metodología de Trabajo\nEl proyecto se gestionó rigurosamente utilizando la metodología Scrum, evidenciado por:\nSprints: Se realizaron múltiples iteraciones de desarrollo, con seguimiento detallado del progreso a través de gráficas de Burndown Chart (trabajo restante) y Reportes de Trabajo Completado.\n\nDesarrollo y Calidad\nPruebas: Se confirmó la realización de 73 pruebas automatizadas en Karma y Jasmine, asegurando la calidad del código y la funcionalidad.\nAutomatización (DevOps): Se implementaron pipelines CI/CD con GitHub Actions para automatizar la compilación, pruebas y despliegue del Frontend (React) y del Backend (Django) en Azure App Service.\n\nAspectos Económicos\nCostos del Producto: El equipo presentó una estimación del costo mensual de los servicios en la nube necesarios para mantener la aplicación en producción, totalizando aproximadamente $200 USD.\nApp service de azure (frontend): $53 USD\nApp service de azure (backend 1): $100 USD\nApp service de azure (backend 2): $47 USD\n\nConclusiones Finales\nLas conclusiones resaltan el logro de los objetivos del proyecto:\nIntegración Tecnológica: Se logró la integración de tecnologías robustas en la nube (Azure, frontend en React/NextJS, backend en Django, MongoDB/PostgreSQL) creando una arquitectura escalable y segura.\nMetodología Ágil: La aplicación de Scrum permitió un desarrollo controlado y una entrega continua de valor.\nAutomatización del Ciclo de Vida: La automatización con GitHub Actions garantizó pruebas, deployment y resolución de errores automáticos, mejorando la calidad del producto.\nIA Exitosa: El uso del algoritmo de BERT con el modelo de IA permitió completar un chatbot que da respuestas coherentes y realiza el web scraping de productos que están en la base de datos.\nSeguridad y Pruebas: Se realizaron pruebas automatizadas (73 tests) y se aplicaron políticas de seguridad y backup para mejorar la protección y disponibilidad del sistema.\nCrecimiento del Equipo: El proyecto mejoró las habilidades técnicas del equipo en despliegue en la nube, automatización y análisis de registros.",
    "members": [
      "Daniel Felipe Aguilar Latorre",
      "Cristian Andrés Gómez Jaimes",
      "Cristian Camilo Plata Rodríguez",
      "Rober Julián Quintero Oviedo",
      "Juan Pablo Silva Vásquez"
    ],
    "date": "2025-10-28",
    "teacher": "DANITH PATRICIA SOLORZANO ESCOBAR",
    "course": "PROYECTO INTEGRADOR II",
    "project": "EQUIPO TYRELL",
    "images": ["/tyrell/1.jpg","/tyrell/2.jpg","/tyrell/3.jpg","/tyrell/4.jpg","/tyrell/5.jpg","/tyrell/6.jpg","/tyrell/7.jpg","/tyrell/8.jpg","/tyrell/9.jpg","/tyrell/10.jpg","/tyrell/11.jpg","/tyrell/12.jpg","/tyrell/13.jpg","/tyrell/14.jpg","/tyrell/15.jpg","/tyrell/16.jpg","/tyrell/17.jpg","/tyrell/18.jpg","/tyrell/19.jpg","/tyrell/20.jpg","/tyrell/21.jpg","/tyrell/22.jpg","/tyrell/23.jpg"],
    "comments": [
      {
        "text": "¿Solo trae productos de Ktronix? Arranca en la exposición diciendo: “y esta es la exposición que vamos a hacer, y los integrantes son los que dice el profe”. Ahora, ¿se sabe lo que usted iba a preguntar? O sea, estás haciendo una presentación, tienes que manejar la formalidad del asunto, ¿sí? No estás en una piñata ni en otra cosa. Estás en una presentación académica, formal, ante toda la facultad. Ustedes tienen que mejorar esa parte del lenguaje. La presentación en general es muy informal. Las diapositivas parecen hechas hace poco, no tienen referencia ni nombre. Hay personas que no saben lo que están diciendo en la presentación, están totalmente desubicados. ¿Qué más tengo por aquí para contarles? El diagrama de arquitectura no es muy bueno, ¿no? Y yo me perdí un poquito. Díganme una conclusión de su trabajo con respecto a la tenencia del proyecto y una conclusión del trabajo con respecto a la técnica del desarrollo. ¿Sabían de las tareas necesarias? Los objetivos que están planteados no son objetivos; entonces no sé cómo lo completaste. Tienes una lista de actividades, no son objetivos, ¿vale? Eso de si cumplimos o no cumplimos, pues si no hay objetivo, no hay nada, porque ese es el contrato. Y la siguiente conclusión. Ahí escuché un montón de respuestas de “paz mundial”. Muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 12,
    "title": "EQUIPO 1",
    "description": "El equipo 1 presentó un Sistema de Gestión de Trenes de Transporte de Pasajeros. El proyecto aborda desde el diseño conceptual hasta la validación operativa, mostrando su sistematización de la administración ferroviaria.\n\nEl equipo detalló el Marco Conceptual que guió el desarrollo del software. Este incluyó el análisis de requerimientos para definir funcionalidades clave como la venta y validación de boletos, el control de equipaje y la gestión de trenes, rutas y horarios. Posteriormente, se diseñó la arquitectura utilizando diagramas UML para estructurar las clases y definir algoritmos eficientes.\n\nEl sistema fue desarrollado utilizando el lenguaje Java y archivos JSON para el almacenamiento de datos. La fase de pruebas y validación fue crucial, aplicando casos que aseguraron la trazabilidad de las acciones de los usuarios y la correcta operación de los procesos de compra y administración.\n\nLas Conclusiones del grupo resaltaron el impacto positivo del proyecto. El sistema logró transformar procedimientos manuales en operaciones automatizadas, superando problemas de agilidad e inseguridad previos. Un factor clave de éxito fue la implementación de estructuras de datos avanzadas como listas enlazadas, colas, grafos y el algoritmo de Dijkstra, que garantizaron una alta eficiencia en la gestión de información y el cálculo de rutas óptimas.\n\nFinalmente, la división del software en módulos (boletos, rutas, trenes, equipaje, etc.) no solo facilitó la comprensión y el desarrollo, sino que también aseguró la escalabilidad del sistema para futuras versiones. A pesar de enfrentar un inicio tardío y una reducción del equipo, los estudiantes lograron entregar un producto totalmente coherente con los requerimientos técnicos iniciales.",
    "members": [
      "ANGEL LEONARDO LAGOS SALAMANCA",
      "XANDER SEBASTIAN PINEDA LARROTA",
      "JULIAN MATEO SIERRA VARGAS",
      "SANTIAGO PRADA PINILLA"
    ],
    "date": "2025-10-29",
    "teacher": "FRANCISCO JESÚS MOLINA BOVEA",
    "course": "ESTRUCTURAS DE DATOS",
    "project": "EQUIPO 1",
    "images": ["/equipo1/1.jpg","/equipo1/2.jpg"],
    "comments": [
      {
        "text": "De hecho, quedamos en la pregunta problema y ahí se desbocaron a hablar, hablar, hablar, hablar, a leer, ni siquiera a explicar, solo a leer y leer. Y la propositiva estaba en que no tiene el marco conceptual. En la diapositiva que tiene el marco conceptual, por favor, colóquenla. Están los objetivos. Por eso les digo que eso está muy improvisado. Ahí está. O sea, colocar un objetivo en el marco conceptual. Y, de hecho, estas son las consecuencias, estas son las formas que nosotros no queremos que interesen. Se paran ahí al frente a decir cosas que no son. Ténganlo presente para su formación profesional. Muchísimas gracias.",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      },
      {
        "text": "Bueno, ya les han dicho lo que yo tenía en mente. Yo soy firme creyente de que a veces uno no tiene nada, pero la actitud hace que las cosas mejoren. Entonces, para la próxima, hablan conmigo el día anterior. Profe Danith, creo que ustedes ya me distinguen. Yo les doy dos calvazos y les pongo el fua. Porque si uno tiene la actitud, hace lo que hacen los paisas, pelados culebreros, no enredan. Y la ropa sucia se lava en casa. Lamento haber estado ocupada en clase y no haber hecho lo que hicimos el semestre pasado, de haber acompañado al profesor Francisco. ¿Qué tengo yo por decir? Que me preocupa que haya un solo curso de estructura de datos aquí, dando la cara. Y eso es donde lo siento yo, y mis estudiantes lo saben, cuando llegamos a sistemas operativos: no saben qué es una pila, no saben qué es una cola. Me preocupa, al menos vi que dieron uno que otro concepto, pero me preocupa que ni siquiera esté el otro curso de estructura de datos aquí, observando su presentación. Entonces, resalto que se pararon ahí, dieron la cara, pero para la próxima se da la cara con actitud, a los paisas, atravesados, siempre parados. Yo creo que una de las características que yo les inculco a los estudiantes de la universidad en la que estoy trabajando —y cuando me vaya a sembrar la charla con mis papás y con los niños— es actitud: de lado, de frente y sin nervios. Como le digo yo al hijo mío: su mamá no parió un pendejo. Entonces, usted sabe, parados. Así tenga el Figma, a mí, nosotros estamos bien ya en esto. Ya vemos el Figma, te digo la versión. Nada, los demás no saben. Parados. Ya lavaron la ropa sucia en casa con el propio Francisco. Para la siguiente, parados, con lo poco o con lo mucho. Muchas gracias.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      }
    ]
  },
  {
    "id": 13,
    "title": "EQUIPO 2",
    "description": "Proyecto: Gestión de Trenes de Pasajeros\n\nIntroducción y Justificación\n\nEl proyecto se enfoca en resolver la Situación Problema de una empresa ferroviaria que gestiona rutas, horarios, boletos y equipaje de forma manual, lo cual es ineficiente. El objetivo es sistematizar estos procesos en una plataforma digital centralizada. La Justificación es aportar a la automatización del sistema ferroviario mediante el diseño de un sistema informático que integre estructuras de datos para fortalecer la eficiencia, el control y la experiencia del usuario.\n\nObjetivos\n\nObjetivo General: Sistematizar una solución digital para administrar los procesos de transporte ferroviario de pasajeros, incluyendo la gestión de boletos, control de equipaje, rutas, horarios y labores administrativas.\n\nObjetivos Específicos:\n\nEstablecer los requerimientos funcionales y no funcionales del sistema.\nDiseñar la arquitectura del sistema y las estructuras de datos utilizando diagramas UML.\nDesarrollar los módulos del sistema en Java de manera estructurada y escalable.\n\nMetodología y Marco Conceptual\n\nMetodología: Se utilizó un modelo de Cascada con etapas secuenciales: Análisis, Diseño, Implementación (Codificación en Java y manejo de archivos JSON), Pruebas, y Entrega.\n\nMarco Conceptual (Tecnologías y Enfoque):\n\nDesarrollo: Aplicación web con backend en Java y frontend en HTML/CSS/JS.\nRutas: Se modelan con grafos no dirigidos y ponderados (estaciones y trayectos).\nAlgoritmo: Se implementa el algoritmo de Dijkstra para obtener la ruta más corta.\nEstructuras de Datos: Se emplean listas, colas y árboles para representar entidades, manejar turnos y realizar búsquedas ordenadas.\nAcceso Rápido: Se usa HashMap para accesos rápidos (autenticación y boletos por ID).\nPersistencia: Manejo de datos en archivos JSON (usando la librería Gson) por simplicidad y portabilidad.\nSeguridad: Aplicación de validaciones de datos y hash de contraseñas para seguridad básica.\n\nDiseño del Sistema\n\nDiagrama de Clase (UML): Se diseñaron clases principales como Ruta (con atributos como distancia, estaciones de origen/destino) y Vagón (con atributos como tipo, lista de asientos y disponibilidad).\n\nDiagrama de Arquitectura (Arquitectura en Capas):\n\nCapa 1: Presentación (UI). Páginas hechas en HTML y CSS para la interacción del usuario.\nCapa 2: Servidor HTTP (Controladores). Recibe solicitudes, verifica el acceso y conecta la interfaz con la lógica del sistema.\nCapa 3: Lógica de Negocio (Gestores). Contiene las funciones principales y aplica las reglas del negocio.\nCapa 4: Modelo de Dominio (Entidades). Define las clases que representan los objetos reales del sistema (trenes, boletos, usuarios, rutas, etc.).\nCapa 5: Estructuras de Datos (Utilidades). Contiene el Grafo para rutas, Tablas Hash, Árboles, Colas y Pilas. Utiliza el algoritmo de Dijkstra.\nCapa 6: Persistencia (Archivos JSON). Almacena la información de manera permanente en archivos JSON (usuarios.json, trenes.json, etc.) usando Gson.\n\nConclusiones\n\nEl proyecto permitió poner en práctica conocimientos de programación orientada a objetos y estructuras de datos, mejorando el entendimiento sobre cómo optimizar el desempeño de una aplicación y gestionar el trabajo en equipo de manera eficiente.",
    "members": [
      "ALEXANDER GOMEZ GRAJALES",
      "ALBERT DAVID LOPEZ PINZON",
      "JHAIDER DAVID ZAMBRANO PARRA"
    ],
    "date": "2025-10-29",
    "teacher": "FRANCISCO JESÚS MOLINA BOVEA",
    "course": "ESTRUCTURAS DE DATOS",
    "project": "EQUIPO 2",
    "images": ["/equipo2/1.jpg", "/equipo2/2.jpg", "/equipo2/3.jpg", "/equipo2/4.jpg", "/equipo2/5.jpg", "/equipo2/6.jpg", "/equipo2/7.jpg", "/equipo2/8.jpg", "/equipo2/9.jpg", "/equipo2/10.jpg", "/equipo2/11.jpg", "/equipo2/12.jpg", "/equipo2/13.jpg", "/equipo2/14.jpg", "/equipo2/15.jpg", "/equipo2/16.jpg", "/equipo2/17.jpg", "/equipo2/18.jpg", "/equipo2/19.jpg", "/equipo2/20.jpg", "/equipo2/21.jpg", "/equipo2/22.jpg", "/equipo2/23.jpg", "/equipo2/24.jpg"],
    "comments": [
      {
        "text": "Rafael, Camilo, Jorge Andrés, Juan José, que estén listos para hacer el reloj. Dos cositas de mi parte: la primera, si ustedes tienen cita en la embajada de Estados Unidos en Bogotá para sacar la visa, me imagino que no se van en el primer vuelo del día o tres horas antes de la cita, porque como son cosas muy importantes, uno las prevé; mínimo se va el día anterior, la noche anterior. Pues así pasa con estos eventos. No estamos exentos de que nos sucedan cosas, pero hay cosas que se pueden prever con tiempo. Sabemos que tenemos una cita importante, que ustedes son de los que arrancan, y es importante medir eso para que, a pesar de que se presenten inconvenientes, logren llegar a tiempo. Esa es la primera recomendación. La segunda la acaba de hacer la profe Danith: aquí vendan lo mejor que puedan. Entonces, no entren con esa actitud de que uno está fallando, de que estamos incompletos o de que tenemos problemas; eso lo vamos descubriendo nosotros a medida que ustedes lo van presentando. Pero si desde entrada ponen esa situación, todos somos vendedores: no venden el producto porque uno ya sabe que tiene problemas. Entonces, esa es la otra recomendación. Por el video se puede apreciar que hicieron un buen trabajo.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "Digamos que, a nivel de la presentación, tuvieron mejor dominio del tema que los grupos anteriores, pero considero importante que cuando uno se para allá no es para dar justificaciones, sino para resaltar la importancia de lo que hicimos. Como dice Sandra, lo de mayor seguridad. Y una observación general para todo el auditorio: cuando uno hace las conclusiones de un trabajo, no son las conclusiones de la materia o de cursar la materia. Es decir, si yo hago una investigación dentro del proceso de una materia, eso es una cosa; el objetivo de la materia es enseñarle a uno a realizar el proceso. Pero cuando se hace una investigación sobre un tema, uno concluye sobre el tema, no diciendo que el trabajo fue importante porque me enseñó o porque pudimos practicar. No, esa no es una conclusión de una investigación. O sea, imagínense uno en una ponencia internacional diciendo: “Este trabajo me ayudó con mis puntos de producción intelectual”. No, las conclusiones deben ser sobre el tema. Entonces, para cuando hagan esas conclusiones, háganlas siempre sobre lo que desarrollaron, y no sobre el proceso de llegar a desarrollarlo. No sé si me hago entender en ese sentido.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Buenos días. ¿Cuál es la estructura de datos que soporta su proyecto? Paz mundial. ¿Cuál es la estructura de datos que soporta su proyecto? ¿Qué tipo de grafo es? ¿Es un grafo dirigido no ponderado? ¿Y por qué no dirigido? ¿Por qué aparece un árbol AVL? Vale, ¿qué es un ASMA? Tú hiciste el trabajo, no te entiendo. Claro, por favor. ¿Por qué tienen cuatro capas en el producto? ¿Seis capas? Seis capas. La arquitectura es de seis capas. ¿Por qué tienen seis capas? Déjalo a él. ¿Por qué es tan compleja? Tienen un lado que usa Java y terminan haciendo una aplicación web. Eso no es cierto, una aplicación web muy compleja. Entonces, ustedes no tienen el nivel para hacer una aplicación web. ¿Por qué nos cuentan historias? Por eso me impresiona mucho cuando dices que no salió breve, ese no era el primer comentario cuando empezaron la exposición. Entonces, me gustaría haber visto un proyecto estructurado. Bien, gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "Bueno, chicos, buenos días. Ustedes no pueden comenzar la exposición y decir que van a omitir algo por falta de tiempo; eso no se debe hacer. Se nota que quien hizo el trabajo fue Alexander, mientras que los demás compañeros están perdidos. Para una próxima oportunidad, trabajen un poco más y no dejen la responsabilidad a uno solo. Muchas gracias.",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      },
      {
        "text": "Una última cosa: cuando uno se para y dice que no tiene tiempo, es porque se nota que no ha practicado. Lo primero que debe hacer es ensayar en su casa, en la universidad, en la biblioteca o en la cafetería, poner un cronómetro y decir: “me dieron 15 minutos, significa que debo hacer esto un poco más rápido”, pero asegurándose de que todo esté cubierto. Imagínense, por ejemplo, una investigación presentada en una ponencia internacional, un trabajo de dos años, y le dan a uno solo 15 minutos. ¿Cómo hace? Tiene que impactar. No se trata de decir “es que no me dio tiempo” o “toda esta parte no la muestro porque no tengo tiempo”. Este es un ejercicio que no deben tomar a la ligera, sino como un entrenamiento para el futuro: cuando sean profesionales, cuando tengan que defender una idea en una empresa o presentarse a una licitación. Muchos egresados han dicho: “yo ya me entrené para esto”. Así que tómenselo en serio. Muchas gracias.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      }
    ]
  },
  {
    "id": 14,
    "title": "EQUIPO 3",
    "description": "No se presentaron.",
    "members": [
      "RAFAEL CAMILO MARQUEZ ALMENAREZ",
      "JORGE ANDRES CARDONA NIÑO",
      "JUAN JOSE ALBA PALMA"
    ],
    "date": "2025-10-29",
    "teacher": "FRANCISCO JESÚS MOLINA BOVEA",
    "course": "ESTRUCTURAS DE DATOS",
    "project": "EQUIPO 3",
    "images": ["/equipo3/1.jpg"],
    "comments": []
  },
  {
    "id": 15,
    "title": "EQUIPO 4",
    "description": "El proyecto desarrollado por estudiantes de la Universidad Pontificia Bolivariana (UPB) es un Sistema de Gestión de Trenes (SGT) cuyo objetivo principal fue sistematizar los procesos manuales de una empresa de transporte ferroviario de pasajeros, utilizando la programación en Java y estructuras de datos avanzadas.\n\nProblema Central: La gestión actual de venta de boletos, control de abordaje, administración de rutas, horarios y equipaje se realiza de forma manual, generando ineficiencia y errores.\n\nObjetivo: Desarrollar un prototipo de software para automatizar estos procesos, centrándose en la implementación de estructuras de datos.\n\nMetodología: Se utilizó la metodología ágil Kanban para la gestión del proyecto, dividiendo las tareas en estados como 'Pendiente', 'En progreso', 'En revisión' y 'Terminado'.\n\nArquitectura y Diseño:\n\nEl sistema sigue una arquitectura por capas (Vista, Controladores, Modelo/Lógica, Persistencia).\n\nSe documentó el diseño con diagramas UML, incluyendo:\n\nCasos de Uso para Pasajeros (comprar boletos), Empleados (gestión de equipaje) y Administradores (gestión de rutas y trenes).\n\nDiagramas de Secuencia para detallar la interacción de las clases en la búsqueda de viajes.\n\nImplementación Técnica (Marco Conceptual): La lógica del sistema se fundamenta en estructuras de datos para tareas críticas:\n\nGrafos: Se modeló la red de estaciones y rutas como un grafo, donde las estaciones son vértices y las distancias son los pesos de las aristas.\n\nAlgoritmo de Dijkstra: Se implementó para calcular la ruta óptima y más corta entre cualquier par de estaciones, permitiendo rutas con escalas.\n\nCola de Prioridad: Se usó para gestionar el orden de abordaje de pasajeros según la categoría del boleto.\n\nListas Enlazadas y Enums: Utilizadas para manejar eficientemente la reconstrucción de rutas y asegurar la integridad de datos constantes (como nombres de estaciones).\n\nResultados y Testeo:\n\nSe desarrolló un prototipo funcional en Java con una interfaz básica para la búsqueda y compra de boletos.\n\nSe realizó un testeo del cálculo de rutas para validar la precisión del algoritmo de Dijkstra, demostrando el cálculo de la ruta, la distancia (ej. Pereira - Pasto: 330 km) y el valor del viaje.\n\nEl SGT es esencialmente un sistema diseñado para transformar la operación manual de una red ferroviaria en un proceso digital, eficiente y automatizado, con el cálculo de rutas como su funcionalidad central.",
    "members": [
      "MARIA CATALINA SANCHEZ SAAVEDRA",
      "JUAN JOSE GONZALEZ ROSALES"
    ],
    "date": "2025-10-29",
    "teacher": "FRANCISCO JESÚS MOLINA BOVEA",
    "course": "ESTRUCTURAS DE DATOS",
    "project": "EQUIPO 4",
    "images": ["/equipo4/1.jpg","/equipo4/2.jpg","/equipo4/3.jpg","/equipo4/4.jpg","/equipo4/5.jpg","/equipo4/6.jpg","/equipo4/7.jpg","/equipo4/8.jpg","/equipo4/9.jpg","/equipo4/10.jpg","/equipo4/11.jpg","/equipo4/12.jpg","/equipo4/13.jpg","/equipo4/14.jpg","/equipo4/15.jpg","/equipo4/16.jpg","/equipo4/17.jpg","/equipo4/18.jpg","/equipo4/19.jpg","/equipo4/20.jpg","/equipo4/21.jpg","/equipo4/22.jpg","/equipo4/23.jpg","/equipo4/24.jpg","/equipo4/25.jpg","/equipo4/26.jpg","/equipo4/27.jpg","/equipo4/28.jpg","/equipo4/29.jpg","/equipo4/30.jpg"],
    "comments": [
      {
        "text": "Pues, por ahí teníamos que pasar. Muy bien. Su compañero no fue del GPT. Felicitaciones, bien hecho. El grafo: me gustaría saber un poquito más cómo funciona por dentro, cómo asumen las colas de los vagones. Vimos un modelo UML muy grande; para una próxima presentación, uno muestra el modelo completo para decir “mira, esta es la complejidad”, pero debe buscar la manera de hacer un zoom y hablar de esas cositas importantes. El modelo, el grafo, el objeto que soporta el grafo es importante, entonces podrían hacer un zoom sobre el objeto y explicar cómo funciona. Tengan en cuenta que, para hacer un software especializado y no tener problemas de sintaxis y semántica, UML es una notación que tiene sintaxis y semántica, como el español, inglés o francés; si no siguen esas reglas, no se puede comunicar. Son poquitas flechas; no se preocupen, los grandes también sufren de lo mismo. Hay cuatro flechas en UML y a veces no saben expresar qué es una herencia, una composición, una agregación o una dependencia. Esas cositas ustedes las verán en el segundo año; cuando lleguen, se pulirán en eso. A ser cómplices, les doy un tip: la conclusión debe tener una afirmación y una razón que la soporte. No pueden decir solo “lo logramos”, porque eso no concluye nada; deben decir: “usamos el grafo fulano de tal, basado en el modelo de tal, con el algoritmo de tal, porque esto es perfecto”, eso muestra la solución. Háblenme un poco más de cómo gestionaron, por ejemplo, las colas de los tickets o las sillas de los vagones. ¿Este vagón tenía carga? Sí. Hay vagones de usuarios y vagones de carga. Muy bien, hiciste una cola de prioridad. ¿Cuántos niveles o jerarquías de prioridad tiene? ¿Dos o uno solo? La prioridad se basa en un solo argumento, solo categoría. Muy bien, eso es lo que queremos escuchar en estructuras de datos. Una aclaración: quisiera ver evidencia de cómo implementaron la metodología de Kahneman. Me da la impresión de que ustedes usaron el tablero Kanban. ¿Usaron la metodología o solo el tablero? Usaron el tablero. Ah, eso es distinto. El método está hecho para sacar elementos en producción en línea de producción, y aquí solo hay un producto que no se repite. Ese marco conceptual deben tenerlo en la cabeza para poder tomar decisiones. Muy buen trabajo.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "En el proyecto hicieron un muy buen análisis. Quería preguntar: ¿qué limitaciones o problemas tuvieron al utilizar las estructuras propias? muy bien muchas gracias",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      },
      {
        "text": "Muy bien por mostrar el grafo.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Hay que tener en cuenta que la presentación no se vea opacada por la falta de conclusiones.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      }
    ]
  },
  {
    "id": 16,
    "title": "EQUIPO 5",
    "description": "No se presentaron.",
    "members": [
      "JUAN DIEGO BOHORQUEZ VARGAS",
      "JOSE DAVID SERRANO PERTUZ"
    ],
    "date": "2025-10-29",
    "teacher": "FRANCISCO JESÚS MOLINA BOVEA",
    "course": "ESTRUCTURAS DE DATOS",
    "project": "EQUIPO 5",
    "images": ["/equipo5/1.jpg"],
    "comments": []
  },
  {
    "id": 17,
    "title": "URBAN SHOES",
    "description": "El proyecto consistió en el desarrollo e implementación de un Sistema de Información para la gestión de inventario de la empresa Urban Shoes, enfocado en mejorar el control de stock, reducir errores y asegurar la actualización constante de la información.\n\n1. Requerimientos y Funcionalidades Clave\nSe analizó y documentó el sistema de inventario, incluyendo Requerimientos Funcionales (RF). Un ejemplo específico presentado fue:\n\nRF3: Control de Stock con Alertas: Dirigido al rol de Administrador. El sistema debe generar alertas cuando el stock de un producto esté bajo, al llegar a 8 y 3 unidades.\n\n2. Diseño de la Arquitectura y Modelado\nEl diseño del sistema siguió un enfoque estructurado, plasmado en diagramas clave de ingeniería de software.\n\nPatrón de Arquitectura MVC\nEl sistema se desarrolló utilizando el Patrón de Arquitectura Modelo-Vista-Controlador (MVC), el cual garantiza una estructura organizada, escalable y que facilita el desarrollo futuro.\n\nModelo: Maneja la lógica de negocio y los datos, interactuando con la base de datos.\nVista: Es la interfaz de usuario, lo que el usuario ve e interactúa.\nControlador: Actúa como intermediario, recibiendo peticiones de la Vista y llamando al Modelo para procesar los datos antes de devolver el resultado a la Vista.\n\nDiagrama de Casos de Uso\nSe definieron las funcionalidades del sistema centradas en el rol de Administrador. Las principales funcionalidades incluyen: Iniciar Sesión, Agregar Zapato, Controlar Bajo Stock, Modificar IVA, Ver Inventario, Ver Zapatos Devueltos y Generar Reportes, incluyendo la opción de generar un Reporte Personalizado.\n\nDiseño de Base de Datos (Modelo Relacional)\nLa estructura de la información se diseñó mediante un Modelo Entidad-Relación y su posterior implementación relacional, utilizando MySQL como gestor de base de datos.\n\nSe establecieron las tablas clave y sus relaciones para almacenar información de Productos, Entradas, Salidas, Ventas, Devoluciones, Empleados y otros datos necesarios para el control del inventario y la lógica de negocio.\n\nDiagramas de Interacción\nSe modeló la lógica de interacción del sistema, probablemente a través de Diagramas de Secuencia o de colaboración, detallando el flujo de mensajes y llamadas entre el Controlador, el Modelo y la Vista para ejecutar las funcionalidades.\n\n3. Implementación y Resultados\nSe desarrolló la interfaz de usuario del sistema de inventario, mostrando una tabla de productos con detalles como código, modelo, stock y precio.\n\nSe implementó la funcionalidad para exportar reportes, visible en la parte inferior derecha de la interfaz.\n\n4. Conclusiones del Proyecto\nLos estudiantes destacaron que:\n\nSe cumplieron los requisitos propuestos para Urban Shoes, logrando un diseño que facilita el control de stock, la reducción de errores y el mantenimiento de la información actualizada.\n\nEl patrón de arquitectura Modelo-Vista-Controlador (MVC) fue una elección exitosa, ya que proporcionó una estructura organizada y escalable para el desarrollo actual y futuras expansiones del sistema.\n\nEl proyecto sirvió para aplicar conocimientos técnicos, así como para fortalecer habilidades blandas como la comunicación, la organización y la resolución de problemas.\n\nEl trabajo en equipo fue fundamental para el diseño de diagramas, la creación de prototipos y la programación del sistema.",
    "members": [
      "CARLOS DAVID FIGUEROA ARGUELLO",
      "GABRIEL MATIAS RODRIGUEZ CASTRO",
      "JHOSTYN SANTIAGO GUALDRON JAIMES",
      "JORGE ANDRÉS GONZÁLEZ FIGUEROA",
      "JUAN PABLO MEDINA MENESES",
      "LUIS EDUARDO MORALES PALENCIA"
    ],
    "date": "2025-10-29",
    "teacher": "JAVIER ENRIQUE LIZARAZO RUEDA",
    "course": "INGENIERÍA DE SOFTWARE",
    "project": "URBAN SHOES",
    "images": ["/urbanshoes/1.jpg","/urbanshoes/2.jpg","/urbanshoes/3.jpg","/urbanshoes/4.jpg","/urbanshoes/5.jpg","/urbanshoes/6.jpg","/urbanshoes/7.jpg","/urbanshoes/8.jpg","/urbanshoes/9.jpg","/urbanshoes/10.jpg","/urbanshoes/11.jpg","/urbanshoes/12.jpg","/urbanshoes/13.jpg","/urbanshoes/14.jpg","/urbanshoes/15.jpg","/urbanshoes/16.jpg","/urbanshoes/17.jpg","/urbanshoes/18.jpg","/urbanshoes/19.jpg"],
    "comments": [
      {
        "text": "Por ahí vi al GPT actuando y no vi reconocimiento. Desde Urban Shoes pasó a Super Urbano. ¿Quién más se dio cuenta? Pelados, ya los profes estamos rejugados con el GPT, entonces pilas con eso, ¿ok? Medina, escuchar con propiedad. Joven, y Gabriel, escuchar con propiedad. Carlitos, me gusta verlos allá; sé que no es su habilidad mayor la exposición en público, pero todos los cinco por Justin Gaviria lo hicieron muy bien al hablar. Ahora que tienen otro, sí, esa solución de paqueteaje que no les cambie de Urban Shoes para Super Urbano la tienen los chicos de séptimo semestre de PI2, a los que les ganaron porque ustedes tienen login y usuario y ellos no. Entonces los quiero mejor. ¿Están listos para PI2? Pero, ojo, ellos ya solucionaron eso porque programan en inglés. Y eso ya ustedes lo saben. ¿Por qué se los inculco desde Operativos y por qué les pido que tomen inglés? Para no darles a papás. Entonces ya no se les olvida, ¿cierto? Bueno. Ingeniero Lenin, go ahead.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "Esto... Sí, sí. No, muy bien, la presentación estuvo muy bien, pero hay algunas cositas que quiero aclarar, no solamente para ustedes, sino para todos. Vamos a hacer un pin con de preguntas. Por favor, pongan el modelo vista controlador, es que es algo que ustedes usan mucho y siempre tienen ahí como esos detalles. Sí, puede ser el número. ¿Por qué modelo dice controlador? El compañero dice que en el modelo reina que la funcionalidad está en los demás lugares. ¿Por qué dices eso? Vale, entonces ahí es donde lo están entendiendo mal. Toda la lógica del negocio está en el modelo, todo, todo el dominio del sistema está en el modelo, ¿sí? Para eso está, no solamente para crear entidades con atributos. Todas las funcionalidades, todos los métodos que dices deberían estar en el modelo, no en las demás capas. Además, las demás capas están hechas: la vista para hacer interfaz y el controlador para mediar con la interfaz. ¿Vale? Entonces ahí hay un error de diseño, porque si yo te quito la vista, te quito negocio, y si te quito negocio, ya no sirve la aplicación. Yo te digo mañana, cambia esta vista por esta otra vista, y ya no te sirve la aplicación porque se fue la mitad del negocio en la vista, y no puede pasar eso. Yo hago capas o hago una arquitectura de capas para liberar responsabilidades, ¿sí? Para que la vista se encargue de la vista, y si yo cambio la vista por otra vista, el sistema no tiene por qué afectarse, y menos en términos de negocio. Lo mismo pasa con el controlador; si yo cambio de controlador, eso es porque estoy mejorando algún tipo de algoritmo para gestión contra la vista del modelo, pero el negocio no tiene por qué afectarse, ¿sí? Si no, no estás haciendo nada. Si tú repartes todo el negocio a través de todas las capas, entonces no haces nada. ¿Para qué haces capas? Haz una sola. Es un concepto, o sea, en general, no estoy diciendo que ustedes solamente, que siempre tienen ese problema con estas arquitecturas y patrones. Entonces tengan eso muy en cuenta. Hay una falla y se ha quebrado, porque entonces, como ya decía más adelante, alguien dijo que era limpio y que podía ser escalable, y que no sé qué, ya no escalaba. No podía ser, ¿bien? Otro detalle: la vista, cuando uno arranca en los primeros semestres, tiende a pensar que la vista es para el usuario humano que le hace clic a un botón, ¿vale? No. La vista es esa interfaz con cualquier otro sistema, y entre esos, los humanos. En una aplicación, la vista puede ser esa interfaz contra el humano, pero también puede ser un API, un endpoint, un servicio de base de datos, o cualquier otro sistema. ¿Me entiendes? Todo lo que hace interfaz con otro sistema. Hablando como sistema, entre comillas, los humanos hablan a través de una vista, ¿sí? Entonces, para que tengan eso claro. ¿Entendemos? Porque en el futuro, cuando ustedes lleguen a hacer otro tipo de aplicaciones, no tengamos todo ese enredo, porque hay muchos compañeros que llegan a juego y por allá hacemos algunas cosas con modelo vista controlador y tienen esos huecos, y no entienden dónde van las cosas, ni cuál es el papel de cada uno de los elementos que están ahí. Este es el cierre de ingeniería del software, entonces para que hoy sí lleven eso, bien. Esa es una cosita que tenemos que tener clara. ¿Bien? Ahora, muéstrenme el modelo de caso de uso. Vamos a hablar de ingeniería del software. Ah, mira, aquí anoté: es que el modelo tiene los getter y los setter, eso no tenía ningún sentido. Casos de uso. Explíquenme por qué expresan un flujo de un procedimiento con un caso de uso. ¿Saben cuántos modelos existen en UML? ¿Y por qué no usaron un diagrama de actividades o un diagrama de secuencias? Bueno, sí. ¿Los conocen? Los conocen. Es que ese es otro error. No les digo que eso sea solo suyo, sino en general, porque estamos tratando de hacer realimentación para todos. Es un error que también tienen muchas personas: utilizan un modelo de casos de uso para expresar flujos. ¿Dónde ves el tiempo? En ningún lado hay tiempo. No está hecho para eso. ¿Vale? ¿Por qué no lo hacen ustedes? Ustedes los tienen. Más adelante hay un diagrama de actividades y había unos diagramas de secuencia que no se ve nada, y no deberían ponerlos así en las diapositivas. Deberían tratar de hacer eso para explicar. Estos tienen eso, pero cuando hablan en el discurso que hicieron en este modelo, están hablando en términos de un flujo, ¿vale? Y ahora te voy a decir otra cosa. Imagínate que yo te doy ese modelo para que hagas el programa, ¿vale? Entonces tú entiendes, bueno, ustedes, todos. Todos entendemos, mis queridos ingenieros, que ese inicio de sesión es una función, método, procedimiento, operación, como quieras llamarlo según el lenguaje o paradigma que usas. ¿Entendemos eso? ¿Cierto? Que lo ejecuta ahí el servicio administrador. Imagínate que yo tengo una interfaz donde presiono el botón “inicio de sesión” y corre “agregar zapato”, “consultar bajo stock”, “modificar el IVA”, “ver zapatos devueltos”, “ver inventario”, “generar procesos”, y aparte de eso tengo la opción de “generar reporte personalizado”. Eso es lo que dice el señor. ¿Me entienden? Si no entienden, pregunten. No, es que tú estás presentando un caso completo. Cuando tú dices include, imagina lo siguiente: iniciar sesión es un public, bueno, digamos ahí, iniciar sesión, paréntesis, corchete, y viene el código, y por dentro de ese código, cada vez que dices un include, hay una llamada a otra función. Y entonces tú dices “iniciar sesión”, y por dentro del código aparece “generar reportes”, ese bloque, y por dentro del código aparece “ver inventario”, y por dentro del código aparece “ver zapatos”, ¿me entiendes? Eso significa include. Se ejecuta todo el sistema según este modelo. ¿Me entienden? Esa es otra cuestión que siempre tenemos con estos modelos. Por eso uno hace un requisito y el otro hace otro. Recuerda el IEEE 830. Entonces tú haces un caso de uso, documentas todo el caso de uso, que tiene sus precondiciones, sus poscondiciones, los casos de uso asociados, etcétera, etcétera, ¿no? Y haces uno, y luego haces otro, y luego haces otro. Ya no están separados, ¿bien? Entonces no puedes decir que todo está incluido, ¿sí? ¿Si me hago entender? Pero es que ahí no hay un paquete. A ver, bueno. Sintaxis, ¿vale? Entonces, tengan eso muy presente. Entonces, por eso mismo que está pasando es que cuando tú explicas el diagrama, lo tratas como un flujo, porque estás diciendo “entonces el sistema hace esto, y luego hace esto, y después hacemos esto”, y ni siquiera el sistema, la persona. Estás contando lo que hace la persona: la persona hace A, B, C, D, E, F, G, entonces cuenta desde que arranca el inicio de sesión hasta que apaga la computadora. No tiene sentido. Entonces, eso es algo que yo siempre trato de aclarar en todas mis clases porque siempre pasa eso. Y no se preocupen, los muchachos mayores que vieron ayer siguen sufriendo con los mismos problemas de ingeniería. Si tú haces un modelo, se entiende que es para abstraer el problema y poder crear una solución. Si haces un modelo para hacer un modelo que no tiene nada que ver con la solución que van a hacer, entonces ¿para qué haces un modelo? ¿O para qué estudiamos ingeniería si no vamos a hacer abstracción de nada? ¿Sí? ¿Vale? Entonces tengan mucho cuidado con eso. Los sistemas de hoy son muy complejos y no hacemos modelos grandes porque son muy complejos; se pueden hacer más sencillos, pero tienen que tener una secuencia lógica y tienen que servirnos para algo. Vamos a poner lo que ponemos. ¿Bien? Listo, muchas gracias. Listo, de usuario. ¿Me muestra el modelo de entidad-relación? ¿Qué son las materias que están viendo, no? Sí, entonces hablemos de eso. ¿Quién le ayuda a Luis Eduardo, chicos, con el modelo de actividad? ¿Carlitos? El que sea, eso. Así es. ¿Me explicas por qué tienes esta tabla ahí abandonada? Vale, no es un pecado, o sea, tener un modelo de entidad relacionado con una tabla que no está relacionada no es un pecado, nadie ha dicho eso, solo que me daba curiosidad porque estaba suelta. Es una tabla de parametrización del sistema, o sea, donde yo dejo... Y bueno, está bien, tú lo puedes hacer por base de datos, o lo puedes hacer por los famosos .configs, o lo puedes hacer por los environment. Ya, eso está bien, está muy bien. Bueno, eso para comentarles para futuras... Sí, si tú no haces las pruebas no puedes entregar el producto, imagínense el banco, bueno, ya lo vimos antes, sí, hay que documentarlo, sí, eso hay que probar, pero bueno, pedí el micrófono porque has usado una palabra: ¿cuánto cuesta el sistema?, ¿cuánto cuesta el sistema?, ¿cuánto costó hacer el sistema?, tiene que saber cuánto vale, ahora simplemente yo como cliente, ah no, eso está muy caro, y es que simplemente, ah, pero muy simple, 40, claro, quítense, quítense esa palabra, nos pasa mucho, fíjense, es simplemente, básicamente, ¿a usted le parece simple montar esa base de datos?, descubrir la tabla de parámetros, ¿eso le parece simple?, bueno, muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "Chicos, ¿qué tipo de pruebas hicieron?, ¿qué tipo de pruebas hicieron?, ¿y qué tipo de pruebas es esa?, porque las unitarias obligatoriamente hay que hacerlas, ¿sí?, siempre que usted hace un software siempre debe hacer pruebas, ¿cuántos usuarios tiene el sistema?, ¿prueba de integración?, así se llama, así se llama, ¿y cuántos usuarios o componentes soporta el sistema?, ¿cómo documentaron?",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      },
      {
        "text": "Es diferente decir la interfaz es sencilla por usabilidad, a decir que es simple.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "Bueno, estamos hablando de la parte de pruebas, costos y demás, ¿quién validó que lo que me presentaron aquí está funcionando o de acuerdo a los requerimientos que me mostraron y dónde está consignado?, prueba de aceptación, Gabriel, gracias.",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      }
    ]
  },
  {
    "id": 18,
    "title": "RANA SHOES",
    "description": "El proyecto desarrollado Rana Shoes S.A.S., una compañía de calzado artesanal que enfrentaba problemas de control manual de inventarios, trazabilidad, demoras y errores.\n\n1. MODELADO DE REQUERIMIENTOS Y CASOS DE USO\nEl sistema se diseñó para automatizar las operaciones clave de la empresa.\n\nRegistro de Ingreso de Materiales (RF-01):\nRol: Operario.\nPrioridad: Alta.\nDiagrama de Casos de Uso: El Operario puede Registrar Ingreso de Materiales. Este caso de uso incluye la acción de Validar Datos y puede extender las acciones de Registrar Proveedor y Generar Comprobante.\nDiagrama de Actividad/Secuencia: Muestra el flujo detallado, iniciando con el Operario ingresando los datos, validando, y el sistema interactuando con el Backend y la Base de Datos para guardar la información y retornar una confirmación.\n\nRegistro de Entregas de Producto Terminado:\nRol: Auxiliar de Bodega.\nDiagrama de Casos de Uso: El Auxiliar de Bodega puede Registrar Entrega. Este caso de uso incluye las acciones de Validar Datos, Registrar Destino y Actualizar Stock, y puede extender la acción de Generar Comprobante.\n\n2. ARQUITECTURA DE DATOS (MODELO RELACIONAL)\nEl diseño de la base de datos es relacional y complejo, interconectando las entidades clave del proceso productivo.\nEntidades Centrales: User, Supplier, Material, MaterialType, ProductionBatch, ProductionStage, FinishedProduct.\nTrazabilidad y Control: Entities como MaterialDelivery, StockHistory, ProductionProgress, AuditLog, ProductReference y ReferenceMeasurement aseguran la trazabilidad de los materiales, los avances de producción y el historial de movimientos.\n\n3. RESULTADOS OBTENIDOS\nEl proyecto logró desarrollar la interfaz de usuario y las funcionalidades principales.\nInterfaz de Usuario: Se muestra la pantalla de 'Iniciar Sesión' del sistema, que es parte de los módulos de Gestión de Usuarios y Auditoría. Esto valida la gestión de credenciales y la seguridad del acceso.\n\n4. CONCLUSIONES DEL PROYECTO\nDesafío Arquitectónico: Enfrentaron dificultades iniciales al elegir la arquitectura (Capas vs. MVC). Finalmente, optaron por una Arquitectura por Capas pero incorporando principios del modelo MVC para optimizar la separación de responsabilidades y mejorar la estructura interna del software.\nAprendizaje Clave: Comprendieron que no es necesario limitarse a una única arquitectura, sino que es posible integrar lo mejor de varias según las necesidades del proyecto, logrando una solución más flexible, coherente y adaptada a la realidad de la empresa.\nLogro y Limitaciones: A pesar de las limitaciones en la organización interna del grupo, se obtuvo un resultado satisfactorio que cumplió con la mayoría de los requerimientos funcionales del cliente, dejando aprendizajes valiosos para futuros proyectos.",
    "members": [
      "ANDRÉS DANIEL FLOREZ MENDOZA",
      "ANGY NATALIA MEJIA DELGADO",
      "CRISTIAN CAMILO CHAPARRO CARVAJAL",
      "DANIEL FERNANDO HOGUÍN SANCHEZ",
      "JAVIER ALEXANDER SALAZAR FLOREZ",
      "SANTIAGO SANABRIA URIBE"
    ],
    "date": "2025-10-29",
    "teacher": "JAVIER ENRIQUE LIZARAZO RUEDA",
    "course": "INGENIERÍA DE SOFTWARE",
    "project": "RANA SHOES",
    "images": ["/ranashoes/1.jpg", "/ranashoes/2.jpg", "/ranashoes/3.jpg", "/ranashoes/4.jpg", "/ranashoes/5.jpg", "/ranashoes/6.jpg", "/ranashoes/7.jpg", "/ranashoes/8.jpg", "/ranashoes/9.jpg", "/ranashoes/10.jpg", "/ranashoes/11.jpg", "/ranashoes/12.jpg", "/ranashoes/13.jpg", "/ranashoes/14.jpg", "/ranashoes/15.jpg", "/ranashoes/16.jpg"],
    "comments": [
      {
        "text": "Bueno, muchachos, buenos días, por favor vámonos al objetivo general, por favor, primero está muy amplio, y segundo, ¿dónde están mis API REST?, defíname en seguridad, trazabilidad y eficiencia operativa, por favor, ahora vamos al diagrama de clases, por favor, primero, ese diagrama para mí no me está diciendo nada, solo me coloca supplier, material, material type, reference material y..., yo no creo que alguien les haya dicho lo que me están diciendo, es culpa de Petro, es culpa de Alí, si yo estaba ahí entonces no lo he escuchado, falta AWS profe, es culpa de Petro, es culpa de Alí, pero no vamos a hablar de que si Alí dijo o no dijo y voy a hacer de la palabra a mis compañeros docentes",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Hola, buenos días. Yo no voy a repetir lo que ya discutimos con el equipo anterior: hay muchas cosas que vimos en el equipo anterior. ¿Casos de uso? Yo pregunto de acuerdo al contexto: ¿ingeniería del software? ¿Qué casos de uso? ¿Hay uno en específico? No, no hay nada. ¿Cuál es la diferencia entre extends e include? Ahí no hay ninguno; está mal la sintaxis. Y si usamos UML, tenemos un lenguaje claro, una sintaxis clara. Ahora déjame ver la documentación del caso. Sí, sí tienen, ahí empezaban y leían; en el caso de uso fulano de tal leían cuál era el requerimiento: “Identificación RF-05, rol: operativo, versión 1, prioridad alta. El sistema deberá consolidar automáticamente los productos terminados al cierre de cada lote de producción, registrando la referencia, las tallas elaboradas, la cantidad total producida y la fecha de finalización del lote.” Entonces yo voy a hacer ese caso de uso: ¿qué me pasa? Yo lo trabajo. “¿Deberá consolidar automáticamente los productos?” ¿Qué significa eso? Quédate en el ejercicio: yo soy el programador, tú eres el funcionario que me está diciendo qué tengo que hacer y me envías eso; yo te pregunto, ¿qué significa “automáticamente” los productos terminados? ¿Qué me dices? Tú escribes el requisito: ¿qué es una intervención? ¿Cómo marco eso en el sistema? ¿Cómo hacemos eso? ¿Cómo se finaliza la etapa de lote de producción? No, eso ya fue el futuro; yo voy a hacer el producto, voy a escribir el código, contéstame lo que te estoy preguntando. Yo soy el desarrollador, estoy aquí parado frente a mi máquina con el IDE que use y quiero programarlo y leo ese requisito funcional y entonces tú me dices que hay un valor: ¿qué era el valor? ¿Hay unidades de zapatos? Sí. ¿Cuánto a cuánto dan las unidades de zapatos? ¿Y cuántos se esperan, cuántos vamos a manejar, cuántas cantidades? ¿Cuáles son las unidades de los zapatos: por precio o por unidad? Está en costura pero eso no está ahí escrito, no entiendo, ¿cómo lo hago? ¿Lo meto en la base de datos, hago una tabla, creo un objeto, hago un enum? No sé, ¿me entienden el punto? Allí dice, por ejemplo, “cada lote de producción registrando la referencia”: ¿qué es la referencia? Ahora dice “las tallas elaboradas”: ¿cuáles? ¿De cuál a cuál? Porque pueden ser tallas en modelo americano, en modelo europeo o tallas propias del negocio; ¿me entienden? El requisito está incompleto: no hay forma de que yo, como desarrollador, adivine qué tengo que hacer; ¿me entiendes? Si tú eres el funcionario y me entregas eso, yo no puedo hacer el sistema, y entonces viene que te voy a llamar 50 veces a preguntar “oye, ¿qué es esto de las tallas?”, “¿cómo calculo el total producido? ¿Cuál es la fórmula?” ¿Por qué no está documentado? Para eso hacemos ese proceso: requerimientos para poder hacer el diseño. Si el requisito no está claro, todo queda mal. Esto explica por qué siempre les pasa eso: el requisito lo escriben con una frasícita “Yo, como no sé quién, quiero hacer tal cosa.” Yo, por ejemplo, si tú me dices “Yo como quién quiero registrarme en el sistema”, yo te pregunto: ¿y con qué haces la conexión? ¿Con registrarme en el sistema cómo? ¿Cómo es la vista? ¿Hay un botón? ¿Es una app? ¿Llama a otro sistema? Entienden: hay que documentar bien el sistema, porque si no no hay forma de hacerlo. En la siguiente documentación, los flujos están bien; cada uno tiene su flujo. Aparecía a la izquierda el diagrama de actividades y a la derecha el diagrama de secuencia; si tienes tiempo, hazlo, es chévere. Lo importante es que sea claro el flujo, y si usted hace una buena documentación y formaliza los casos de uso, identifica cuáles son las funciones que van en esa lineita del diagrama de secuencia y cuando hace el diagrama de secuencia, arriba en las cajitas le dice cuáles son las clases del sistema; ya están, no tienes que inventártelas; con las cajitas de arriba haces el diagrama de clases, y con el diagrama de clases sacas los modelos de datos —primero el negocio y después los datos, no al revés—; nos acostumbramos mal a pintar directamente la entidad-relación; ¿quién dice que los datos funcionan así? No necesariamente. Aquí hay un caso: arriba solo hay backend, base de datos y operario, y usted en el superobjetivo, que parece un contrato con todos los requisitos, no es un objetivo —todos los requerimientos están en el objetivo—; me dices que tienes Angular, API REST, backend con capas, modelo vista controlador pero con muchas capas; ahí no hay nada, no tiene sentido. Nosotros hacemos diseño para después codificar; ya cuando vas a codificar, le puedes pedir ayuda a la IA, pero primero el diseño para obtener rendimiento “fácil” entre comillas; como que no se nos pierda el objetivo. Otra pregunta: ¿qué versión de Angular están usando? ¡Espectacular!, ¿y por qué se metieron a Angular? Usted me dice que no hizo nada. No podemos hablar de ello porque no está. Hay una afirmación interesante sobre vista-controlador pero está lejos; ¿me puedes ampliar eso? No tienes que hablar tú solo; son cinco; tienen un revuelto de cosas y creo que deben estudiar eso un poco. MVC es una de las capas; sí, hay que estudiarlo. Pónganme el diagrama de casos UML de clases, por favor. Yo hablo con Ali todos los días: Ali, Ali, habla. Creo que lo que quería decirles, Ali, es que no necesitas poner todos los atributos; la idea es expresar lo más importante del negocio, no detallar si es booleano o una regla; no es relevante para el negocio. Pero tienen un problema: no tienen título en esa diapositiva, no se sabe para qué es, entonces el profesor no sabe qué estás expresando; si pones “diagrama de dominio” ya se entiende. Eso es importante. Si yo pusiera todas las asociaciones y dependencias en un diagrama de clases, todas estarían relacionadas con todas; el libro dice que no las pongas todas porque no tiene sentido; estoy viendo un millón de asociaciones que no expresan si es composición, agregación o dependencia; no sé qué quieres decir con esas líneas. La dependencia es una línea punteada o una flecha en dirección de dependencia; solo pon las relevantes para el desarrollo. En el demo, para prepararlo, hagan el ejercicio pensado: ¿cómo vas a llenar un formulario con KFF, KFF? Eso queda mal.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "Buenos días. Buenos días. Complementando con todo lo que han dicho los profes, yo solamente voy a hacer una pregunta: ¿qué patrón de diseño de software utilizaron, dónde lo usaron y por qué? Muchas gracias.",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      }
    ]
  },
  {
    "id": 19,
    "title": "VETERINARIA SOS",
    "description": "El grupo de Veterinaria SAS llevó a cabo un proyecto de desarrollo de software cuyo objetivo fue crear un Producto Mínimo Viable (MVP) de un sistema de información para gestionar integralmente los módulos de inventarios, ventas, clientes, registros y proveedores de la Veterinaria & Spa SOS. El proyecto surgió de la necesidad de la veterinaria de unificar la gestión que se realizaba con dos softwares independientes, lo que causaba incoherencia de datos, errores en reportes y baja eficiencia.\n\nPara lograr este objetivo, el grupo se propuso dos objetivos específicos: desarrollar el código fuente con las funcionalidades principales y verificar y validar su funcionamiento mediante pruebas unitarias, de integración y de aceptación.\n\nEnfoque Metodológico y Arquitectónico\nEl proyecto se estructuró en torno a principios de ingeniería de software robustos:\n\nMetodología: Se eligió la Metodología Espiral, que permitió un enfoque iterativo para detectar errores de manera temprana, gestionar el riesgo y corregir inconsistencias en la arquitectura (como las que se presentaron inicialmente entre vistas y base de datos) sin necesidad de rehacer todo el trabajo. Fomentó una cultura de revisión y mejora continua.\n\nArquitectura: Se implementó el patrón Modelo-Vista-Controlador (MVC) para separar responsabilidades y asegurar que la lógica de negocio se mantuviera fuera de la interfaz. Esto mejoró la mantenibilidad y facilitó la integración de módulos como Inventario, Clientes y Mascotas. En las primeras iteraciones, el equipo cometió el error de mezclar validaciones con controladores, generando dependencias complejas.\n\nPatrones de Diseño: Se utilizaron patrones como Singleton (para garantizar una única instancia de la configuración de la base de datos) y Repository (para aislar la base de datos de la lógica de negocio y facilitar las pruebas).\n\nBase de Datos: Se empleó un modelo de Base de Datos Relacional, utilizando PostgreSQL y Supabase como gestores, modelada previamente con un Diagrama Entidad-Relación y un Modelo Relacional que definía tablas, claves primarias y foráneas.\n\nDiseño y Modelado del Sistema\nEl equipo detalló el diseño del software utilizando diagramas UML:\n\nDiagramas de Casos de Uso: Se definieron las funcionalidades principales para los actores Administrador y Empleado en módulos como Gestión de Inventario (registrar, buscar, editar, eliminar productos), Gestión de Clientes (registrar clientes y mascotas, consultar datos) y Gestión de Ventas (generar, consultar, editar ventas).\n\nDiagramas de Actividades y Secuencia: Se especificó el flujo de procesos para operaciones clave como el Registro de Productos y la Actualización/Búsqueda de Productos, detallando la interacción entre el Administrador, el Sistema, la Base de Datos y el Módulo de Inventario.\n\nDiagrama de Paquetes: Se mostró la estructura modular del código fuente, con paquetes lógicos para la persistencia y los diferentes módulos funcionales (Inventario, Clientes, etc.).\n\nFinalmente, se presentaron interfaces de usuario para la aplicación, incluyendo pantallas para la recuperación de contraseña y la adición de mascotas, demostrando el desarrollo del MVP.\n\nConclusiones y Aprendizajes\nLas conclusiones del proyecto se centraron en los desafíos técnicos y la importancia del trabajo en equipo:\n\nGestión de Versiones: La documentación constante y el control de versiones en GitHub se identificaron como fundamentales para la trazabilidad. Inicialmente, la falta de registro de decisiones técnicas y versiones, así como la falta de ramas por cambio, generó confusión y pérdida de código. El equipo mejoró esto estandarizando commits, ramas y documentación.\n\nArquitectura Sólida: El uso de patrones como MVC y Repository fue clave para reducir errores, mejorar la mantenibilidad y simplificar las dependencias.\n\nTrabajo en Equipo: El desarrollo demostró que el trabajo efectivo requiere división clara de tareas, comunicación técnica y revisión colectiva. La falta inicial de sincronización generó conflictos de versiones y retrasos. El aprendizaje más valioso fue que la colaboración disciplinada multiplicó la calidad del producto final.",
    "members": [
      "DAVID EDUARDO FLÓREZ DURÁN",
      "DAVID RICARDO CARVAJAL BARRAGÁN",
      "JOSÉ DAVID MORA PATIÑO",
      "JUAN DAVID ORDÓÑEZ FERREIRA",
      "JUAN DAVID TÉLLEZ GUISA",
      "JUAN PABLO ARENAS AVENDAÑO",
      "LIBARDO BRAVO DURAN"
    ],
    "date": "2025-10-29",
    "teacher": "JAVIER ENRIQUE LIZARAZO RUEDA",
    "course": "INGENIERÍA DE SOFTWARE",
    "project": "VETERINARIA SOS",
    "images": ["/veterinariasos/1.jpg", "/veterinariasos/2.jpg", "/veterinariasos/3.jpg", "/veterinariasos/4.jpg", "/veterinariasos/5.jpg", "/veterinariasos/6.jpg", "/veterinariasos/7.jpg", "/veterinariasos/8.jpg", "/veterinariasos/9.jpg", "/veterinariasos/10.jpg", "/veterinariasos/11.jpg", "/veterinariasos/12.jpg", "/veterinariasos/13.jpg", "/veterinariasos/14.jpg", "/veterinariasos/15.jpg", "/veterinariasos/16.jpg", "/veterinariasos/17.jpg", "/veterinariasos/18.jpg", "/veterinariasos/19.jpg", "/veterinariasos/20.jpg", "/veterinariasos/21.jpg", "/veterinariasos/22.jpg", "/veterinariasos/23.jpg", "/veterinariasos/24.jpg"],
    "comments": [
      {
        "text": "Bueno, muchachos, ¿cómo vamos? Ante todo, muy buen trabajo, se nota la cooperación entre todos los del grupo. Voy a preguntar lo siguiente: ¿cuánto cuesta el proyecto?, ¿cuántas veces se reunieron con su cliente para poder validar los requerimientos que nos mostraron?, ¿qué tipo de pruebas hicieron y cómo fueron validadas?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Yo tengo una sola recomendación, es en cuanto a la presentación. En esa parte se ve muy bien porque ustedes utilizan la presentación como un elemento de apoyo a lo que van a hablar. Pero digamos, la conclusión está completa, entonces intenten no colocar todo el texto. No es con ánimo de atacar, es constructivo. No coloquen todo porque se les nota el dominio del tema, se nota que lo hicieron, y a nivel de las preguntas técnicas las han respondido muy bien. Hay propiedad, entonces no es necesario copiar todo porque ustedes ya lo saben. Coloquen algunas frases que les permitan hacer el diálogo y el aporte. Es más para que el próximo año o semestre que estén en este proceso lo hagan mucho mejor.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Hola, buenos días. Tengo una consulta: ¿cómo gestionaron tanta gente en el equipo de desarrollo? Es interesante. El líder de documentación, vale, vale, bien, es una manera de trabajar. Digo yo, un millón de formas más o menos hicieron a uno, está bien. Solo quería saber porque son muchos para gestionar. La presentación y el producto se ven muy bien, buen trabajo. Hay unos detalles que ya discutí con los compañeros y también aplican, entonces hacer reflexión sobre esas cosas. Y tengo otra pregunta curiosa: ¿por qué es tan importante el inicio de sesión? Todas las aplicaciones hoy en día necesitan una sesión, sí, o sea, no es negocio, ¿no? Sí, claro, lo tienen que hacer y desarrollar, especificar, pero en este momento están mostrando el core del negocio. Eso les quita tiempo a las cosas que deberían estar ahí. Y ese tiempo que se gastaron en el inicio de sesión lo pasaron diciendo “ahí está el modelo, ahí está el paquete” y pasaban rápido, ¿no? Entonces, si la diapositiva está ahí, es porque quieren hablar de eso. Si no, ¿para qué la ponen? Venían muy bien explicados, con referencias y buen marco conceptual. Si la pusieron ahí es porque querían tocar el tema, mostrar algo. Si no, ¿para qué ponerlo? ¿Qué es lo primero que veo en el video? No es dejar de comentarlo porque alguien lo entendió así alguna vez; nunca hemos dicho que no lo hagan. Pero acá, en este momento, tú quieres hablar del negocio. Dime, ¿cuántas aplicaciones en el mundo no tienen inicio de sesión? Es un sistema de gestión de inventarios, la gente no tiene eso. Entonces, ese momentico de inicio de sesión podría mostrar otra cosa fantástica que hicieron. Eso es lo que quiero decir. No estoy diciendo que esté mal, sino que doy una recomendación: si lo pones, habla de eso. Por ejemplo, cuando traen un modelo entidad-relacional muy bueno, dicen “ahí está el modelo, mírenlo, muy chévere” y pasan rápido. ¿Qué tiene eso de importante? ¿Dónde está el negocio? ¿Cuál es ese detalle de fina coquetería que hay que contar? No es enseñar el modelo, sino expresar qué representa. Por eso, si tu negocio es una veterinaria, no pongas “modelo entidad-relacional” sino “modelo de datos de la veterinaria”. Nosotros hacemos modelos para expresar cosas, ese es el lenguaje. Entonces el título no debería ser “modelo entidad-relacional”, sino sobre qué estás hablando. Muy buen trabajo.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "¿En qué se basaron para escoger la arquitectura? ¿Por qué escogieron MVC por encima de otra arquitectura? No entendí, no entendí nada. ¿Y cuántos usuarios tiene el sistema? ¿En cuántos equipos se va a instalar? ¿Cómo hacen ustedes para garantizar la trazabilidad de los datos? Ok, entonces, ¿por qué no utilizar una arquitectura monolítica? Si por aquí el motivo fue el usuario o el cliente, en el proyecto, ¿qué procesos de ingeniería de software cambiarían y por qué?",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      }
    ]
  },
  {
    "id": 20,
    "title": "AVITECH",
    "description": "El proyecto Avitech se desarrolló con el objetivo de solucionar la pérdida de datos en la recolección de información en la Avícola San Miguel. Para ello, se creó un sistema de información avícola que digitaliza y centraliza los procesos internos, incluyendo el manejo de insumos, la salud de las aves y la producción diaria de huevos.\n\nObjetivo General:\nImplementar un sistema de información que registre, organice y consulte inventarios, control de gallinas y recolección/clasificación de huevos para mejorar la trazabilidad.\n\nObjetivos Específicos:\n- Sistematizar el registro y la llegada de insumos para garantizar un control eficiente y actualizado del inventario.\n- Generar reportes precisos y estructurados que faciliten el análisis de datos.\n- Implementar un módulo sanitario para gestionar y monitorear las condiciones del entorno productivo.\n- Desarrollar la funcionalidad de información y clasificación de huevos según talla y fecha de recolección.\n- Mantener el control del inventario en tiempo real para optimizar la trazabilidad.\n\nMarco Conceptual y Tecnológico:\nSe empleó una Base de Datos Relacional en MySQL, destacando su rendimiento, solidez y código abierto. Se aplicaron principios SOLID (Responsabilidad Única y Abierto/Cerrado) y patrones de diseño como Observer (para notificar automáticamente cambios de estado) y Factory (para instanciación flexible de objetos). La arquitectura adoptada fue Modelo-Vista-Controlador (MVC), separando la lógica de negocio de la interfaz para mejorar el mantenimiento y la escalabilidad.\n\nMetodología de Desarrollo:\nSe utilizó la Metodología de Prototipado, basada en la creación temprana de un modelo funcional o visual del sistema. El ciclo incluyó: retroalimentación con el cliente → diseño rápido → desarrollo del prototipo → pruebas → refinamiento → nueva retroalimentación.\n\nRequisitos Funcionales (Ejemplos):\nRF-01: Registro de insumos (Alta/Esencial).\nRF-02: Asignación de alimento a lotes (Alta/Esencial).\nRF-03: Control sanitario de lotes (Media/Deseado).\nRF-04: Registro de catálogos (Media/Deseado).\nRF-05: Condición sanitaria de lotes (Alta/Esencial).\nRF-06: Registrar producción diaria por lote (Alta/Esencial).\n\nDiagramas del Sistema:\nEl Diagrama de Casos de Uso del Administrador incluye registro y gestión de múltiples elementos (insumos, galpones, lotes, personal, proveedores, sacrificio, etc.). El Diagrama de Casos de Uso del Operario se centra en tareas operativas: iniciar sesión, consultar producción del día, registrar cantidad de huevos por tipo, producción diaria, peso promedio y mortalidad. El Diagrama de Clases representa la estructura de la base de datos con entidades como Usuario, Insumo, Galpón, Lote y Reporte. El Diagrama de Actividades muestra el flujo: seleccionar fecha → subsanar errores → registrar/consultar sanitarios, comida y huevos → actualizar inventario → generar reporte.\n\nInterfaz (Refinamiento y Video):\nLa interfaz cuenta con un Dashboard principal con indicadores de producción (2,100 gallinas, 0 huevos, 3 ítems), gráficos de producción, detalles por galpón y un menú lateral con módulos de Galpones, Suministros, Sanidad, Producción, Reportes, Alertas, Perfiles, Usuarios y Respaldo. Se incluye un video demostrativo de su funcionamiento.\n\nConclusiones:\nEl sistema de información Avitech cumplió con los requisitos funcionales y no funcionales establecidos en la SRS. Se identificaron limitaciones en la comunicación con el cliente, lo que generó variaciones en los requerimientos, pero se mantuvo una retroalimentación constante. A nivel interno, se presentaron fallos de sincronización, que fueron resueltos mediante una mejor organización y documentación. En general, el proyecto culminó satisfactoriamente, logrando un producto funcional y estructurado.",
    "members": [
      "ANDRES F. SANCHEZ PALACIO",
      "CARLOS F. PIMIENTO FONSECA",
      "ISABELLA MONTOYA GRANADOS",
      "JOSE O. PORRAS PRADA",
      "MELISSA PETERSON CALDERON",
      "NESTOR GUILLERMO N. LASSO RAMIREZ",
      "PABLO A. BRAVO VERGARA",
      "SIMON PEREZ GOMEZ"
    ],
    "date": "2025-10-29",
    "teacher": "JAVIER ENRIQUE LIZARAZO RUEDA",
    "course": "INGENIERÍA DE SOFTWARE",
    "project": "AVITECH",
    "images": ["/avitech/1.jpg", "/avitech/2.jpg", "/avitech/3.jpg", "/avitech/4.jpg", "/avitech/5.jpg", "/avitech/6.jpg", "/avitech/7.jpg", "/avitech/8.jpg", "/avitech/9.jpg", "/avitech/10.jpg", "/avitech/11.jpg", "/avitech/12.jpg", "/avitech/13.jpg", "/avitech/14.jpg", "/avitech/15.jpg"],
    "comments": [
      {
        "text": "Buenas tardes, una recomendación: revisen nuevamente el libro de UML porque lo que presentaron no corresponde a este tipo de diagramación, no hay casos de uso ni diagrama de clases, parece más un árbol de uso; recuerden que ya están en cuarto semestre y deben manejar los conceptos básicos de ingeniería de software; además, no se puede justificar el uso de MySQL solo porque es lo único que saben, la elección del gestor debe basarse en las necesidades del proyecto, ya que existen opciones como PostgreSQL o SQL Server, y varios de ustedes ya trabajaron con SQL Server en la materia de bases de datos, así que deberían poder argumentar técnicamente por qué eligieron MySQL.",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      }
    ]
  },
  {
    "id": 21,
    "title": "CENTRO DE DESARROLLO DE SOFTWARE",
    "description": "El proyecto fue desarrollado por el equipo Byfrost systems.\n\nProblema y Objetivos\n\nLa situación problema identificada fue la ausencia de un sistema de gestión unificado y una infraestructura clara para el parque tecnológico, lo que comprometía la eficiencia, la sostenibilidad y la escalabilidad de futuros convenios.\n\nEl objetivo fue implementar un sistema de gestión que integre de manera eficiente la infraestructura, los procesos administrativos, investigativos y de innovación en las entidades del consorcio. Esto se concretó en objetivos específicos: definir requerimientos funcionales y de interoperabilidad del SIG-PTU, diseñar una plataforma colaborativa modular, establecer protocolos de seguridad de la información e implementar metodologías para un producto mínimo viable (MVP).\n\nMarco de Trabajo y Diseño\n\nEl equipo utilizó la metodología Scrum para gestionar el proyecto, enfocándose en un flujo de trabajo que iba desde el caso de negocio hasta la entrega de incrementos aceptados después de cada Sprint.\n\nEl alcance del proyecto fue definido en el Product Backlog, totalizando 61 Requerimientos Funcionales, 1 Requerimiento No Funcional, 52 Historias de Usuario y 288 Tareas distribuidas en 7 fases.\n\nEl diseño incluyó:\n\nUna Topología Corporativa que definió la arquitectura de la red (LAN/WAN) con servicios esenciales como HTTP, DNS, DHCP y VOIP, asegurando la interconectividad.\n\nUn Diagrama de Entidad-Relación para la estructura de la base de datos del sistema.\n\nUn Diagrama de Casos de Uso que modeló las interacciones del usuario con el sistema de gestión.\n\nLa entrega final fue una Aplicación Web funcional.\n\nSeguimiento y Rendimiento\n\nEl trabajo se dividió en Sprints, con seguimiento detallado de la velocidad y el rendimiento mediante Burndown Charts.\n\nSprint I: El equipo demostró un alto rendimiento, completando 240 de 240 puntos comprometidos. Los Burndown Charts de puntos y tiempo mostraron una ejecución muy cercana a lo proyectado.\n\nSprint II: La velocidad se redujo ligeramente, completando 181 de 192 puntos comprometidos. Los Burndown Charts reflejaron una desviación, indicando que se realizaron menos puntos de lo esperado y se invirtió un tiempo superior al proyectado en algunas fases.\n\nSprint III: El Burndown Chart de puntos mostró una ejecución con retrasos intermedios, y el de tiempo evidenció que las horas invertidas se mantuvieron por encima de las horas proyectadas.\n\nConclusiones\n\nEl equipo Byfrost systems logró terminar la aplicación web, entregando los módulos clave de gestión de usuario, proyectos y servicios, con implementación de lineamientos de seguridad. La infraestructura tecnológica diseñada demostró ser una solución funcional, capaz de interconectar los distintos componentes del parque tecnológico.\n\nEl equipo enfrentó un contratiempo importante: la renuncia de uno de sus integrantes en una etapa avanzada. Este evento provocó una reestructuración y reasignación de tareas, causando un retroceso significativo en la planificación y afectando la sinergia. A pesar de este desafío, el equipo pudo realizar las tareas asignadas y concluir el proyecto satisfactoriamente.",
    "members": [
      "PINZON CAMACHO ANDRES FELIPE",
      "GARCIA BERNATE ERICK DAVID",
      "SAAVEDRA MARTINEZ HANSEL SANTIAGO",
      "VARGAS PARDO MIGUEL ANGEL",
      "GUERRA SUAREZ SERGIO IVAN"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE DESARROLLO DE SOFTWARE",
    "images": ["/centroDesarrolloSoftware/1.jpg", "/centroDesarrolloSoftware/2.jpg", "/centroDesarrolloSoftware/3.jpg", "/centroDesarrolloSoftware/4.jpg", "/centroDesarrolloSoftware/5.jpg", "/centroDesarrolloSoftware/6.jpg", "/centroDesarrolloSoftware/7.jpg", "/centroDesarrolloSoftware/8.jpg", "/centroDesarrolloSoftware/9.jpg", "/centroDesarrolloSoftware/10.jpg", "/centroDesarrolloSoftware/11.jpg", "/centroDesarrolloSoftware/12.jpg", "/centroDesarrolloSoftware/13.jpg", "/centroDesarrolloSoftware/14.jpg", "/centroDesarrolloSoftware/15.jpg", "/centroDesarrolloSoftware/16.jpg", "/centroDesarrolloSoftware/17.jpg", "/centroDesarrolloSoftware/18.jpg", "/centroDesarrolloSoftware/19.jpg", "/centroDesarrolloSoftware/20.jpg", "/centroDesarrolloSoftware/21.jpg"],
    "comments": [
      {
        "text": "Por favor, objetivo general: de acuerdo con lo que tengo acá, ustedes son el centro de desarrollo de software, ¿cierto? Entonces, ¿por qué colocan “diseñar soluciones de software”? ¿Dónde queda el desarrollo? Los resultados que me muestran son una página, ¿la desarrollaron ustedes o alguien de las otras casas? Porque si solo entregan un producto, no pueden hablar de “soluciones de software”. Hablemos desde la parte de ingeniería de software: sinceramente, los diagramas que mostraron no se entendían, y aunque sé que ya me estoy volviendo viejo, le pregunté a mis compañeros si alcanzaban a leer y nadie pudo leer nada del diagrama. Vámonos un momento al caso de uso, por favor: ¿qué significa ese círculo? En el estándar UML no se puede hacer eso, hasta donde tengo entendido. ¿De dónde sacaron que se podía hacer? Además, ¿ese software que usaron está certificado por alguna entidad que maneje UML, es decir, el software mismo tiene permiso para generar esas figuras según el estándar?Hablemos un poco de la última conclusión: ustedes dicen que eran seis, ¿qué pasó con ese compañero bajo los principios del trabajo de Marco Scrum? Cuéntenme qué sucedió, ¿qué rol tenía ese compañero? Se repartieron las diferentes pantallas del front y después, ¿quién asumió esa tarea? Todos se repartieron, ¿y el compromiso dónde queda? Muéstrenme las gráficas que mostraron de Scrum, me dicen que fue principalmente en eso, ¿qué significa eso? Gracias.",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Yo no veo evidencia de la solución tecnológica. Había un pantallazo que me mostró el joven Vargas donde se veía el DNS, pero el diablo es puerco y puede estar en todas partes. Yo hubiera preferido un video que demostrara que el DNS realmente funcionaba, pero no vi FTPS ni entiendo para qué lo utilizan; solo vi un .com. ¿Dónde está desplegado eso? Por partes, Karina. Entonces, ¿quién me responde por el DHCP, la voz, el IP o el FTPS? Yo no vi evidencia de eso, no sé si llegué tarde o si lo pasaron mientras me echaba el tanino. Pero eso, para mí, no es evidencia. Para la próxima, eso debe mostrarse en video. Porque como les digo, el diablo es puerco. Ustedes saben quién es Dios y quién es el diablo. Entonces, yo hubiera preferido un video, ¿ok? Y además, ¿cómo evidencio yo el FTPS? Miren la segunda conclusión: me mienten. Nos mienten. Esa conclusión nos mintió.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "El objetivo es perfecto pero para el cliente; es el sueño de todo cliente porque queda abierto y los puede tener trabajando indefinidamente sin pagarles y luego incluso demandarlos; por eso bien, les voy a contar una historia de una pared, yo tomo una serie de ladrillitos y hago la pared, mi conclusión número uno: el ladrillo demostró ser el material idóneo para construir una pared, ¿qué cambia con eso? nada, el grupo logró terminar la aplicación, el ingeniero logró terminar la pared, la infraestructura tecnológica diseñada demostró ser una solución funcional, la pared demostró ser una división entre dos oficinas, bien, el trabajo desarrollado fue bastante importante, la pared demostró ser importante porque ahí pudieron colgar unos cuadritos bonitos, estoy haciendo el paralelo con mi pared, ¿correcto? ahora ustedes díganme dónde está el valor de mis conclusiones, las copias de las suyas, las conclusiones no deben ser solo “logramos” o “salvamos al mundo”, no se trata de eso, la conclusión es todo lo que puedan derivar de su experiencia durante el proyecto, hay muchas cosas donde cometieron errores que tuvieron que solventar, tal vez algo que tuvieron que rehacer porque salió mal y se dieron cuenta de que esa tecnología no era la mejor o la eligieron mal o no se percataron de algo que limitaba su uso, esas son conclusiones valiosas porque enseñan no solo a sus compañeros sino también a nosotros como profesores, esas conclusiones son muy chéveres y enriquecedoras",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      },
      {
        "text": "La forma de presentar es la misma observación que he hecho desde el día de ayer con los otros grupos: se ponen a leer y leer todos los objetivos; siento que hay que trabajar con cada uno de los grupos, los objetivos deben ser muy concretos, fijos y alcanzables, y las conclusiones deben ser muy concretas y sobre lo que se realizó, con el objetivo de que el próximo semestre tengamos mejores presentaciones.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Chicos, casi me infarto con el tema del tiempo porque, como dice la profesora, ustedes tienen que pensar muy bien lo que van a presentar; sinceramente, un poquito de razón a la profe Danith, pero ustedes tenían muchísimo que mostrar y no lo mostraron; yo esperaba que después viniera el video demostrativo de todo, para mostrar el DNS, porque fueron de los grupos que más cosas les funcionaron, pero ¿dónde está la evidencia de la conexión a la base de datos, del FTP transmitiendo, de la llamada de voz sobre IP? Les decía que incluso tengan material por debajo de la presentación para extraerlo si preguntan, pero no vinieron armados; aquí tienen que sacarle brillo a todo lo que funcionó, a la arquitectura, a lo que hicieron bien.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "Muchachos, como recomendación para todos los asistentes, dado que hay tanta dificultad con la construcción y elaboración de los objetivos, búsquense información sobre la metodología SMART para construir objetivos; son cinco tips que los llevan a formular un objetivo muy bien hecho, para que todos lo tengan en cuenta; muchas gracias, jóvenes.",
        "teacher": "ING JAVIER LIZARAZO",
        "image": "javier.jpg"
      }
    ]
  },
  {
    "id": 22,
    "title": "CENTRO DE BIOTECNOLOGÍA",
    "description": "BIOCONECTA S.A.S - Sistema Integrado de Gestión para el Parque Tecnológico Universitario (SIG-PTU)\n\nSituación Problema (Motivación):\nLa Universidad Pontificia Bolivariana (UPB) busca fomentar la innovación y el relacionamiento empresarial mediante la creación de un Parque Tecnológico Universitario (PTU), compuesto por múltiples centros de innovación y emprendimiento distribuidos geográficamente.\nEl desafío radicó en que cada centro necesitaba una solución tecnológica centralizada para:\n- Gestionar procesos internos.\n- Compartir información entre sedes.\n- Ofrecer servicios a estudiantes, investigadores, empresas y la comunidad externa.\n- Establecer una infraestructura de red segura, escalable y eficiente.\n\nObjetivo General:\nDiseñar, desarrollar e implementar una solución tecnológica integral (sistema de información e infraestructura de red segura y escalable) que permita al Centro de Biotecnología BIOCONECTA gestionar de manera eficiente sus proyectos, usuarios y servicios, garantizando la integración con la plataforma del PTU.\n\nObjetivos Específicos:\n- Analizar requerimientos funcionales y no funcionales.\n- Diseñar la arquitectura del sistema e interfaces intuitivas.\n- Desarrollar módulos del sistema utilizando metodologías ágiles.\n- Implementar la infraestructura de red LAN/WAN con servicios requeridos.\n- Validar la funcionalidad y cumplimiento normativo del sistema.\n\nAvance y Métricas (Medición por Sprints - Burn Down Chart US):\nMétrica, Sprint 1, Sprint 3\nPuntos comprometidos, 573, 1399\nPuntos alcanzados, 440, 1330\nHoras invertidas, 216, 303\n% Avance, 76.78%, 95.06%\n\nFuncionalidades del Sistema (Diagramas de Casos de Uso):\n- Usuario Anónimo: Ver página de inicio, consultar \"¿Quiénes Somos?\", ver información de servicios públicos, acceder a \"Únete a Bioconecta\", registrarse en la plataforma, iniciar sesión.\n- Administrador: Eliminar proyectos, asignar usuarios a proyectos, asignar tareas a usuarios, editar y eliminar tareas, ver estadísticas globales, generar reportes administrativos, cerrar sesión, crear tareas. (Solo administradores pueden realizar operaciones CRUD en proyectos y tareas).\n- Otras Funcionalidades: Crear, consultar, editar, eliminar usuarios y proyectos; registrar roles; gestionar información personal; ver proyectos asignados; consultar partes del proyecto; subir/descargar documentos; registrar horario laboral.\n\nDemostración:\nLa interfaz del sistema Bioconecta mostró una página de destino con un video presentativo y la opción \"Únete a Bioconecta\". También se mostró una sección de gestión de tareas donde el usuario puede \"Crear Nueva Tarea\" y \"Filtrar Tareas por Proyecto\".\n\nConclusiones:\n- Trabajo en Equipo: El grupo demostró liderazgo y comunicación constante, logrando la gestión y cumplimiento de la mayor parte del proyecto. Se evidenció falta de compromiso en algunos integrantes, lo que llevó a establecer un plan de seguimiento, promover espacios de retroalimentación y fomentar mayor participación.\n- Infraestructura: Se completó la mayor parte de la implementación prevista. Se garantizó el funcionamiento estable y el uso de HTTPS mediante cifrado SSL/TLS. Se usó un certificado temporal, ya que no fue posible adquirir un certificado SSL oficial para el entorno académico.\n- Resultado General: El proyecto logró completarse en un 86%, entregando un producto funcional que cumple con la mayoría de los objetivos. A pesar de desafíos técnicos y la deserción de un integrante, el equipo demostró compromiso, adaptabilidad y trabajo colaborativo, sentando una base sólida para futuras mejoras y optimizaciones.",
    "members": [
      "DIAZ CALDERON CAREN JULIETH",
      "LOPEZ PANESSO IVAN ANDRES",
      "HERNANDEZ REMOLINA JUAN SEBASTIAN",
      "ADARME GOMEZ KAREN LISSETH",
      "VARGAS MARTINEZ MIGUEL JOSE",
      "NEIRA RAMIREZ SEBASTIAN",
      "BARRAGAN SANCHEZ SILVIA JULIANA"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE BIOTECNOLOGÍA",
    "images": ["/centroBiotecnologia/1.jpg","/centroBiotecnologia/2.jpg","/centroBiotecnologia/3.jpg","/centroBiotecnologia/4.jpg","/centroBiotecnologia/5.jpg","/centroBiotecnologia/6.jpg","/centroBiotecnologia/7.jpg","/centroBiotecnologia/8.jpg","/centroBiotecnologia/9.jpg","/centroBiotecnologia/10.jpg","/centroBiotecnologia/11.jpg","/centroBiotecnologia/12.jpg","/centroBiotecnologia/13.jpg","/centroBiotecnologia/14.jpg","/centroBiotecnologia/15.jpg","/centroBiotecnologia/16.jpg","/centroBiotecnologia/17.jpg"
],
    "comments": [
      {
        "text": "Bueno, procedan con las mismas observaciones que hice al grupo anterior: en el objetivo general no deben usar tres verbos, solo definir la meta global; respecto a los diagramas de casos de uso, eso que muestran con curvas no corresponde al UML estándar, las flechas y sintaxis deben seguir lo que indica la norma, y además, ¿qué significa ese “usuario anónimo”? En cuanto al marco conceptual, están hablando mucho de HCP, DNS, HTTP, HTTPS, IP, enrutamiento, pero eso no sustituye la explicación del marco conceptual que se espera.",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "En el objetivo general, recuerden que aunque el proyecto implique realizar tres tareas diferentes, eso no significa que deban describirlas ahí; en el objetivo general se define la meta global del proyecto, y las tres tareas se detallan en los objetivos específicos, así que tengan eso en cuenta.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "No, eso ya es una falta técnica, mi compañero, pero no puede faltársela; sin embargo, el término creo que es más... jóvenes, acabamos de cambiar la guía de Scrum 2020, se acaba de actualizar, muy bien, quédense ahí, porque usted me lastimó, me volvió a mentir cuando me mostraba esas gráficas perfectas y me decía que factores externos no permitieron conseguir esas 10 historias que faltaban, en mi caso, cuando llueve me da pereza; ¿cuáles fueron los factores externos en su caso? ¿Y por qué no se gestionó? ¿Cómo lo gestionó? Entonces, esa gráfica no era tan descendente como parecía, me mentiste; ¿estás hablando del burndown chart? No, del burndown chart; bueno, te comento, no es control total, es compromiso de cada uno, porque las tareas no las hacen aquí porque yo no les refiero, tú haces parte de un equipo de Scrum y cada uno se comprometió a cumplirlas; siguiente: aló, me llamé yo mismo, eso fue lo que yo vi en la voz sobre IP, joven Vargas, defiéndase, yo vi, ustedes saben que pienso, y otro, lo veo sobre una máquina virtual interconectada con las demás, yo veo la máquina virtual desde aquí en el servidor, se puede evidenciar que te llamaste tú mismo —¡Aloh Kondorian!— Miguel se llamó a él mismo, pero a otro dispositivo; sí, exactamente, me refiero a otra sede, llamaste a los chicos de... ah bueno, entonces nos llamamos nosotros mismos; listo chicos, tengo todo el cuaderno lleno, pero después hablamos con un café porque lo que me quita el micrófono es el tiempo.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "Solamente quería hablar del objetivo general: vamos, porque tenemos que aprender de eso y semestre a semestre les decimos para que lo tengan en cuenta, pero nunca lo consideran; el objetivo general ustedes nos hablan de una etapa eficiente, segura y escalable, mencionan la seguridad, la integración con la plataforma, pero esas aseveraciones son muy peligrosas, porque especialmente si piensan en crear una empresa, quedan muy comprometidos, no pueden garantizar nada en esta vida, lo único garantizado es la economía común; además, es cierto lo que dice la profe Danith: si hubo liderazgo, no hubo Scrum, son mutuamente excluyentes, en Scrum no hay un líder, hay un Scrum Master y compromisos del equipo para hacer las tareas, nadie asigna ni impone tareas; quisieron destacar que alguien asumió un rol aparente, pero en ese framework no existe, y salvar el mundo en las conclusiones está muy pobre; muchísimas gracias, jóvenes.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      }
    ]
  },
  {
    "id": 23,
    "title": "CENTRO DE ENERGÍAS RENOVABLES",
    "description": "El proyecto Ecophos fue desarrollado para abordar la falta de acceso a información centralizada sobre los beneficios del Centro de Energías Renovables del PTU.\n\n1. Propósito y Objetivos\n\nProblema a Resolver: La necesidad de implementar una plataforma tecnológica que conecte a la comunidad con proveedores, promueva la educación ambiental y facilite el monitoreo del consumo energético para impulsar un desarrollo sostenible.\n\nObjetivo General: Gestionar la energía en el área metropolitana, promoviendo la innovación, la operatividad de las energías renovables y el cuidado del medio ambiente para un futuro sostenible.\n\nObjetivos Específicos:\n- Gestionar y mantener un sistema de información especializado en energía renovable bajo estándares de interoperabilidad y seguridad.\n- Ofrecer servicios de formación, asesoría y consultoría en tecnologías limpias.\n- Fomentar la colaboración interdisciplinaria para el desarrollo de soluciones tecnológicas en energías limpias (solar, eólica, biomasa, etc.).\n- Promover una cultura de innovación sostenible mediante la participación activa en proyectos e investigación.\n\n2. Marco de Trabajo y Avance\n\nEl proyecto se gestionó bajo la metodología SCRUM, en ciclos de 15 días por Sprint, realizando dos reuniones semanales de seguimiento (Dailys). El equipo demostró un 'nivel muy regular' en cuanto al compromiso con el marco SCRUM.\n\nAlcance Total: Se definieron 8 Épicas y 67 User Stories (US).\n\nAvance por Sprints:\n- Sprint 1: 582 puntos completados de 931 iniciales. Avance real: 62.46%.\n- Sprint 2: 708 puntos completados de 1,145 iniciales. Avance real: 61.87%.\n- Sprint 3: 1,114 puntos completados de 1,488 iniciales. Avance real: 74.87%.\n\nAvance General: De un total de 3,240 puntos, se completaron 2,440. El porcentaje de realización fue del 74%, quedando una Deuda del 26%.\n\n3. Arquitectura Técnica y Funcionalidad\n\nMarco Teórico: El desarrollo se basó en conceptos de Servicios de Red (MySQL, HTTPS), Infraestructura (VoIP, DHCP, DNS), Seguridad (HTTPS, Encriptación/Hash BCRYPT) y Arquitectura (Monorepo, Node.js, Back/Front).\n\nBase de Datos: Se implementó una estructura relacional detallada para gestionar Usuarios, Servicios, Reservas, Reportes y Feedback.\n\nFuncionalidad Clave (Plataforma Web): La plataforma permite la reserva de servicios. El proceso incluye autenticación del usuario, selección del servicio, consulta de disponibilidad (a través de un Módulo de Calendario), registro de la reserva y envío de un correo de confirmación.\n\nEl sistema también presenta una interfaz de Video funcionalidad Web y una funcionalidad de VoIP (Voice over IP) para comunicación.\n\n4. Conclusiones del Equipo\n\nEl equipo concluyó que la apertura fue fundamental para el desarrollo del proyecto. Este pilar de Scrum les permitió comunicarse con transparencia, expresar ideas y reconocer errores sin miedo, lo que fortaleció al equipo e impulsó la innovación, resultando en un trabajo más colaborativo y eficiente.",
    "members": [
      "TAPIAS FONSECA ANDERSSON JONEYDER",
      "SUAREZ SUAREZ CLAUDIA NATALIA",
      "GONZALEZ ANGULO IVAN MATEO",
      "ALMEIDA RINCON JOHAN SEBASTIAN",
      "VILLAMIZAR GOMEZ LEONEL DAVID",
      "ARENALES PEÑA RONALD EDUARDO"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE ENERGÍAS RENOVABLES",
    "images": ["/centroEnergias/1.jpg","/centroEnergias/2.jpg","/centroEnergias/3.jpg","/centroEnergias/4.jpg","/centroEnergias/5.jpg","/centroEnergias/6.jpg","/centroEnergias/7.jpg","/centroEnergias/8.jpg","/centroEnergias/9.jpg","/centroEnergias/10.jpg","/centroEnergias/11.jpg","/centroEnergias/12.jpg","/centroEnergias/13.jpg","/centroEnergias/14.jpg","/centroEnergias/15.jpg","/centroEnergias/16.jpg","/centroEnergias/17.jpg","/centroEnergias/18.jpg","/centroEnergias/19.jpg","/centroEnergias/20.jpg","/centroEnergias/21.jpg","/centroEnergias/22.jpg","/centroEnergias/23.jpg"],
    "comments": [
      {
        "text": "Voy a resumir la exposición como yo la entendí, porque la verdad, ya se los voy a decir por qué: Hola, mucho gusto, soy el ingeniero Jairo Briceño, ingeniero en sistemas e informática, y les vengo a implementar energías renovables y a gestionarlas, gracias, personal, y a ofrecerlas; ¿dónde vemos la energía renovable? Primero que todo, ojo porque en el objetivo me colocaste “gestionar energías renovables” o “desarrollar para la gestión de energías renovables”, o sea, vamos a gestionar tecnología, vamos a gestionar gerencia, ¿dónde se complementa esto con lo que ya ha venido hablando sus otros dos grupos? Ahora hablemos de que la página sea dinámica, vamos un momento al marco tecnológico: ¿desde cuándo Github es un entorno de desarrollo? O sea, yo abro Github y puedo empezar a hacer código, ¡uy, Dios mío! ¿Por qué me dicen Github? ¿Se ven en otros? Le escuché al compañero decir “es que hicimos integración pero no pudimos hacer la integración porque era…”, creo que era posible, pero ¿por qué no lo pudo conectar? O sea, no se entendió la lógica de la centralización, en pocas palabras, exacto; ¿y por qué? ¿Quién es el Scrum Master? Por favor, recuérdenme… sobre los valores; pero miremos de momento las gráficas referentes al Scrum, ¿el descenso a qué se debe?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Pon la diapositiva, porque si se le pasa a uno, los otros cinco están ahí atentos y listos.Gracias, joven Almeida. Otro compañero, por favor, que ya ha escuchado bastante al joven Almeida, necesito que me expliquen 1.488 puntos, por favor ayúdenlo, pongan dónde, también solamente por cuestiones de 1.482 puntos, el avance real; ¿cuál es el avance real?, había un avance virtual, un imaginario, como si fueran números complejos, no entendí; también se llamaron a ustedes mismos, no hubo integración con otra sede, no fue solamente Migue, hubieran llamado a Migue, que Migue tenía voz sobre IP; otra vez fue “aló” con Dorian; chicos, donde pone avance real, ahí por ejemplo, miren eso, ¿en serio? ¿Ustedes hicieron 1.114 puntos completados? Gracias. ¿Y el avance real qué es? ¿Hay uno imaginario o contractivo? ¿Qué es el avance real?, o sea, no sé, en la guía de Scrum no hay nada que diga el avance real.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "Sí, pero lo que se les dijo bastantes veces: no revuelvan los objetivos del proyecto con los objetivos del negocio que ustedes están poniendo en la página web; el objetivo del proyecto tiene que ver con el desarrollo del software de gestión, la implementación de la infraestructura y los objetivos del negocio, que es lo que va en la página web, con la visión, con la visión.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "Mateo, muchachos, buenas tardes, muchachos; Mateo, ya que está ahí, usted habló de… ¿por qué pasó como un poquito rápido? No logré comprender, porque mencionaba tener el documento JSON como redundancia, fue lo que entendí; mira, ahí Mateo me explicó algo, ¿me lo puede explicar de nuevo, por favor? ¿Y ese documento JSON cómo lo actualizaban? ¿Cuál era la estrategia? ¿El documento JSON se actualizaba por software o desde un disparador programado en la base de datos? Bien, yo le quiero hacer otra pregunta: por ahí hablaron de claves, pero primero acá decimos cifrado; vamos a hacer el adentro de eso, pero el problema que tengo con eso es que cuando algo se cifra, se puede descifrar, y lo que ustedes tienen allá es que están aplicando un resumen gráfico a una cadena para añadir una capa de seguridad, pero ustedes no están encriptando ni cifrando, están aplicando el resumen criptográfico; hay una gran diferencia, ¿ok? Es decir, el resumen criptográfico, ese algoritmo criptográfico, va a generar una cadena de la misma longitud siempre, sin importar la entrada ni cambios en la base de datos; muchas gracias.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      }
    ]
  },
  {
    "id": 24,
    "title": "CENTRO DE AGROINDUSTRIA INTELIGENTE",
    "description": "El proyecto del grupo es la creación de AgroTechNova, una plataforma web diseñada para optimizar la gestión y aumentar la producción en proyectos agroindustriales.\n\nObjetivo y Alcance:\nEl objetivo general es diseñar una solución digital que permita a productores, emprendedores, estudiantes y entidades agroindustriales administrar sus proyectos de forma eficaz, proporcionando herramientas tecnológicas, orientación y monitoreo constante para optimizar procesos y promover la sostenibilidad.\n\nLa pregunta problema que guía el proyecto es cómo aumentar el desempeño y la producción agroindustrial mediante herramientas tecnológicas de apoyo y asesoramiento. El alcance incluye el desarrollo de un sistema digital (SIG-PTU) para planificar, ejecutar y hacer seguimiento a proyectos, contando con módulos centralizados para la gestión de recursos, trazabilidad de procesos, generación de reportes y asesoría en línea.\n\nContexto y Desarrollo:\nAgroTechNova es una plataforma web que automatiza la gestión de recursos, inventarios, seguimiento de proveedores y generación de reportes. Fue desarrollado como parte del curso Proyecto Integrador 1 en la Universidad Pontificia Bolivariana (UPB), en colaboración con una compañía agroindustrial y seis empresas tecnológicas. El enfoque técnico se centró en el uso de código limpio y la implementación con tecnologías nativas.\n\nActores y Flujo de Trabajo:\nLos actores identificados son el Usuario (productor, emprendedor), el Administrador y el Proveedor.\n\nEl flujo de trabajo incluye:\n- Inicio de Sesión para los tres actores.\n- Registro de Proyecto por parte del Usuario o Administrador.\n- Asignación de Proveedor por parte del Administrador.\n- Subida de Documentos por el Usuario.\n- Finalización de Proyecto por el Administrador, con notificación a los demás actores.\n\nRequerimientos Funcionales:\nLos requerimientos clave se centran en la gestión de recursos: planificación de recursos por fase, control de presupuesto, asignación de proveedores, seguimiento y alertas de uso de recursos, generación de reportes (PDF/Excel) y control de inventario de productos.\n\nTecnología y Resultados:\nLa arquitectura utiliza Node.js, Express, HTML, CSS y JavaScript. La base de datos es SQLite/MySQL. En la infraestructura se demostró el uso de servicios como VoIP (Voice over IP) implementado con Asterisk.\n\nLa plataforma presentada en la interfaz de usuario se posiciona como el enlace entre productores y tecnología, prometiendo mejoras en productividad, costos y monitoreo. El sistema de gestión de proyectos incluye funciones para buscar, crear y pausar proyectos, además de módulos de gestión financiera, inventario y usuarios.\n\nEl proyecto se gestionó con Scrum, obteniendo una velocidad de equipo de 562 puntos/sprint, con 688 puntos asignados y 655 realizados en el Sprint 3.\n\nConclusión:\nEl equipo demostró que se puede construir un sistema funcional con Node.js puro y tecnologías nativas sin la obligación de usar frameworks, sentando una base sólida para el desarrollo continuo.",
    "members": [
      "VALERO QUEVEDO ALEXER MAURICIO",
      "QUIROGA CUBIDES DANIELA",
      "LAMUS RUIZ ELIAN CAMILO",
      "RODRIGUEZ CIFUENTES PAULA ANDREA",
      "ESPINEL ARANGO SERGIO ANDRES"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE AGROINDUSTRIA INTELIGENTE",
    "images": [
      "/centroAgroindustria/1.jpg","/centroAgroindustria/2.jpg","/centroAgroindustria/3.jpg","/centroAgroindustria/4.jpg","/centroAgroindustria/5.jpg","/centroAgroindustria/6.jpg","/centroAgroindustria/7.jpg","/centroAgroindustria/8.jpg","/centroAgroindustria/9.jpg","/centroAgroindustria/10.jpg","/centroAgroindustria/11.jpg","/centroAgroindustria/12.jpg","/centroAgroindustria/13.jpg","/centroAgroindustria/14.jpg","/centroAgroindustria/15.jpg","/centroAgroindustria/16.jpg","/centroAgroindustria/17.jpg","/centroAgroindustria/18.jpg","/centroAgroindustria/19.jpg"],
    "comments": [
      {
        "text": "Pero esta vez no creo que pregunte tanta evidencia; hay un buen trabajo, la página está muy bien, pero me gustaría saber en qué URL está la página; bueno, como comentario general, ya ustedes son el cuarto grupo que ha pasado, pero no me ha quedado claro el marco teórico en el sentido de que estamos hablando de DNS, HTTPS, DHCP, VoIP, entonces todavía no entiendo ese marco teórico porque ningún grupo me lo ha explicado; entonces, ¿pueden, por favor, explicarme esos detallitos?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Muchachos, yo opino igual que el profesor respecto a los resultados; tengan en cuenta que acá se está haciendo un ejercicio académico, no es algo personal; pero estábamos leyendo las conclusiones, lo lograron, lo logramos; hay una conclusión que se puede rescatar: ustedes sacan como conclusión que no es 100% necesario o obligatorio utilizar un framework, esa es buena; el resto sí lo salvaron; ahora, una pregunta concreta: respecto a que ustedes no se pudieron adaptar y entonces lo que hicieron fue adaptarse, recuerden que Scrum no se adapta, o se usa como es o se usa otra cosa; no podemos decir que adaptamos el framework; también raya con Scrum que se haya asignado responsabilidad, porque en Scrum no se asigna responsabilidad, sino que cada uno se compromete; de resto, muchachos, les felicito, buen trabajo, muchas gracias.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      }
    ]
  },
  {
    "id": 25,
    "title": "CENTRO DE ROBOTICA Y AUTOMATIZACIÓN",
    "description": "Proyecto/Empresa: J&C AUTOMATION & ROBOTICS\n\nPlanteamiento del Problema y Objetivos\nSituación Problema: En la actualidad, algunas empresas buscan mejorar sus procesos mediante la automatización y la robótica, pero se enfrentan a diversas dificultades para lograrlo. En algunos de los casos, no cuentan con personal especializado, carecen de una adecuada organización o desconocen los pasos necesarios para planificar e implementar este tipo de proyectos. Esta falta de orientación técnica y de gestión provoca retrasos, mayores costos operativos y una baja eficiencia en sus actividades.\n\nPregunta Problema: ¿Cómo pueden las empresas mejorar la gestión de sus proyectos de automatización y robótica para asegurar resultados en sus proyectos?\n\nObjetivo General: Desarrollar una plataforma web que permita la gestión integral de proyectos de automatización y robótica, incorporando servicios de seguimiento, control y asesoría virtual, con el objetivo de la organización y supervisión de dichos proyectos en distintos sectores.\n\nObjetivos Específicos:\n- Analizar los requerimientos funcionales y no funcionales del sistema.\n- Evaluar y documentar los resultados de los proyectos asesorados.\n- Diseñar la arquitectura y la interfaz de usuario de la plataforma web.\n- Desarrollar los módulos funcionales de la plataforma.\n- Implementar y evaluar la plataforma web completa durante el último mes del proyecto, realizando pruebas de funcionalidad, rendimiento y usabilidad para asegurar su correcto funcionamiento y cumplimiento de los objetivos propuestos.\n\nMarco de Trabajo y Tecnología\nMarco de Trabajo (Scrum):\n- Scrum Master: Samuel Castro\n- Product Owner: Erick Tamayo\n- Infraestructura: Iván Lastre\n- Frontend: Melany Mejía\n- Backend: Dilan Meneses\n- Frontend/Backend: Keynner Loaiza\n\nArquitectura (MVC Adaptado): Se presentó un diagrama de interacción entre Usuario, Vista, Controlador y Modelo.\n\nMarco Tecnológico:\n- Backend: Node.js, Express.js\n- Base de Datos: MySQL, mysql2\n- Seguridad: JWT, bcrypt, CORS\n- Desarrollo: NPM, dotenv, Nodemon\n- Frontend: Vanilla JS, CSS Puro, Feather Icons\n- Arquitectura: Monolítica (MVC Adaptado)\n\nFundamentación Teórica (Redes):\n- Subnetting\n- Protocolo UDP y TCP\n- Protocolo OSPF\n- IPV4 e IPV6\n- VLAN\n- Modelo OSI\n\nDiseño del Sistema y Funcionalidades\nDiagramas:\n- Diagramas de Casos de uso\n\nFunciones (Dashboard - Mis Tareas): Se presentó una interfaz con un menú lateral que incluye Dashboard, Proyectos, Tareas, Calendario, Servicios, Usuarios, Perfil, y las siguientes tareas mostradas con progreso:\n  - Diseño de Base de Datos\n  - Desarrollo del Frontend\n  - API de Autenticación\n  - Sistema de Reportes\n  - Análisis de Requerimientos\n  - Prototipo de Interfaz\n\nServicios:\n- VoIP: Se mostró una captura de pantalla de una llamada entrante, indicando un servicio de Voz sobre IP para asesoría virtual.\n\nResultados y Cumplimiento\n- Cumplimiento Sprint 1: Burn Down (Se mostró una gráfica de Burn Down que ilustra el progreso del trabajo realizado versus el trabajo restante en el Sprint 1).\n- Cumplimiento Sprint 3: Burn Down (Se mostró una gráfica de Burn Down que ilustra el progreso del trabajo realizado versus el trabajo restante en el Sprint 3).\n- Cumplimiento Total:\n  - Realizados: 91% (Gráfico circular en verde)\n  - No realizados: 9% (Gráfico circular en naranja)\n- Valores Numéricos:\n  - P. Comprometidos: 1,399.5\n  - P. Realizados: 1.26\n  - P. No realizados: 1395\n  - H. Invertidas: 1.713\n\nConclusiones\nConclusiones (Aprendizaje y Dificultades):\n- El desarrollo del proyecto permitió comprender los procesos y requerimientos necesarios para crear una plataforma de gestión de proyectos.\n- A lo largo del desarrollo de este proyecto logramos trabajar de manera organizada, sin embargo, se evidenció una falta de conocimiento para implementar diversos servicios y funcionalidades web, sobrecargando a integrantes encargados de ciertas tareas.\n- Pese a las limitaciones técnicas identificadas, el equipo mostró capacidad de adaptación y disposición para enfrentar los desafíos. La colaboración entre los integrantes permitió avanzar en la consolidación del proyecto, priorizando la calidad de los entregables y el cumplimiento de los objetivos establecidos.",
    "members": [
      "MENESES VEGA DILAN KALETH",
      "TAMAYO DIAZ ERICK EMANUEL",
      "LASTRE GUERRERO IVAN FELIPE",
      "LOAIZA AVILA KEYNNER ANDRES",
      "MEJIA NIÑO MELANY",
      "CASTRO RUIZ SAMUEL"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE ROBOTICA Y AUTOMATIZACIÓN",
    "images": ["/centroRobotica/1.jpg","/centroRobotica/2.jpg","/centroRobotica/3.jpg","/centroRobotica/4.jpg","/centroRobotica/5.jpg","/centroRobotica/6.jpg","/centroRobotica/7.jpg","/centroRobotica/8.jpg","/centroRobotica/9.jpg","/centroRobotica/10.jpg","/centroRobotica/11.jpg","/centroRobotica/12.jpg","/centroRobotica/13.jpg","/centroRobotica/14.jpg","/centroRobotica/15.jpg","/centroRobotica/16.jpg","/centroRobotica/17.jpg","/centroRobotica/18.jpg","/centroRobotica/19.jpg","/centroRobotica/20.jpg","/centroRobotica/21.jpg","/centroRobotica/22.jpg","/centroRobotica/23.jpg"],
    "comments": [
      {
        "text": "¿Cómo generaron el certificado SSL y qué dominio utilizaron? Me pareció ver algo que no cuadra; ¿ustedes hicieron la generación de SSL en un localhost? En términos de certificados eso no es posible, sería un certificado autofirmado; si se monta en producción así como está, ninguna entidad lo validaría; sin DNS y sin producción no se puede verificar; existen certificados autofirmados que permiten probarlo; además, mencionaron algo sobre base de datos espejo o centralizada local, explíquenme cómo funciona eso, si está en local o centralizada en algún lado.",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Yo creo entender que era autofirmado, pero lo que decimos es que no vemos el dominio, sino que tiene ese resuelto; eso es lo que queremos decir. Queremos que lo hubieras explicado así, ¿sabes? Autofirmado, ¿no? ¿Sí lo explico? Sí, claro, yo. Entonces, eso es lo que hay que decir allá: lo hicimos autofirmado, no estamos resolviendo el tema de eso, pero la idea es que estamos explicando, no para la web, sino en un dominio interno, y ahí va. Joven Tamayo, felicitaciones, gracias, joven Castro. A eso se refería, creo que, el profesor. Joven Tamayo, al barrio. Quiero felicitarlo porque tomó todas las observaciones, porque vi que hizo todos los servicios internos muy bien. Pero me pregunto, ¿qué pasó? ¿Por qué no se interconectó? Porque yo confío que usted hizo su trabajo. Y joven Tamayo, ¿qué pasó? Que no pudo llamar al joven Barca o no pudo llamar a los chicos anteriores. ¿Por qué se llamó a usted mismo, señor? Funcionando su voz sobre IP. Bueno, señor, hace dos semanas porque ese martes, ingeniera Sandra, yo le dejé toda la tarde de la clase de sistemas operativos. No, no, al joven Tamayo yo respondo por él, yo respondo por el joven Tamayo porque él trabajó muy juicioso. Muy bien, joven Tamayo. Me gustó, chicos, la página, pero se sentía como que era un prototipo funcional porque no veía arriba ni siquiera el HTTPS que me mostró Eliana y Paulita; viste que cortaron ese pedazo como con miedo a que yo no viera el DNS. ¿Ustedes serían capaces de hacer eso? Muy bien, chicos, me gustó de verdad, pero recuerden que lo que funcionó se resalta y lo que no se dice. Porque la vida, entre ustedes, yo lo vi trabajando, la vi funcional, pero pues si ustedes tenían algo y no podían llamar a los otros, de ahí se dice, ahí, cuando hablaste de eso y me mostraste eso: yo tenía lo mío a quién llamar.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      }
    ]
  },
  {
    "id": 26,
    "title": "CENTRO DE CIBERSEGURIDAD",
    "description": "Introducción y Problema\\nCyberIntegrity\\nSituación Problema: CyberIntegrity requiere integrarse al Parque Tecnológico Universitario (PTU), conformado por diversos centros con necesidades y niveles de madurez digital distintos.\\nPregunta Problematizadora: ¿Cómo, desde la Ingeniería de Sistemas e Informática, se puede integrar a CiberIntegrity para que continúe con su objetivo de gestionar la ciberseguridad y cumpla los requerimientos para incorporarse al PTU?\\nObjetivos y Metodología\\nObjetivo General: Proveer servicio de asesoría especializada en gestión en ciberseguridad a partir de la definición de políticas, protocolos y planes estratégicos de seguridad, orientando de esta forma a las organizaciones del PTU en la protección de sus sistemas y de sus datos e, igualmente, reducir los riesgos generados manteniendo la seguridad en la continuidad de las operaciones.\\nObjetivos Específicos:\\n- Realizar análisis de riesgos y vulnerabilidades con el fin de detectar la matriz de riesgos y establecer controles para mitigar el impacto de la materialización de las amenazas.\\n- Redactar políticas y protocolos que aclaren temas como el control de accesos, el manejo de datos o el uso responsable de los equipos.\\n- Recomendar soluciones de gestión apoyadas en herramientas del mercado.\\n- Realizar auditorías y reportes de gestión que permitan evaluar el estado de la seguridad, evidenciar avances y proponer mejoras continuas.\\n- Detectar y comprender los riesgos reales que pueden comprometer los sistemas de información.\\nMetodología de Trabajo: Se utilizó un enfoque iterativo, con los siguientes pasos clave:\\n1. Definición del problema y definición del alcance del Proyecto.\\n2. Generación de alternativas de problemas.\\n3. Definición de requerimientos del producto y modelación de la operación del producto.\\n4. Diseño de la arquitectura e implementación del producto.\\n5. Análisis de la información del producto.\\n6. Análisis de la información del proyecto.\\n7. Integración y Validación del producto.\\nProducto y Gestión del Proyecto\\nProducto: Se desarrolló una interfaz de inicio de sesión etiquetada como V0.1 FRONTEND CIBERINTEGRITY.\\nDiagramas:\\n- Diagrama Casos de Uso\\n- Diagrama de Paquetes\\nGestión del Proyecto (Sprint Burndown): Se presentaron gráficos de Burndown para los Sprint 2 y 3, mostrando la evolución del trabajo restante (puntos US - User Stories).\\nConclusiones\\nConclusiones Principales (Gestión y Ciberseguridad):\\n- CiberIntegrity ha desarrollado un Sistema Integral de Gestión en Ciberseguridad (SIG-PTU) para el Parque Tecnológico Universitario (PTU), con el objetivo de proteger los datos y garantizar la seguridad de los sistemas.\\n- Este sistema integra los siete centros de innovación del PTU, asegurando la prevención de ciberamenazas, la creación de políticas de seguridad y promoviendo una cultura digital sólida para un entorno interconectado y seguro.\\n- El equipo de CiberIntegrity utilizó la metodología de prototipado para el desarrollo del proyecto, lo que permitió la creación iterativa y constante mejora del sistema.\\n- El Product Owner se encargó de alinear las expectativas del cliente, mientras que el Scrum Master facilitó el proceso ágil y eliminó obstáculos. El equipo de desarrollo trabajó de manera colaborativa y eficiente, entregando un sistema funcional y seguro a través de un proceso iterativo de prototipos que garantizó la satisfacción de los requisitos del cliente.\\nConclusiones Técnicas (Infraestructura de Red):\\n- La infraestructura de red está completamente operativa, con los servicios de DNS y DHCP funcionando correctamente.\\n- Las configuraciones de las VLANs, las direcciones IP y los certificados HTTPS y FTPS están bien implementadas, asegurando la conectividad y el correcto funcionamiento de los servicios web y de transferencia segura de archivos.\\n- Los dispositivos reciben sus direcciones IP de manera dinámica y la conectividad entre los diferentes componentes de la red es eficiente y estable.",
    "members": [
      "AYALA MANTILLA ANDRES SANTIAGO",
      "PORRAS BARAJAS JAIRO ESTEBAN",
      "SORIA ROJAS JOSE DAVID",
      "RINCON CEDIEL JUAN DAVID"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE CIBERSEGURIDAD",
    "images": ["/centroCiberseguridad/1.jpg","/centroCiberseguridad/2.jpg","/centroCiberseguridad/3.jpg","/centroCiberseguridad/4.jpg","/centroCiberseguridad/5.jpg","/centroCiberseguridad/6.jpg","/centroCiberseguridad/7.jpg","/centroCiberseguridad/8.jpg","/centroCiberseguridad/9.jpg","/centroCiberseguridad/10.jpg","/centroCiberseguridad/11.jpg","/centroCiberseguridad/12.jpg","/centroCiberseguridad/13.jpg"],
    "comments": [
      {
        "text": "Porque no tienen la primera parte del primer sprint y parte del sprint 2; vale, listo, es que quiero hacer énfasis en eso porque efectivamente ellos desarrollaron todo un proyecto en un sprint y medio, para tener en cuenta eso, de pronto eso influye directamente en la cantidad de módulos desarrollados también, pero es de rescatar que empezaron prácticamente de cero, reciclando de un grupo anterior que se disoció y por eso se creó un nuevo centro, entonces, para tener también en cuenta eso; es contexto, es contexto. Muchas gracias.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "La ingeniera Sandra es muy generosa, yo no lo hubiera defendido tanto; chicos, háganme un favor, cuéntenme: estamos cansados, pero sin embargo… no, no, no, ahí me estás diciendo que es un prototipo funcional y una página web; es una página web, ¿dónde está desplegada, en local, cómo lo logró?",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "Yo quiero preguntar: en sus objetivos me hablaban de una política, ¿dónde está la política? ¿Y qué tipo de política es? Porque no lo especificaron. Redactar políticas y protocolos que aclaren temas como el control de acceso, manejo de datos o el uso responsable de los equipos, ¿dónde está esa política? ¿Y ahora, dónde está mi matriz de riesgos? Si no tienen matriz de riesgos, ¿cómo van a generar políticas y protocolos? Siguiente diapositiva, por favor: auditorías, ¿cómo las están realizando? Hablemos del chatbot: ¿qué tenían planeado y qué lograron desarrollar? ¿Cómo entrenan al chatbot? Entonces, ¿esto funciona como un bot interactivo o tiene alguna otra funcionalidad específica?",
        "teacher": "ING JOHN BRICEÑO",
        "image": "john.jpg"
      },
      {
        "text": "Ustedes mostraron un diagrama de paquetes, lo denominaron así, ¿pueden mostrarlo un segundo? Mi pregunta es: ¿qué querían expresar con ese diagrama? Bien, veo que hay interfaz, formularios, ventanas de chat; luego veo usuarios y roles; luego chatbot, que es software; interface y servicios, como gestor de redes y servicio chatbot; y finalmente seguridad, red y servidor, que es infraestructura. Aquí hay que aprender a separar claramente la arquitectura del software de la infraestructura. Si querían expresarlo mejor, les recomiendo usar componentes y despliegue en UML: los cubitos tridimensionales representan dispositivos donde corren los componentes del software, mostrando las relaciones y dejando claro qué es arquitectura del sistema y qué es infraestructura. Entiendo que lo hicieron como pudieron, pero esta sería la forma más clara; de todas maneras, están en su proceso de aprendizaje.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      }
    ]
  },
  {
    "id": 27,
    "title": "CENTRO DE SOLUCIONES SMART CITIES",
    "description": "No se presentaron.",
    "members": [
      "FERRUCHO CRISTANCHO ALEX SANTIAGO",
      "CONTRERAS SANCHEZ SERGIO ISMAEL"
    ],
    "date": "2025-10-29",
    "teacher": "SANDRA PILAR REYES HERNANDEZ",
    "course": "PROYECTO INTEGRADOR I",
    "project": "CENTRO DE SOLUCIONES SMART CITIES",
    "images": ["/centroSmartCities/1.jpg"],
    "comments": []
  },
  {
    "id": 28,
    "title": "ImgK",
    "description": "Identificador de calorías por imágenes.",
    "members": ["DELGADO PINTO SARA ALEJANDRA"],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "INTRODUCCIÓN A INGENIERÍA DE SISTEMAS E INFORMÁTICA",
    "project": "ImgK",
    "images": ["/imgk/1.jpg"],
    "comments": []
  },
  {
    "id": 29,
    "title": "ECO UPB",
    "description": "El equipo ecoUpb diseñó y propuso una aplicación móvil educativa para promover la conciencia ambiental y el reciclaje.\n\nEl proyecto se enfocó en:\n\n- Crear una herramienta tecnológica interactiva (la app) para facilitar el aprendizaje sobre sostenibilidad.\n\n- Incentivar a la comunidad a adoptar prácticas que ayuden a reducir la contaminación.\n\n- Apoyar los Objetivos de Desarrollo Sostenible (ODS) a través de la formación de ciudadanos responsables y ecológicos."
,
    "members": [
      "CASTELLANOS GARCIA JOSE GABRIEL",
      "QUINTERO ALVARADO ANDRES SEBASTIAN",
      "QUINTERO LLANOS ANDRÉS FERNANDO",
      "VESGA DURAN DAVID SANTIAGO"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "INTRODUCCIÓN A INGENIERÍA DE SISTEMAS E INFORMÁTICA",
    "project": "ECO UPB",
    "images": ["/ecoUpb/1.jpg","/ecoUpb/2.jpg"],
    "comments": [
      {
        "text": "¿Lograron solucionar el problema de la falta de su compañero en la presentación? ¿Pudieron cubrir todo o faltó algo? Perfecto, esa es justamente mi observación: los felicito porque como equipo y como personas responsables, cada uno asumió lo que le correspondía; eso es buscar una solución y es de resaltar. Espero que mantengan esa actitud durante toda la carrera, pero también hay que reflexionar: si un compañero no trabaja, lo primero es reconocerlo, porque si no viene la representación, que es lo más importante, no significa que uno deba cargar con él en todas las asignaturas.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Buena participación, chicos. Buen trabajo. Recomendación para la presentación: cuenten mejor la historia de cómo funciona la aplicación; ustedes usaron solo las pantallas, así que para próximas oportunidades háganlo más fluido. Si vieron las presentaciones del día anterior, los compañeros ponían el video y explicaban lo que hacía la aplicación; el video es sin voz y ellos narran lo que está sucediendo. Además, me faltó escuchar a uno de los integrantes aquí presente; Wilson, para la próxima quiero escucharte también presentar. Felicitaciones.",
        "teacher": "ING JAVIER LIZARAZO",
        "image": "javier.jpg"
      },
      {
        "text": "Bueno, muchachos, muchas gracias. Los felicito por su trabajo; evidentemente me han ayudado con la publicación de mis compañeros y también con otra versión adicional, creo que es la versión en inglés, que me enviaron de la presentación. El joven Quintero me sorprendió un poco, sin embargo, está bien. ¿Qué puedo decirles? Considerando la preparación y todo lo que hicimos anteriormente, aunque a veces falta confianza frente al auditorio, lo hicieron bastante bien. Cada uno tenía un rol y fueron capaces de suplirse entre ustedes, de modo que no se notó la ausencia de compañeras. Así que felicito a todos.",
        "teacher": "ING OMAR",
        "image": "omar.jpg"
      }
    ]
  },
  {
    "id": 30,
    "title": "UPB Study+",
    "description": "El proyecto UPB STUDY + se desarrolló con el objetivo de fortalecer la integración académica y social entre estudiantes y docentes de la Universidad Pontificia Bolivariana mediante una aplicación móvil interactiva. La situación problema identificada fue que los jóvenes utilizan principalmente redes sociales de entretenimiento, mientras que las plataformas institucionales existentes son limitadas y poco atractivas, generando falta de interacción académica y sentido de comunidad.\n\nEl objetivo general fue crear una aplicación que integrara un espacio social para compartir experiencias y fortalecer la comunidad, y un espacio académico para resolver dudas, apoyar el aprendizaje colaborativo y mejorar la comunicación entre docentes y estudiantes.\n\nEntre los objetivos específicos se incluyeron: analizar necesidades comunicativas y académicas para definir requerimientos funcionales, diseñar la interfaz de interacción social y académica, implementar un registro personalizado por semestre y carrera, y ofrecer funcionalidades en la Zona Social (nueva publicación, publicaciones recientes) y en la Zona Académica (panel académico con información clasificada por carrera).\n\nSe espera que la app promueva el aprendizaje colaborativo, fomente la educación participativa y dinámica, reduzca la dependencia de herramientas externas, cree un espacio constante de comunicación y motiven la participación activa de la comunidad universitaria.",
    "members": [
      "GARCIA RINCON JULIAN CAMILO",
      "PARRA AFANADOR ANGELA DANIELA",
      "SALGUERO LANDINEZ SAREY NALIETH",
      "SUAREZ HENAO JESUS DAVID",
      "SUAREZ MARTINEZ IVANNA GISELL",
      "SUAREZ SANCHEZ JADER ALDREY"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "INTRODUCCIÓN A INGENIERÍA DE SISTEMAS E INFORMÁTICA",
    "project": "UPB Study+",
    "images": ["/upbStudy/1.jpg","/upbStudy/2.jpg","/upbStudy/3.jpg","/upbStudy/4.jpg","/upbStudy/5.jpg","/upbStudy/6.jpg","/upbStudy/7.jpg","/upbStudy/8.jpg","/upbStudy/9.jpg","/upbStudy/10.jpg","/upbStudy/11.jpg","/upbStudy/12.jpg"],
    "comments": [
      {
        "text": "¿Por qué el marco legal? Por ahora está bien, pero entonces es necesario citarlos en esos requerimientos que necesitamos para nuestras actividades. ¿Ya pasó? ¿Ya pasó? Ya estamos en el camino de velar todo el proceso que debemos hacer para realmente tener una aplicación de este tipo. Muy bien, muy bien, muy buen comienzo. Muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "Bueno chicos, buenos días. Felicitaciones, muy buen trabajo, muy buen diseño. Gracias.",
        "teacher": "ING FRANCISCO MOLINA",
        "image": "cisco.jpg"
      },
      {
        "text": "Chicos, quiero resaltar algo adicional que me gustó mucho: la forma en que hicieron el video, tomándose el tiempo de hacer la animación y el guion; esa parte es un plus, realmente fue un ejemplo para nosotros. Lástima que los otros no hayan venido para verlo, porque realmente le pusieron calidad a su presentación. Felicitaciones, muchas gracias.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "Bueno, por mi parte me uno a la felicitación; esto no es más que el comienzo, como dice el profesor, para que puedan soñar, innovar, equivocarse y, más adelante, durante toda su carrera, tengan la oportunidad de desarrollar aplicaciones profesionales. Qué mejor que iniciar en este momento. Sé que les dio nervios y estuvieron un poco asustados, pero se desenvuelven muy bien en clase; uno se sorprende con la actitud y la forma en que presentan. Se notó algo de nerviosismo, pero dieron el primer paso: presentarse ante un público. La siguiente vez lo harán con un mejor desenvolvimiento, y si siguen practicando, al final de la carrera tendrán la capacidad de proyectar ideas con calidad, manteniendo ese sello y distinción en sus presentaciones. Muchas gracias a ustedes.",
        "teacher": "ING OMAR",
        "image": "omar.jpg"
      },
      {
        "text": "Felicitaciones, han hecho un muy buen trabajo. Se nota que han estado aplicando todo lo aprendido durante el semestre. Están empezando y arrancando el proceso; en clase también van creciendo y construyendo el profesional del futuro a partir de las personas de hoy. Sigan adelante con su participación y dinámicas de clase, como lo hace el profesor Omar. Y recuerden siempre: sin miedo al éxito, como dice la profesora Danith, por derecho de autor y por derecho de todos. Aquí no se trata de golpes ni maltrato; a medida que crecen, los consejos y críticas se vuelven más fuertes. Apropiénselos y sigan aplicándolos. Gracias.",
        "teacher": "ING JAVIER LIZARAZO",
        "image": "javier.jpg"
      },
      {
        "text": "Entonces, tienen que entender que las responsabilidades no recaen únicamente en una persona, sino en todo el grupo. En una empresa, si un proyecto no avanza, además de los que no cumplieron, se refleja sobre todo el equipo. Por eso, siempre es fundamental mantener el respeto, tanto hacia los estudiantes y compañeros, como hacia nosotros.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      }
    ]
  },
  {
    "id": 31,
    "title": "Pet Finder",
    "description": "El proyecto Petfinder se centra en el desarrollo de una aplicación móvil que utiliza inteligencia artificial (IA) y reconocimiento de imágenes para identificar y contribuir a la recuperación de mascotas perdidas o encontradas, promoviendo la colaboración ciudadana. La situación problema identificada es que los métodos tradicionales de búsqueda de mascotas (redes sociales, carteles) son poco eficientes y dependen del azar, y existe una carencia de aplicaciones que integren IA y geolocalización para este fin.\n\nEl objetivo general fue crear una aplicación que permita identificar mascotas perdidas o encontradas mediante IA, facilitando su localización y promoviendo la colaboración en la búsqueda y rescate.\n\nSe utilizó Teachable Machine de Google para entrenar un modelo de IA sin conocimientos avanzados de programación, clasificando imágenes en 'Perdida' y 'Encontrada'. La aplicación fue desarrollada con MIT App Inventor, integrando el modelo entrenado en formato TensorFlow Lite.\n\nEl flujo de la app incluye la subida de una imagen por parte del usuario, el análisis por el modelo, la predicción de estado y la búsqueda de coincidencias en la base de datos. Si existe coincidencia, se muestra la información del dueño; si no, se permite registrar la nueva mascota con geolocalización.\n\nLa interfaz permite tomar o cargar fotografías, recibir la predicción del modelo, registrar información adicional y visualizar reportes en un mapa.\n\nLas conclusiones destacan que el uso de IA y geolocalización facilita la recuperación de mascotas, que Teachable Machine es eficaz para entrenar modelos sin programación avanzada, y que el proyecto promueve la colaboración responsable y conciencia sobre el cuidado animal.",
    "members": [
      "JAIMES MEDINA ALEX SANTIAGO",
      "OCHOA QUIROZ ANDRES FELIPE",
      "OSPINA CAPACHO JAVIER ALBERTO",
      "VERA ROJAS JUAN DAVID"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "INTRODUCCIÓN A INGENIERÍA DE SISTEMAS E INFORMÁTICA",
    "project": "Pet Finder",
    "images": ["/petFinder/1.jpg","/petFinder/2.jpg","/petFinder/3.jpg","/petFinder/4.jpg","/petFinder/5.jpg","/petFinder/6.jpg","/petFinder/7.jpg","/petFinder/8.jpg","/petFinder/9.jpg","/petFinder/10.jpg","/petFinder/11.jpg","/petFinder/12.jpg"],
    "comments": [
      {
        "text": "Hola, buenos días, muchachos. ¿Cómo están? Muy bien, muy chévere. Quiero decirles unas cositas. Por favor, pongan el objetivo general. Gracias. Compañeros del público, ustedes no pueden escribir esos objetivos. Muy bien, buen trabajo en esos objetivos. Gracias. Fuera del chiste, está bien escrito, tiene lo mínimo que se necesita. Lo importante es que el objetivo es tu contrato, es lo que van a cumplir. El problema es cumplir lo que dicen. Está bien escrito, pero de ahí a que esté hecho, es un camino muy largo. Otra recomendación: el momento del video de la aplicación. Me van a escuchar decirlo toda la vida. Esos 15 minuticos que tienen son sus 15 minutos de gloria. Si ustedes no venden su producto, nadie lo hará por ustedes. Entonces, al poner el video, hay que ponerle emoción, ganas y mostrar con orgullo su producto. El video se ve bien, pero la presentación está apagada. Si no transmiten eso, da la idea de que hicieron una presentación aburrida. Si hacen otra presentación, comunican lo que está pasando y la tienen ensayada, saldrá espectacular. Esa es una recomendación que siempre les doy. Muchas gracias. Adelante, compañeros.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "Y complementando un poquito lo que dice el profesor, a ver si nosotros nos menospreciamos porque decimos: “hicimos esta cosita, esta aplicación, simplemente esto tan sencillo”. Y ustedes ven, por ejemplo, gente de otras carreras que hace un Excel y dicen que eso es maravilloso, que eso es buenísimo, y todo el mundo les dice que eso es excelente. Y nosotros, que somos los que trabajamos duro, nos echamos para atrás y nos subestimamos a nosotros mismos. Entonces, ahí les dejo eso.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Importante es cumplir con los tiempos; cuando los profesores les dicen: “bueno, la entrega son estas fechas”, así tengan ustedes una semana para hacer una presentación, esa semana de más es para hacer correcciones y ajustes. Entonces, a medida que uno va adentrándose en los deadlines, surgen improvisaciones que pueden aparecer en estos momentos, pero lo sacaron bien. Hay que darle gracias también al profesor Javier, porque gran parte de los ejercicios que hicieron tienen que ver con metodología de investigación; hay que darle mérito por eso, ya que les está enseñando, por ejemplo, en el marco legal que estaban haciendo los otros grupos, que evidentemente no lo querían sacar porque era metodología de investigación, y eso es claramente importante. Cuando dijeron “sin necesidad de programar”, hubo alguien que programó para poder hacer ese bloque y desarrollar la lógica que ustedes hicieron; de hecho, la lógica de hacer el algoritmo puede llegar a ser mucho más costosa que la codificación. Entonces, las ideas y cómo llevarlas a un algoritmo es muchísimo más complejo, y eso vale dinero. Por eso, agradecerles su tiempo, su disposición y las ganas de querer hacer el trabajo, y como dice el profesor Lenín, a meterle ganas. Muchas gracias.",
        "teacher": "ING OMAR",
        "image": "omar.jpg"
      }
    ]
  },
  {
    "id": 32,
    "title": "UPB Señas",
    "description": "El proyecto desarrollado por el equipo consistió en una aplicación móvil para el reconocimiento del alfabeto en lenguaje de señas mediante inteligencia artificial.\n\nProblema: La comunicación entre personas oyentes y sordas es limitada por el poco conocimiento del lenguaje de señas y la ausencia de herramientas inclusivas en la comunidad universitaria.\n\nObjetivo General: Desarrollar una aplicación móvil que reconozca el alfabeto en lenguaje de señas mediante inteligencia artificial, facilitando la comunicación inclusiva y el aprendizaje del sistema de señas.\n\nObjetivos Específicos:\n- Entrenar un modelo de IA con imágenes de letras A-Z.\n- Diseñar una interfaz funcional en MIT App Inventor.\n- Integrar el modelo en MIT App Inventor.\n- Validar la precisión y desempeño del sistema.\n\nMetodología: Se entrenó el modelo de IA con Teachable Machine, se exportó mediante TensorFlow.js e integró en MIT App Inventor para su uso en tiempo real.\n\nImpacto Esperado:\n- Promover la inclusión y accesibilidad comunicativa.\n- Acercar a estudiantes y docentes al lenguaje de señas.\n- Fortalecer competencias tecnológicas en futuros ingenieros.\n- Posicionar a la UPB como institución innovadora y socialmente comprometida.\n\nConclusiones: El proyecto demuestra el potencial de la IA en soluciones inclusivas, fortalece el aprendizaje práctico en Ingeniería de Sistemas, fomenta la empatía y responsabilidad social, y representa un primer paso hacia un traductor de lenguaje de señas más completo.",
    "members": [
      "RODRIGUEZ GARCIA JUAN SEBASTIAN",
      "SANTA MARIN DAVID ANDRES",
      "SARAVIA GARCIA JESUS MANUEL ALEXANDER",
      "VARGAS PRADILLA NICOLAS"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "INTRODUCCIÓN A INGENIERÍA DE SISTEMAS E INFORMÁTICA",
    "project": "UPB Señas",
    "images": ["/upbSenas/1.jpg","/upbSenas/2.jpg","/upbSenas/3.jpg","/upbSenas/4.jpg","/upbSenas/5.jpg","/upbSenas/6.jpg","/upbSenas/7.jpg","/upbSenas/8.jpg","/upbSenas/9.jpg","/upbSenas/10.jpg"],
    "comments": [
      {
        "text": "Yo les tengo una recomendación y creo que va para todo el auditorio. No sé si ustedes son tiktokers y aprenden mucho con TikTok; en ese caso, sigan a la profe Mónica, que es tiktoker y da tips sobre formas de hablar. A veces los estudiantes dicen “más sin embargo…” y repiten lo mismo una y otra vez. Por eso, hay que practicar mucho. Lo digo porque también tengo un hijo joven, y hablan como los tiktokers, repitiendo palabras iguales. Mi recomendación es mejorar el español, porque muchas veces nos preocupamos por el inglés, pero descuidamos cómo nos expresamos en nuestro idioma. La forma de expresarse es muy importante. Los felicito por el trabajo, me parece que estuvo muy bien. Y cuando presentan el código gráfico, recuerden: es código, eso es programar.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "Quiero saber de dónde nace la idea, porque había un estudiante que veía las limitaciones que tenía para acceder a la educación, ya que necesitaba un intérprete de una universidad directamente, y dijeron que no. Ahora, con más leyes y el tema de la inclusión, para mí todavía se sigue creando en diapositivas; me doy cuenta, a pesar de que acabo de terminar un diplomado, que es difícil. Por ejemplo, ¿cuánto vale, si tuviera una persona aquí con discapacidad, tener un traductor allá? Ponerse en su posición. Entonces me gusta que tenga esas cosas ocultas, pero quiero saber de dónde son. Ah, qué bien. Gracias, gracias. Qué bonito.",
        "teacher": "ING DANITH SORLOZANO",
        "image": "danith.jpg"
      },
      {
        "text": "Qué buena pregunta, porque este tipo de respuestas nos invita mucho también a reflexionar sobre de dónde nace la inspiración. Y hablando de inspiración, chicos, ¿estas son de esas ideas que uno dice: “Oye, puede empezar el primer semestre con este prototipo y terminar con un proyecto de grado ya más funcional y con más lenguaje, no solamente el alfabeto”? Bien, porque desde el objetivo delimitaron el alcance con el abecedario. Eso fue clave para que nadie se confundiera, porque cuando empezaron ellos dijeron: “Los quiero ver, las señas no son las mismas en todos los países, en todos los idiomas. ¿Cómo van a hacer eso?” Pero empezando con el alfabeto está súper. No dejen la idea atrás. Todos los semestres es una invitación: madúrenla y llévenla un poquito más adelante. Quizás después, cuando ya estén en los proyectos integradores, tengan un producto más maduro y finalmente puedan, de pronto, graduarse con una aplicación muy funcional y en tiempo real. No la dejen ahí.",
        "teacher": "ING SANDRA REYES",
        "image": "sandra.jpg"
      },
      {
        "text": "Sí, chicos, ¿pueden devolverse a las conclusiones, por favor? La primera conclusión que colocaron dice: “El proyecto demuestra el potencial en soluciones inclusivas”; ¿fue la IA o fueron ustedes los que plantearon eso? Correcto, tal como la pregunta que hizo la profesora Danith y la afirmación de la profesora Sandra, no es la guía, son ustedes los que tienen esa visión de poder dar esa solución inclusiva; la guía, el teacher goal machine, un lenguaje de programación y lo que aprenden aquí en la universidad son herramientas que van a potenciar lo que ustedes pueden hacer para brindar esas soluciones inclusivas; eso es importante, no es la IA la que hace la solución, la IA es una herramienta, ustedes la utilizaron para empezar a orientar la solución inclusiva; la IA sola no hace nada, es bruta, no sabe ni entiende, si ustedes no le indican cómo tiene que actuar, no va a hacer nada, ténganlo en cuenta; por eso hago énfasis en esta conclusión: no fue la IA la que dio la solución, fueron ustedes los que empezaron a construirla; si siguen siendo consecuentes con lo que les dice la profesora Sandra, irán desarrollando soluciones iniciales a lo largo de su carrera en las diferentes etapas de su desarrollo profesional; los felicito por el trabajo realizado, se nota que le han puesto ganas y espero que sigan así; como siempre, les queda la oportunidad de participar en las siete sesiones de socialización de proyectos integradores, así que esperamos verlos allí presentando algún proyecto muy interesante; gracias.",
        "teacher": "ING JAVIER LIZARAZO",
        "image": "javier.jpg"
      },
      {
        "text": "Bueno chicos, yo por mi parte agradecerles su trabajo y evidentemente me uno a la felicitación de los profesores, también agradecer a todos los profesores que fueron parte del primer semestre y que colaboraron, ya que de alguna forma parte de este trabajo es fruto del esfuerzo de ellos y sus contribuciones; creo que esta es la presentación final de esta sección, les agradezco a todos los chicos del primer semestre y, si nos hacemos la foto que van a tomar, será la primera que luego, al terminar su carrera, recordarán; fue su primer proyecto integrador y el primero de muchos, les deseo muchos éxitos a todos, gracias.",
        "teacher": "ING OMAR",
        "image": "omar.jpg"
      }
    ]
  },
  {
    "id": 33,
    "title": "ElectroMed",
    "description": "El proyecto, llamado ElectroMed, es un \"Sistema para el Monitoreo de Electrolitos en Áreas Críticas Hospitalarias\".\n\nProblema Identificado:\nEl monitoreo de electrolitos en áreas críticas de hospitales en Colombia a menudo presenta errores y demoras debido a registros manuales y baja conectividad, lo que afecta la calidad y seguridad del cuidado.\n\nSolución y Objetivo General:\nElectroMed busca resolver esto diseñando e implementando un sistema integrado compuesto por una aplicación móvil y una bitácora clínica web. Este sistema se utiliza para el registro, monitoreo y análisis de los niveles de electrolitos en pacientes hospitalarios en Colombia, con el fin de apoyar la toma de decisiones médicas oportunas y mejorar la atención en áreas críticas.\n\nObjetivos Específicos y Componentes Clave:\n- Diseño de Arquitectura y Base de Datos: Crear un modelo que permita el almacenamiento integral y accesible de la información clínica, aplicando buenas prácticas de protección de datos.\n- Implementación de Sincronización Híbrida: Un sistema que permita el funcionamiento en línea y fuera de línea (offline-first), garantizando la conservación y actualización segura de los datos, incluso con conectividad limitada.\n- Desarrollo de la Aplicación y Plataforma Web: Crear la aplicación móvil y la plataforma web para el registro y consulta de datos clínicos, integrando módulos de visualización de tendencias y alertas ante posibles desequilibrios.\n- Validación del Sistema: Validar el sistema mediante pruebas unitarias y de aceptación.\n\nMarco Conceptual:\nEl proyecto se basa en conceptos de Electrolitos, Monitoreo Clínico, Sistemas de Información en Salud, Aplicación Móvil en Entornos Clínicos, Sincronización Híbrida (Offline-First) y Arquitectura Cliente-Servidor.\n\nTecnología:\nSe evidencia el desarrollo de una APP Web para el registro de pacientes y una APP Móvil que muestra un Panel Clínico con los niveles de electrolitos (Sodio - Na⁺, Potasio - K⁺, Calcio - Ca²⁺, Magnesio - Mg²⁺) e indicadores de alerta (normal, alto, bajo).\n\nMetodología:\nEl proyecto utilizó la metodología Scrum para su desarrollo, con roles definidos (Scrum Máster, Product Owner y Developers).\n\nConclusiones:\nElectroMed logró integrar efectivamente una aplicación móvil y web para optimizar el monitoreo de electrolitos.\n\nSe utilizaron herramientas modernas, buenas prácticas de seguridad y un mecanismo de sincronización híbrida para garantizar la disponibilidad, integridad y confiabilidad de la información clínica, incluso en entornos con conectividad limitada.\n\nEl uso de metodologías ágiles (Scrum) favoreció un desarrollo ordenado, colaborativo y eficiente.\n\nElectroMed representa un avance tecnológico significativo que promueve la digitalización de procesos clínicos, mejora la toma de decisiones médicas y aporta valor al sistema de salud.",
    "members": [
      "ABELLO JIMENEZ MARIA JOSE",
      "AFANADOR CARRASCAL ANA GABRIELA",
      "JAIMES CALA ROGGER SANTIAGO",
      "MONTAÑEZ VALENZUELA ALEX DANIEL",
      "REY VASQUEZ JUAN NICOLAS",
      "TABARES PELAEZ JUAN FELIPE"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "PROYECTO INTEGRADOR III",
    "project": "ElectroMed",
    "images": ["/electromed/1.jpg","/electromed/2.jpg","/electromed/3.jpg","/electromed/4.jpg","/electromed/5.jpg","/electromed/6.jpg","/electromed/7.jpg","/electromed/8.jpg","/electromed/9.jpg","/electromed/10.jpg","/electromed/11.jpg","/electromed/12.jpg","/electromed/13.jpg","/electromed/14.jpg","/electromed/15.jpg","/electromed/16.jpg","/electromed/17.jpg","/electromed/18.jpg"],
    "comments": [
      {
        "text": "",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 34,
    "title": "BlessHealth24/7",
    "description": "BlessHealth24/7\n\nProblema a Resolver:\nLa gestión médica distribuida en múltiples sedes genera dificultades en la gestión de citas, manejo de historias clínicas y compra de medicamentos, causando demoras, errores administrativos, trámites repetidos y poca conexión entre sedes.\n\nPregunta Problema:\n¿Cómo puede el centro médico BlessHealth24/7 centralizar la gestión de historias clínicas y citas médicas, además de la distribución de medicamentos, mediante una aplicación móvil?\n\nObjetivo General:\nDesarrollar una aplicación móvil que permita gestionar citas médicas, compra de medicamentos y organización de historias clínicas, integrar funciones de agendamiento y procesamiento de documentos clínicos mediante NLP, y generar recomendaciones médicas a través de un chatbot para el personal autorizado.\n\nObjetivos Específicos:\n- Identificar requerimientos funcionales y no funcionales del sistema distribuido.\n- Estructurar la arquitectura del sistema mediante sistemas de clases y bases de datos, utilizando interfaces y protocolos de comunicación.\n- Desarrollar la estructura funcional del sistema (backend con GraphQL/NestJS y GUI con Flutter), integrando módulos y usando mejores prácticas.\n- Integrar NLP para el análisis, clasificación y extracción de datos clínicos (síntomas, diagnósticos, antecedentes médicos, etc.) de documentos clínicos.\n\nTecnologías y Metodología:\n- Backend: GraphQL/NestJS.\n- Frontend/Mobile: Flutter.\n- NLP: Python, con normalización textual y vocabularios especializados.\n- Metodología: Prototipado (Definición de especificaciones, Desarrollo, Entrega de Prototipo, Auditoría y Seguimiento).\n\nConclusiones Clave:\n- Hubo un reto en mantener un ritmo constante y en la gestión del estrés.\n- Se corrigieron inconsistencias en los requerimientos y falta de alineación con las expectativas del cliente mejorando la documentación.\n- La implementación del módulo NLP presentó dificultades por la variedad de formatos y terminología en los documentos, solucionadas mediante normalización textual y vocabularios especializados, mejorando la exactitud del sistema.",
    "members": [
      "CHAVEZ KING JULIANA",
      "MANOSALVA ACEROS SANTOS ENMANUEL",
      "MESA PUERTO SERGIO DAVID",
      "MUÑOZ ROJAS JUAN DAVID",
      "NIÑO ARENAS DAVID SANTIAGO"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "PROYECTO INTEGRADOR III",
    "project": "BlessHealth24/7",
    "images": ["/blesshealth/1.jpg","/blesshealth/2.jpg","/blesshealth/3.jpg","/blesshealth/4.jpg","/blesshealth/5.jpg","/blesshealth/6.jpg","/blesshealth/7.jpg","/blesshealth/8.jpg","/blesshealth/9.jpg","/blesshealth/10.jpg","/blesshealth/11.jpg","/blesshealth/12.jpg","/blesshealth/13.jpg","/blesshealth/14.jpg","/blesshealth/15.jpg","/blesshealth/16.jpg","/blesshealth/17.jpg","/blesshealth/18.jpg","/blesshealth/19.jpg","/blesshealth/20.jpg","/blesshealth/21.jpg","/blesshealth/22.jpg","/blesshealth/23.jpg","/blesshealth/24.jpg","/blesshealth/25.jpg","/blesshealth/26.jpg","/blesshealth/27.jpg","/blesshealth/28.jpg","/blesshealth/29.jpg","/blesshealth/30.jpg","/blesshealth/31.jpg","/blesshealth/32.jpg","/blesshealth/33.jpg","/blesshealth/34.jpg","/blesshealth/35.jpg","/blesshealth/36.jpg","/blesshealth/37.jpg","/blesshealth/38.jpg","/blesshealth/39.jpg","/blesshealth/40.jpg","/blesshealth/41.jpg","/blesshealth/42.jpg","/blesshealth/44.jpg","/blesshealth/45.jpg","/blesshealth/46.jpg","/blesshealth/47.jpg","/blesshealth/48.jpg","/blesshealth/49.jpg","/blesshealth/50.jpg","/blesshealth/51.jpg","/blesshealth/52.jpg","/blesshealth/53.jpg"],
    "comments": [
      {
        "text": "",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 35,
    "title": "TONGI",
    "description": "Problema Abordado: Las barreras lingüísticas generan malentendidos y limitan el acceso a la información y la interacción en contextos cotidianos.\n\nObjetivo General: Desarrollar una aplicación móvil compatible con Android (versión 10 o superior) e iOS (versión 15 o superior) que facilite la traducción de contenido visual, textual y auditivo utilizando técnicas de inteligencia artificial como OCR (Reconocimiento Óptico de Caracteres) y STT (Voz a Texto).\n\nFuncionalidades Clave:\n- Traducción sin necesidad de conexión a internet (offline).\n- Traducción de texto usando la cámara.\n- 3 modos distintos de traducción (usando OCR, STT y TTS).\n\nTecnologías/Modelos Implementados: Servicios y modelos pre-entrenados como OCR, TTS (Texto a Voz), STT (Voz a Texto) y traductores multilingües.\n\nArquitectura: Se configuró una estructura híbrida para combinar la operación offline con la potencia de los servicios en la nube, buscando un equilibrio entre eficiencia y accesibilidad.\n\nMetodología: Se utilizó una Metodología de Prototipado que incluye las fases de Requerimientos, Diseño, Desarrollo, Refinamiento y Producto.\n\nConclusiones Destacadas:\n- Los requerimientos no funcionales (rendimiento, disponibilidad, escalabilidad y seguridad) fueron determinantes para la arquitectura del sistema.\n- El equipo enfrentó y superó una curva de aprendizaje significativa con nuevas herramientas y tecnologías, fortaleciendo sus competencias técnicas mediante investigación constante.\n- Se implementó el enfoque de Infraestructura como Código (IaC) para mayor portabilidad, automatización y control, creando un sistema resiliente y escalable.\n- El equipo mantuvo la cohesión y productividad, incluso con retos logísticos y personales como la movilidad internacional y diferencias horarias, aplicando los valores de Scrum (empatía, sacrificio y colaboración).",
    "members": [
      "VEGA SABINO FERNANDO JAVIER",
      "CARVAJAL RONDON JUAN DAVID",
      "RODRIGUEZ CURUBO CHRISTIAN MAURICIO",
      "MONTERO GUTIERREZ JOSE DANIEL",
      "PATIÑO PARRA JUAN DAVID"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "PROYECTO INTEGRADOR III",
    "project": "TONGI",
    "images": ["/tongi/1.jpg","/tongi/2.jpg","/tongi/3.jpg","/tongi/4.jpg","/tongi/5.jpg","/tongi/6.jpg","/tongi/7.jpg","/tongi/8.jpg","/tongi/9.jpg","/tongi/10.jpg","/tongi/11.jpg","/tongi/12.jpg","/tongi/13.jpg","/tongi/14.jpg","/tongi/15.jpg","/tongi/16.jpg","/tongi/17.jpg","/tongi/18.jpg","/tongi/19.jpg","/tongi/20.jpg","/tongi/21.jpg","/tongi/22.jpg","/tongi/23.jpg","/tongi/24.jpg","/tongi/25.jpg","/tongi/26.jpg","/tongi/27.jpg","/tongi/28.jpg","/tongi/29.jpg","/tongi/30.jpg","/tongi/31.jpg"],
    "comments": [
      {
        "text": "Pero bueno, ahí se lograron mostrar todo, ustedes pueden ir un momentito, un momentico, a su diagrama. Vamos a hacer un par de, para atrás, vamos al diagrama de clases y les quiero, ahorita vamos a hablar de este tema, más atrás, más atrás, el diagrama de clases. Bueno, ahí yo les he venido diciendo, y que no sé si por acá esté presente el estudiar primero, atributos públicos, no sé por qué ponen un diagrama en clases. Señores, desde que los tuve allá de pequeñito, se me pueden ocurrir muy pocas, pero muy pocas situaciones donde se justifica ser un atributo público. Entonces, por favor, tengan eso en cuenta. En un diagrama de clases, sobre todo cuando está así, de pronto, como tan grande, tan extenso, pueden ahorrárselos porque tiene prioridad mostrar los métodos para expresar el comportamiento y algunas relaciones que veo como un poquito raras, por ejemplo, veo una relación de composición y no veo un constructor, entonces yo no veo la composición; pero aparte de eso, yo veo mucha coherencia en su proceso y la forma como le explican definitivamente demuestra que el trabajo es propio de ustedes. Lo otro es la arquitectura. Si quieren, pueden avanzar un poquitito. Les iba a decir, me gusta que ustedes ya saben utilizar despliegue y componentes para expresar la arquitectura de un sistema. Me gustaría más que dijeran: “no diagrama de despliegue, arquitectura del sistema”, en razón que ahí ustedes están combinando despliegue con componentes. En UML no se define un diagrama de arquitectura en el sentido formal. Nosotros expresamos arquitectura utilizando lo que ustedes tienen allá, que es componentes y despliegue. Y lo otro que me gustaría, si quiera avanzo un poquitico más, es pedirles que en adelante, para todos los que están presentes, por ejemplo, ese STT, es la primera vez que se menciona. Allá arriba, STT. Pues, ¿a dónde voy? Ustedes pueden colocar la abreviatura, pero después de que ya en algún momento lo mencionaron y colocaron el texto, para que en adelante la audiencia sepa que es el STT, de pronto me lo perdí; pero si no lo tienen, pues. Y lo otro, diagrama de secuencia de quién. Entonces ahí ponen en el STT, pero hay otros diagramas donde colocan, por ejemplo, diagrama de clases o diagrama de secuencia. Entonces, es bueno que indiquen ese diagrama a qué corresponde de forma un poco más específica. Bueno, están chéveres los resultados de Scrum, pero lástima que no manejaron bien el tiempo y todo eso como volaron. Ustedes están en PI 3, ¿correcto? ¿Cuál vendría siendo como el foco del proyecto integrado 3? ¿Qué asignaturas? Bien, ¿y cuál otra? ¿A dónde voy? Estuvo muy bien explicado el diagrama de clases, y no es que no tenga importancia, sino que pudieron invertir un poquito más de tiempo para las cosas que tenían, donde tenían que ser un poquitico más el enfoque; me refiero a eso. Bueno, profes, ¿alguien? Entonces, muchas felicitaciones, buen trabajo.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      },
      {
        "text": "Por cuestiones familiares no me alcancé a dar el inicio; sin embargo, vi el final y confío en las apreciaciones de mi compañero Ali para decirles que muy bien, que la evolución que ustedes han tenido desde que nos vimos la primera vez es muy notoria. Entonces, muchas felicitaciones, buen trabajo.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 36,
    "title": "PicLab",
    "description": "El proyecto PicLab! abordó la problemática de manejar grandes volúmenes de imágenes y procesos de transformación (como redimensionamiento, marcas de agua, escala de grises) que requieren alta capacidad de procesamiento y tiempos de espera prolongados.\n\nPregunta Problema: ¿Cómo puede PicLab! diseñar e implementar un sistema distribuido que permita procesar imágenes en paralelo, reduciendo el tiempo de ejecución y garantizando la interoperabilidad entre clientes, servidores y nodos de cómputo?\n\nObjetivo General: Desarrollar un sistema distribuido para el procesamiento de lotes de imágenes en paralelo, utilizando una arquitectura basada en servicios, que permita distribuir la carga de trabajo entre diferentes nodos de procesamiento.\n\nMarco de Trabajo y Tecnología: El proyecto se basó en pruebas de software (Web, unitarias, de integración), Kanban personal, desarrollo web con SPA y API REST, comunicación distribuida mediante RMI, SOAP y REST, versionamiento con GitHub/Git, patrones de diseño (Dependency Injection, Worker pool, objeto nulo, repositorio) y metodologías SDLC.\n\nObjetivos Específicos: Definir requisitos funcionales y no funcionales, diseñar la arquitectura del sistema distribuido (diagramas UML, componentes, clases), implementar comunicación distribuida (SOAP, RMI, API REST), desarrollar nodos de cómputo paralelos con worker pool y RMI, e integrar el sistema para registro, autenticación y envío de trabajos de procesamiento de imágenes.\n\nFuncionalidad del Sistema: Permite a los usuarios subir y transformar lotes de imágenes en cuatro fases: Súbelo (subir imágenes), Transfórmalo (aplicar transformaciones), Configúralo (personalizar solicitud) y Finaliza (confirmar procesamiento).\n\nConclusiones: La implementación de la API REST con .NET redujo tiempos de desarrollo, la aplicación de principios SOLID y patrones de diseño mejoró modularidad y extensibilidad, y el uso de base64 para SOAP fue más directo que MTOM, evitando errores en la transferencia de datos.",
    "members": ["DIAZ GOMEZ NELSON Y."],
    "date": "2025-10-30",
    "teacher": "AUDO ALI DÍAZ GÓMEZ",
    "course": "SISTEMAS DISTRIBUIDOS",
    "project": "PicLab",
    "images": ["/piclab/1.jpg","/piclab/2.jpg","/piclab/3.jpg","/piclab/4.jpg","/piclab/5.jpg","/piclab/6.jpg","/piclab/7.jpg","/piclab/8.jpg","/piclab/9.jpg","/piclab/10.jpg","/piclab/11.jpg","/piclab/12.jpg","/piclab/13.jpg"],
    "comments": [
      {
        "text": "Buen manejo de tiempo, muy bien, dos cosas le voy a decir porque no quiero tomarme todo el bloque de preguntas: primero, ¿por qué decidió mostrarnos primero el producto y luego el proceso de ingeniería? Buena respuesta, gracias; y Jair, lo otro, esto sí no se le puede rebajar: lo que pasa es que usted nos hablaba de SOAP, de RMI, de REST, pero habla de SOAP, del protocolo de RMI que es una tecnología basada en RPC, etc., y se refiere a ellos como personitas, cuando el programa acá se comunica con SOAP, ¿no? Sí, me hago entender, entonces confunde a la audiencia; hay que recordar que acá hay chicos que están haciendo, por ejemplo, varios de mis alumnos de paradigmas de programación, que están tratando de aprender de lo que hacen los que ya vienen más adelante y tienen proyectos mucho más avanzados, y necesitamos que ellos tengan buenas bases, por eso necesitan que ustedes tengan una buena forma de expresarse, por lo menos que sean muy técnicos y se apeguen bien a la forma como se ven esas cosas; de resto, está muy bueno, me gustó mucho el proyecto, solo quería hacer la salvedad: a Jair no le correspondía, por el alcance del proyecto, incluir el desarrollo de una aplicación cliente, él tenía que dejar hasta el punto donde exponía las interfaces para que aplicaciones cliente pudieran conectarse al sistema y consumir los servicios; sin embargo, el muchacho decidió hacer todo el proyecto completico, que era un trabajo para tres, y lo hizo él solo, valía la pena hacer la observación para que su audiencia lo sepa. Gracias, usted no lo contó.Venga, te pregunto una cosa, Yair. ¿Qué es SOAP entonces? ¿Es un...? Dígalo, por lo que más quiera. Ya tengo miedo. Dígalo. Es que estoy enterado. Bien, ¿no? La P de papá que representa en el nombre SOAP. Bien, muy bien. Entonces sí sabe algo, ¿no? Y entonces le pregunto, la complejidad que resume SOAP, ¿dónde se ve a nivel de programación? Venga, y le pregunto entonces, ¿de esta forma contrasta con algo que usted maneja muy bien hace siete semestres? ¿REST? ¿Vamos? ¿REST? Es un estilo arquitectónico, no es un protocolo. Bien, ok, bien. Y entonces, en REST, yo les mostré, ¿se acuerdan cuántos códigos de error posibles hay que manejar con REST? Sí, bueno, sí, son... Hay entre uno y quinientos. Bueno, y es por ahí. Ahora, de SOAP, de nuevo, ¿cuántos códigos de esos le toca programar con SOAP? Le repito la pregunta. De esos códigos que usted vio cómo los maneja REST, por ejemplo, 200, 301, ¿cuáles de esos le toca revisar cuando trabaja con SOAP? Para que le permita implementar objetos distribuidos y entonces usted llama su objeto remoto localmente como si lo tuviera local. Entonces, si sabe, ¿por qué no le responde al profesor? Entonces, ¿qué pasaría si lo que dice el profe Lenin es muy cierto, porque el proyecto lo tiene muy completo y al no saber responder esas pequeñas preguntas pierde valor? En eso estoy completamente de acuerdo con él y no se la podemos rebajar, porque el propósito es que usted aprenda esas cosas, porque ahorita usted tiene que apuntarle a una empresa como Global, ¿cierto? Ese es el propósito, ¿cierto? Y usted necesita tener conceptos muy claros; usted no puede estudiar en eso porque usted no tiene dinero. Pero buen proyecto y lo felicito, de verdad, días. Muchas gracias.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      },
      {
        "text": "Bueno, ¿yo? Bueno, compañero, ¿cómo estáis? Bien, posiblemente. Bueno, nos faltan referencias. Sí. ¿Por qué usas SOAP? ¿Y qué es SOAP? ¿Dije SOAP? ¿Y qué es? ¿Y cómo funciona? ¿Cómo funciona? ¿Sabes cómo funciona? ¿Cómo lo implementas? La siguiente pregunta, si tienes algún momento que tomar la decisión entre usar SOAP o RESTful, ¿cuál usas? Ay, qué buena respuesta. ¿Por qué no arranca por ahí? Ah, pues porque es personal. Aquí nada personal. Todos negocios. ¿Cuál es la diferencia entre SOAP y RESTful? Ah, perdón. Tienes que saber porque si no, no puedes tomar una decisión. Si el proyecto te sienta el P, el ¿por qué? Te sientas con el equipo de desarrollo y el funcionario te dice, necesitamos hacer esto, pero el cliente dice que debías usar SOAP, y el otro te dice, no, pero es que tenemos que usar redes, y se forma ahí la discusión. Tú tienes que tener una base para decir qué vamos a usar. ¿Sí? Sí, toca. Y estás viendo sistemas distribuidos y dentro de sistemas distribuidos vemos esos conceptos. ¿Sí? Entonces, tienes que revisarlo, ¿no? Cuando te metas en un proyecto, hay que saber cómo funcionan las cosas. Porque si no, bueno... Ah, yo trabajé con SOAP. Entonces, ¿qué usamos? En algún momento dices, se comunican mediante REST. ¿Qué significa eso? El API no es comunicaciones. REST no es un protocolo de comunicación. Entonces, ¿por qué es que se comunican mediante REST? La API REST para comunicarse. Sí. ¿Hay estudio de REST o no? ¿Cómo se comunican las computadoras? ¿Protocolos? ¿Cuáles? Bueno, ¿y qué es REST entonces? ¿Cómo? Esos detalles, miren, esos detalles son los que los van a sacar a ustedes adelante de la IA. Porque si yo les digo a la IA, escribe esto, y él escribe lo que quiere, te pone lo que sea, y te dice, bueno, sí, no sé, aceptar. Entonces, ¿por qué te voy a pagar? REST es una especificación. ¿Vale? No es ni un protocolo, nada. ¿Y por qué no lo dice? Es que no sabe, o sea, no te va a pagar. ¿Ya qué? ¿Ya qué? Yo sí sabía, sí. No, no sabía. Ya nada, ya perdió. Sí. Si usted no dice, no, no, sí, ah, sí, yo sabía. No, no, ya qué. Sí, es una especificación. Entonces, esa frase, que es a lo que le estaba haciendo referencia el profesor Ali, es muy raro cuando dices, es que se comunica a través de redes. Pues tú eres ingeniero de sistemas, ingeniero. Entonces, ¿cómo funciona eso? ¿Cómo vas a decirlo? Aquí estábamos discutiendo con el profesor Ali, son detalles de fina coquetería que te hacen subir niveles. Por decir una frase como esa, puedes perder un trabajo. Nada más, no sabe cómo funciona eso. ¿Sí? Por una frasecita de esas. Es detalles, son los detalles. Ya llegaste al último escalón, entonces hay que seguir puliendo y nos puliendo. Muy buen trabajo, siempre haces muy buen trabajo. Muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 37,
    "title": "Histofy",
    "description": "Problema Abordado:\nLas barreras lingüísticas que generan malentendidos y limitan el acceso a la información y la interacción en contextos cotidianos.\n\nObjetivo General:\nDesarrollar una aplicación móvil compatible con Android (versión 10 o superior) e iOS (versión 15 o superior) que facilite la traducción de contenido visual, textual y auditivo utilizando técnicas de inteligencia artificial como OCR (Reconocimiento Óptico de Caracteres) y STT (Voz a Texto).\n\nFuncionalidades Clave:\n- Traducción sin necesidad de conexión a internet (offline).\n- Traducción de texto usando la cámara.\n- 3 modos distintos de traducción (usando OCR, STT y TTS).\n\nTecnologías/Modelos Implementados:\nServicios y modelos pre-entrenados como OCR, TTS (Texto a Voz), STT (Voz a Texto) y traductores multilingües.\n\nArquitectura:\nSe configuró una estructura híbrida para combinar la operación offline con la potencia de los servicios en la nube (probablemente Azure), buscando un equilibrio entre eficiencia y accesibilidad.\n\nMetodología:\nSe utilizó una Metodología de Prototipado que incluye las fases de Requerimientos, Diseño, Desarrollo, Refinamiento y Producto.\n\nConclusiones Destacadas:\nLos requerimientos no funcionales (rendimiento, disponibilidad, escalabilidad y seguridad) fueron determinantes para la arquitectura del sistema.\nEl equipo enfrentó y superó una curva de aprendizaje significativa con nuevas herramientas/tecnologías.\nSe implementó Infraestructura como Código (IaC) para mayor portabilidad y automatización.\nEl equipo mantuvo la cohesión aplicando los valores de Scrum (empatía, sacrificio y colaboración).",
    "members": [
      "CASTRO ORTIZ CAMILO ALFONSO",
      "GOMEZ BUENO JUAN ANGEL",
      "MENESES ROJAS ANTONELLA",
      "TELLEZ SALAZAR VALENTINA",
      "VILLARREAL VASQUEZ ANGIE LORENA"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "PROYECTO INTEGRADOR III",
    "project": "Histofy",
    "images": ["/histofy/1.jpg","/histofy/2.jpg","/histofy/3.jpg","/histofy/4.jpg","/histofy/5.jpg","/histofy/6.jpg","/histofy/7.jpg","/histofy/8.jpg","/histofy/9.jpg","/histofy/10.jpg","/histofy/11.jpg","/histofy/12.jpg","/histofy/13.jpg","/histofy/14.jpg","/histofy/15.jpg","/histofy/16.jpg"],
    "comments": [
      {
        "text": "Yo veo un proyecto bueno; a simple vista se nota completo. Hicieron varias cosas. Metieron la pata —me perdonan la expresión— como principiantes en el manejo del tiempo. Esto no debería ser sorpresa para ustedes: ya tienen que aprender a controlarlo. ¿Pueden retroceder un momento? Vi un diagrama llamado modelo ilustración. Bien, voy a llamar la atención sobre algunos elementos de este diagrama. Empecemos por el título. ¿Quién me lo lee? O mejor, ¿quién me lo deletrea? Ok, ya vieron el problema. Perfecto. Entonces, les pido otro favor: el mayor y el menor que aparecen donde dice FastAPI. Eso se supone que es un ícono, ¿cierto? Está bien usar íconos, pero… ¿qué significa el documento? ¿Qué representa la cabecita? ¿Qué quiere decir el menor/mayor que? ¿Y esa “ballenita”? Es decir, ustedes crearon un lenguaje nuevo con este diagrama, pero no explicaron qué significa cada elemento. Por eso los ingenieros usamos un estándar, o en su defecto, explicamos la simbología usada. No está mal crear un diagrama propio para expresar una idea, pero deben aclarar qué representa cada símbolo para que sea comprensible. Lo otro: los objetivos. A la derecha, por favor. No, los específicos. ¿Dónde están? Ustedes mencionaron una norma americana, ¿cierto? No, ¿la HIPAA? Bien, entonces me equivoqué, pero recuerden que nuestra ley colombiana también incluye el manejo de datos sensibles, como la información de salud. Quizás podrían haber hecho referencia a eso también.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      },
      {
        "text": "No sé por qué tanto drama con el tiempo para contarnos una historia y no mostrarnos nada; el proyecto tiene una aplicación que se ve que funciona, pero en términos de la presentación es muy deficiente; ya he hablado durante toda la jornada sobre diseño de ingeniería, requerimientos, diagramas y muchas cosas que no quiero repetir porque ya las he dicho tres días; si ustedes han estado aquí, son conscientes de que, por ejemplo, ese diagrama de casos de uso no funciona, no sirve; en arquitectura e infraestructura no funcionan; por ejemplo, pasando así nomás, no hay referencias, no sabemos de dónde salen estas cosas; las ideas están sueltas y no coordinan lo que dicen con lo que pasa en el proyecto; perdónenme, pero no parece un proyecto integrador de tres; no es cómodo para mí decirlo, no quisiera llegar a esto; en la pregunta de investigación y en la problemática pusieron: “¿Cómo puede la IPS mejorar la clasificación automática y gestión de historias clínicas sin descuidar la privacidad y la protección de los datos de los pacientes?” —pues yo vi todo menos eso—; por eso creo que el proyecto está mal planteado y, de ahí en adelante, será lo que sea; los invito a reflexionar porque esto no es pasar por pasar: aquí hacemos un ejercicio que es importante para el resto de su carrera, así que piensen un poco y recuerden lo que hemos venido conversando en los proyectos; ¿vale? Muchas gracias.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 38,
    "title": "MediTranslateAI",
    "description": "El proyecto, denominado MediTranslateAI, busca mejorar la comprensión de la información médica por parte de los pacientes mediante el uso de Inteligencia Artificial y Procesamiento de Lenguaje Natural (NLP). \n\nSituación Problema:\nLos pacientes a menudo enfrentan dificultades para entender su información médica debido al lenguaje técnico utilizado y la dispersión de sus historias clínicas en múltiples fuentes. Esto limita su participación activa en el cuidado de su salud y dificulta la comunicación médico-paciente. \n\nPregunta Problema:\n¿Cómo puede una aplicación basada en inteligencia artificial ayudar a los usuarios a comprender su información médica de forma clara, segura y accesible? \n\nObjetivo General:\nDesarrollar una aplicación móvil que permita a los usuarios comprender y gestionar su información médica de forma clara, segura y accesible, aprovechando el poder de la inteligencia artificial y las técnicas de procesamiento de lenguaje natural. \n\nObjetivos Específicos:\n- Diseñar un sistema que traduzca terminología médica a un lenguaje claro y comprensible para los pacientes, utilizando técnicas de NLP.\n- Desarrollar un módulo inteligente que analice historias clínicas y extraiga información relevante para su interpretación.\n- Implementar un historial clínico digital centralizado que organice la información médica de manera cronológica y accesible.\n- Integrar un panel de indicadores y seguimiento de salud, con registro de medicamentos y visualización de la evolución del paciente. \n\nConclusión:\nMediTranslateAI propone una solución innovadora que combina inteligencia artificial y comprensión del lenguaje natural para empoderar a los pacientes, permitiéndoles acceder y entender su información médica de forma intuitiva. Este enfoque promueve la autonomía del usuario, fortalece la comunicación médico-paciente y contribuye a una atención médica más informada y personalizada.",
    "members": [
      "GRANADOS MORENO JAVIER MAURICIO",
      "MARIN DIAZ EDWARD DANIEL",
      "PRADA LUGO MARCO ANTONIO",
      "VERA MONTAÑA JIMMY ANDRES",
      "GALVIS NAVARRO DANIEL FELIPE"
    ],
    "date": "2025-10-30",
    "teacher": "OMAR PINZÓN ARDILA",
    "course": "PROYECTO INTEGRADOR III",
    "project": "MediTranslateAI",
    "images": ["/meditranslateai/1.jpg","/meditranslateai/2.jpg","/meditranslateai/3.jpg","/meditranslateai/5.jpg","/meditranslateai/6.jpg","/meditranslateai/7.jpg","/meditranslateai/8.jpg","/meditranslateai/9.jpg","/meditranslateai/10.jpg","/meditranslateai/11.jpg","/meditranslateai/12.jpg","/meditranslateai/13.jpg","/meditranslateai/14.jpg","/meditranslateai/15.jpg","/meditranslateai/16.jpg","/meditranslateai/17.jpg","/meditranslateai/18.jpg"],
    "comments": [
      {
        "text": "",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 39,
    "title": "PixPar",
    "description": "El proyecto se titula \"PixPar - Sistema distribuido para procesamiento de imágenes en paralelo\".\n\nSituación Problema:\nEl procesamiento de grandes volúmenes de imágenes en sistemas centralizados presenta dificultades como:\n- Falta de escalabilidad y tolerancia a fallos.\n- Demoras en el procesamiento.\n- Pérdida de información.\n- Limitaciones para atender múltiples solicitudes simultáneamente, afectando la eficiencia, disponibilidad y seguridad de los datos.\n\nObjetivo General:\nDesarrollar un sistema distribuido para el procesamiento de imágenes que integre una aplicación web, un backend en Python y nodos de procesamiento paralelos, utilizando comunicación híbrida basada en SOAP/HTTPS y gRPC para garantizar escalabilidad, tolerancia a fallos y servicios de registro, almacenamiento y transformación de imágenes.\n\nObjetivos Específicos:\n- Diseñar la arquitectura distribuida mediante diagramas de clases, base de datos y definición de protocolos SOAP/HTTPS y gRPC para garantizar integración y comunicación entre componentes.\n- Implementar el backend con servicios SOAP/HTTPS, gestión de colas y coordinación de nodos vía gRPC, centralizando el control del sistema.\n- Desarrollar los nodos de procesamiento y la aplicación web para ofrecer una experiencia completa al usuario.\n- Integrar y validar el sistema completo mediante servidor de base de datos, almacenamiento redundante y tolerancia a fallos, asegurando disponibilidad, confiabilidad y continuidad del servicio.\n\nMetodología:\nSe utilizó una Metodología Incremental con ciclos de Análisis, Diseño, Codificación y Pruebas/Ajustes.\n\nMarco Teórico:\nConceptos clave de Sistemas Distribuidos:\n- Arquitectura: Patrones de diseño (Proxy, Adaptador, Chain of Responsibility), balanceo de carga, tolerancia a fallos (Heartbeat, Reintentos).\n- Servicios y Protocolos: SOAP, API REST, gRPC.\n- Procesamiento Paralelo: Thread Pool, Colas de mensajes, Consumidores.\n- Rendimiento: Caching.\n- Selección de Nodos: Service Discovery/Registry.\n\nConclusiones:\nEl desarrollo del sistema integró competencias en patrones de diseño y prácticas profesionales.\nEl enfoque incremental permitió ciclos cortos de retroalimentación y priorización efectiva.\nLa viabilidad del sistema se basó en la estandarización del intercambio de datos mediante XML/SOAP y RPC, reduciendo acoplamiento y facilitando pruebas e integración.",
    "members": [
      "ARDILA BAEZ PATRICIA",
      "MALDONADO ROJAS SANTIAGO",
      "PEREZ LUNA KAREN Y."
    ],
    "date": "2025-10-30",
    "teacher": "AUDO ALI DÍAZ GÓMEZ",
    "course": "SISTEMAS DISTRIBUIDOS",
    "project": "PixPar",
    "images": ["/pixpar/1.jpg","/pixpar/2.jpg","/pixpar/3.jpg","/pixpar/4.jpg","/pixpar/5.jpg","/pixpar/6.jpg","/pixpar/7.jpg","/pixpar/8.jpg","/pixpar/9.jpg","/pixpar/10.jpg","/pixpar/11.jpg","/pixpar/12.jpg","/pixpar/13.jpg","/pixpar/14.jpg","/pixpar/15.jpg","/pixpar/16.jpg","/pixpar/17.jpg"],
    "comments": [
      {
        "text": "",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  },
  {
    "id": 40,
    "title": "DistriFile",
    "description": "El proyecto, llamado DistriFile, se centró en el diseño e implementación de un sistema de almacenamiento distribuido con redundancia.\n\nSituación Problemática:\nLos sistemas centralizados de gestión de archivos presentan limitaciones al concentrar la información en un solo servidor, lo que provoca una disminución en el rendimiento ante múltiples solicitudes simultáneas. Además, la falta de copias adicionales implica la pérdida total de información si el archivo se pierde.\n\nObjetivo General:\nDesarrollar un sistema de almacenamiento distribuido que:\n- Permita almacenar y recuperar archivos mediante fragmentación y redundancia en múltiples nodos.\n- Esté coordinado por un servidor de aplicación que exponga servicios SOAP para operaciones de gestión de archivos y autenticación de usuarios.\n- Se comunique con los nodos de almacenamiento mediante RMI (Remote Method Invocation).\n\nLo que se Hizo (Objetivos Específicos):\nEl proyecto abordó los siguientes puntos:\n\nDesarrollo del Servidor de Aplicación y Servicios:\n- Implementar servicios como registro, autenticación, carga y descarga de archivos.\n- El servidor se encarga de fragmentar los archivos y distribuirlos en los nodos disponibles, coordinando las operaciones para manejar archivos completos.\n\nMecanismo de Almacenamiento Redundante:\n- Implementar operaciones de listado y eliminación de archivos.\n- Establecer un mecanismo de almacenamiento redundante que guarde copias de cada fragmento en al menos dos nodos.\n- Esto permite al sistema recuperar un archivo completo incluso si uno de los nodos deja de estar disponible.\n\nDiseño de Arquitectura y Comunicación:\n- Diseñar la arquitectura del sistema distribuido (diagramas de clases, modelo de base de datos, etc.) para definir las responsabilidades del servidor de aplicación, los nodos de almacenamiento y el cliente.\n- Implementar la comunicación:\n  - SOAP para la interacción entre el cliente y el servidor de aplicación.\n  - RMI para la coordinación entre el servidor de aplicación y los nodos de almacenamiento.\n\nConclusiones Clave:\nEl diseño de la arquitectura definió los roles del servidor, nodos y cliente, permitiendo un desarrollo modular y el despliegue en máquinas virtuales distintas, simulando un entorno distribuido real.\nLa comunicación mediante SOAP y RMI fue funcional, aunque implicó inconvenientes adicionales relacionados con la serialización de objetos y el manejo de excepciones remotas, lo que retrasó las pruebas.\nLa implementación de la redundancia de fragmentos en múltiples nodos permitió explorar la tolerancia a fallos y la distribución de carga.\nSe evidenciaron dificultades iniciales por no definir la arquitectura desde el principio, destacando la importancia de una planificación arquitectónica basada en los requerimientos funcionales y no funcionales.",
    "members": ["ROMERO CASTRO MARIA J."],
    "date": "2025-10-30",
    "teacher": "AUDO ALI DÍAZ GÓMEZ",
    "course": "SISTEMAS DISTRIBUIDOS",
    "project": "DistriFile",
    "images": [
  "/distrifile/1.jpg","/distrifile/2.jpg","/distrifile/3.jpg","/distrifile/4.jpg","/distrifile/5.jpg","/distrifile/6.jpg","/distrifile/7.jpg","/distrifile/8.jpg","/distrifile/9.jpg","/distrifile/10.jpg","/distrifile/11.jpg","/distrifile/12.jpg","/distrifile/13.jpg","/distrifile/14.jpg","/distrifile/15.jpg","/distrifile/16.jpg","/distrifile/17.jpg","/distrifile/18.jpg"],
    "comments": [
      {
        "text": "Me encantaba verte; muy buen trabajo, muy buena exposición, excelentes modelos y flujo; ahora, hablemos de cositas de ingenieros: ¿cómo gestionas el WSDL?, ¿ya hiciste alguna implementación para gestionarlo o lo usas a través de un RMI?, o sea, ¿usas el parse de Java? —sí, exactamente—; muy bien; ¿tienes algún sistema de colas para las llegadas de los colores repartidos por Java?, ¿colas?, ¿hilos?; diferencia entre REST y SOAP: empezaste con “yo creo”, “yo creo”, y ya no te creo; hay que evitar eso; no me des la respuesta más fácil, dame otra razón; después de todo el sistema que hiciste, sé que sabes la respuesta; sí, porque el protocolo que usas es parte del problema y está en la situación problema y en la pregunta; yo iba a decir, ¿por qué está en la solución? —ah, es que el cliente pidió específicamente usar esos protocolos—; bueno, un detallito importante: recuerden que REST es una especificación, RESTful es la implementación, y RESTful funciona sobre HTTP; el que transporta realmente es HTTP, lo que pasa es que sigue las reglas recomendadas por la especificación REST; entonces, cuando dices “uso REST”, en realidad estás diciendo que los métodos que vas a gestionar son POST, PUT, PATCH, etc., pero esos métodos no son de REST, son del protocolo HTTP; REST, como especificación, te dice que uses con una semántica adecuada lo que ofrece HTTP para que las partes se puedan entender entre sí; así que cuidado con decir “se transporta por REST”, porque no es cierto; es un detalle, pero de fina coquetería; muy buen trabajo.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      },
      {
        "text": "¿Usted trabajó sola? La felicito, porque hizo el trabajo muy bien, tiene un buen dominio del tema, y además lo hizo sola; o sea, con grupos de siete apenas llegamos al 30%, pero gracias.",
        "teacher": "ING CLAUDIA",
        "image": "claudia.jpg"
      },
      {
        "text": "María José, bueno, quería pedirle un favor. Yo creo que usted nos puede ayudar retrocediendo todo desde el principio. Yo creo que usted no se pregunta nada. Habíamos quedado… Ahí, me adelanto un poquito más. Siguiente, siguiente, siguiente, siguiente, siguiente, siguiente. Un poquito más adelante. El marco. Sí, eso, ahí. Muchas gracias. Creo que es la primera vez que lo vemos en la jornada. Así es. En esta jornada, las ideas bien conectadas. Muchas gracias por hacerlo. La felicito.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      }
    ]
  },
  {
    "id": 41,
    "title": "Bless Image Plus",
    "description": "BLESS IMAGE PLUS\n\"Eleva tus imágenes, bendecidas por la nube.\"\n\nEl proyecto consistió en el desarrollo de un sistema distribuido llamado \"Bless Image Plus\" para el procesamiento paralelo de lotes de imágenes.\n\nProblemática Abordada:\nLas aplicaciones de procesamiento de imágenes (como plataformas médicas o sistemas de vigilancia) que se concentran en un solo servidor enfrentan altos tiempos de respuesta, incapacidad para atender múltiples solicitudes simultáneamente y reducción de la eficiencia.\n\nLa falta de mecanismos de coordinación entre nodos de cómputo en entornos distribuidos genera uso desigual del hardware y posibles fallos por sobrecarga.\n\nEl sistema busca satisfacer la necesidad en entornos académicos y empresariales de distribuir las tareas de procesamiento de imágenes de forma controlada, supervisando el estado de los nodos y consolidando los resultados.\n\nObjetivo General:\nDesarrollar un sistema distribuido para el procesamiento paralelo de imágenes, implementando comunicación entre servidor y nodos mediante gRPC, y gestionando las solicitudes de transformación a través de una interfaz SOAP.\n\nEl propósito era ejecutar operaciones concurrentes y almacenar los resultados y métricas de procesamiento en una base de datos relacional.\n\nPregunta Problema:\n¿De qué manera puede un sistema distribuido procesar lotes de imágenes en paralelo mediante gRPC y SOAP, controlando los hilos activos y el porcentaje de tareas finalizadas?\n\nMetodología y Tecnología Clave:\nSe utilizó la Metodología Espiral (Planificación, Evaluación de riesgos, Desarrollo y verificación, Planificación de la siguiente fase).\n\nEl sistema empleó un Worker Pool y se basó en el uso de protocolos de comunicación SOAP, WSDL y gRPC (Google RPC).\n\nSe desarrollaron módulos en Python y PHP, implementando las interfaces gRPC y SOAP para la comunicación, y una interfaz gráfica de usuario con Vue para la visualización.\n\nConclusiones Clave:\nEl equipo adquirió experiencia y conocimiento en las siguientes áreas:\n\nDiseño de Sistemas: Habilidades consolidadas en el diseño de la estructura del sistema usando diagramas UML y bases de datos MySQL, permitiendo identificar dependencias y prever errores.\n\nDespliegue y Virtualización: El despliegue del sistema en máquinas virtuales configuradas en Oracle VirtualBox con Ubuntu permitió afianzar conocimientos sobre virtualización, administración de entornos locales y despliegue de sistemas distribuidos de forma autónoma y controlada.\n\nComunicación e Interoperabilidad: Adquirieron experiencia clave en el uso de adaptadores puente, enrutamiento IP y control de tráfico entre subredes. También se destacaron los desafíos y el aprendizaje de la integración de microservicios con gRPC y SOAP, incluyendo la incompatibilidad de versiones de librerías, la gestión de dependencias, y la estructura de servicios interoperables entre un backend Python y un backend PHP.",
    "members": ["CHAVEZ KING JULIANA", "VEGA SABINO FERNANDO J."],
    "date": "2025-10-30",
    "teacher": "AUDO ALI DÍAZ GÓMEZ",
    "course": "SISTEMAS DISTRIBUIDOS",
    "project": "Bless Image Plus",
    "images": ["/blessImagePlus/1.jpg", "/blessImagePlus/2.jpg", "/blessImagePlus/3.jpg", "/blessImagePlus/4.jpg", "/blessImagePlus/5.jpg", "/blessImagePlus/6.jpg", "/blessImagePlus/7.jpg", "/blessImagePlus/8.jpg", "/blessImagePlus/9.jpg", "/blessImagePlus/10.jpg", "/blessImagePlus/11.jpg", "/blessImagePlus/12.jpg", "/blessImagePlus/13.jpg", "/blessImagePlus/14.jpg", "/blessImagePlus/15.jpg", "/blessImagePlus/16.jpg", "/blessImagePlus/17.jpg", "/blessImagePlus/18.jpg", "/blessImagePlus/19.jpg", "/blessImagePlus/20.jpg"],
    "comments": [
      {
        "text": "Muchas gracias. Me pareció curioso una de las conclusiones que hablaban de las máquinas virtuales. ¿Fue la primera vez que trabajaron con máquinas virtuales? Entonces, para aclararlo, es la primera vez que ustedes mismos las configuran, porque antes trabajaban con infraestructura en la nube y ahora tuvieron que montar sus propias máquinas virtuales. Entonces, ¿no habían tenido dificultad para comunicar software desplegado en diferentes máquinas virtuales? Bien, ahí está. Avance un poquitico, por favor. Y avance un poquitico a la izquierda. Bueno, y es que este problema me hizo caer en cuenta, y tiene razón en algo: yo les sugerí que colocaran el contrato y pusieran una relación de dependencia o de uso, ¿sí?, para poder relacionar la interfaz —la notación lollipop— con el contrato, la interfaz que está ahí abajo. Pero me colocan una relación. ¿Esa relación de qué es? Correcto. Entonces, abajo, ¿qué tendría que decir? Si está realizando eso, entonces abajo tendría que decir que es una clase, no una interfaz. La relación le cambia por completo el significado a eso. Pero me gusta que ustedes expresan su arquitectura completa, con sus contratos, todo muy completico. Me gustaría que vayan teniendo en cuenta que, cuando dibujamos una interfaz o una clase, por lo menos prefiero que respeten los compartimentos, porque si le quitan las líneas, ya pierde significado. En UML, el dibujo de clase tiene tres compartimentos: nombre de la clase, atributos y métodos. Ustedes me dejan el compartimento de los atributos básicos, pero respétenmelo. Quiero felicitarlos: el proyecto está completo y muy bien trabajado.",
        "teacher": "ING AUDO DÍAZ",
        "image": "audo.jpg"
      },
      {
        "text": "Pregunta seria: háblame de los algoritmos que utiliza el sistema, porque hacen muchas cosas, pero no nos cuentan cómo se hace. Exactamente, ¿tú hiciste ese algoritmo? ¿Es de implementación? ¿Estás usando el servicio o tú escribiste lo que me acabas de contar? Te quedas así como… sí, es que eso es algo muy importante, ¿vale? Porque ahí tú demuestras que entiendes cómo funciona el sistema distribuido. Ahora, siguiente pregunta: ¿tiene colas? Pero sin el algoritmo que acabas de contar, no hay nada. Entonces, a veces nosotros —creo que este comentario es muy importante— subestimamos lo que hacemos, y como lo hacemos, nos parece que no vale, ¿no? Ese es el negocio. O sea, lo que nos acabas de decir, cómo se hace la distribución, cómo se envían las cosas, cómo se maneja la cola: ese es el sistema distribuido. En sistemas distribuidos, en un curso mío, los compañeros hicieron todo un protocolo de transferencia, prácticamente se lo inventaron ellos. Daba para escribir un paper, lo más que no quisieron escribirlo. Pero ahí estaba el corte de negocio. Ya les pasaba lo mismo: se hicieron semejante implementación que daba para publicación. Así que ustedes también tienen una forma de hacer las cosas que puede llegar muy alto. Tengan más fe en su implementación.",
        "teacher": "ING LENIN SERRANO",
        "image": "lenin.jpg"
      }
    ]
  }
]